{
  "FeedLevelAuthor": "Microsoft Developer",
  "PubDate": "2026-01-13T16:56:35+00:00",
  "FeedName": "Microsoft Developer YouTube",
  "Tags": [
    "Azure",
    "Cloud Computing",
    "Dev",
    "Development",
    "Microsoft",
    "Tech",
    "Technology"
  ],
  "FeedUrl": "https://www.youtube.com/feeds/videos.xml?channel_id=UCsMica-v34Irf9KVTh6xx-g",
  "OutputDir": "_videos",
  "Title": "How Actors Can Use AI to Boost Their Careers, with Hans Obma | Cozy AI Kitchen",
  "Link": "https://www.youtube.com/watch?v=0hZEqnYqCRY",
  "EnhancedContent": null,
  "Description": "Welcome to Cozy AI Kitchen, where we explore how AI can empower creators! In this episode, actor, producer, and director Hans Obma (known for Better Call Saul, WandaVision, and more) shares how he uses AI tools like ChatGPT to learn languages, prepare for interviews, and promote his projects—including his Welsh-language film.\n\nHans dives into:\n\n- How AI helped him practice Welsh before a live TV interview\n- Using AI to research film festivals and build relationships\n- Why empathy and clear communication matter—even with AI\n- Practical advice for actors navigating the AI era\n\nIf you’re an actor, creator, or just curious about AI in entertainment, this episode is packed with insights you won’t want to miss.\n\nWhat You’ll Learn\n\n✅ How actors can leverage AI for language learning and interview prep ✅ Practical ways AI can support film promotion and festival submissions ✅ Why context matters when prompting AI for better results ✅ How empathy and Dale Carnegie principles apply to AI-assisted communication ✅ Tips for discovering and amplifying your unique strengths in a competitive industry Chapters 00:00 - How Actors Can Use AI Today 00:00:17 - AI’s Role in Creativity: Positive and Negative Perceptions 00:00:30 - Meet Hans Obma: Actor, Producer, Director 00:01:04 - The Welsh Language Journey 00:02:00 - Learning Languages as an Actor: Self-Reliance vs. Entourage 00:03:19 - Practicing Welsh with ChatGPT Before a Live Interview 00:05:03 - Overcoming Fear of AI and Using It Strategically 00:06:02 - Submitting to Film Festivals with AI Research 00:07:17 - The Power of Context in AI Prompts 00:08:51 - Empathy, Relationships, and Dale Carnegie Principles with AI 00:11:03 - Advice for Aspiring and Experienced Actors in the AI Era 00:12:36 - Closing Thoughts and Where to Follow Hans’ Work\n\nSpeakers Hans Obma – Actor, Producer, Director Follow Hans: https://instagram.com/hansobma IMDB: https://www.imdb.com/name/nm3155819/\n\nHost: John – Cozy AI Kitchen\n\nLinks & Resources 🚀 Try Azure for free: https://aka.ms/AzureFreeTrialYT 📚 Learn more about AI tools for creators: https://learn.microsoft.com/ai 🎥 Watch all Cozy AI Kitchen episodes: https://aka.ms/CAIK-YTPlaylist 🔔 Subscribe for more episodes on AI, creativity, and tech!\n\nHashtags #CozyAIKitchen #AIForActors #ArtificialIntelligence #ChatGPT #FilmIndustry #ActorLife #BetterCallSaul #WandaVision #MicrosoftAI #AzureAI #MachineLearning #EntertainmentTech #FilmFestival #LanguageLearning #CreatorTools",
  "ProcessedDate": "2026-01-13 17:07:34",
  "Author": "Microsoft Developer"
}
