{
  "ProcessedDate": "2026-02-12 17:22:21",
  "Link": "https://www.youtube.com/watch?v=PamhXD0m4fs",
  "PubDate": "2026-02-12T17:00:39+00:00",
  "OutputDir": "_videos",
  "Author": "Microsoft Developer",
  "Description": "🚀Visit the Repo: https://aka.ms/budgetbytes 🚀Get started for FREE: https://aka.ms/budgetbytes/freeoffer\n\nWhat if a production ready clinic app could be generated, iterated, and deployed mostly by AI, and cost less than $10? Join us, Amar and Arvind, to see how we built a professional web app for a university dental clinic using a Copilot first workflow in VS Code with GitHub Copilot Pro to scaffold the .NET solution, author deployment scripts, and accelerate debugging. We run it on Azure App Service (F1) and store data in Azure SQL Database (free offer) to keep performance high and costs tiny.\n\nYou’ll see how we capture persona driven requirements (patients, front office, providers) and implement core features like conflict free scheduling, secure role based access, and billing. We also wire up AI summarization of medical history with Azure OpenAI, invoked securely from Azure SQL using Microsoft Entra ID (managed identity) to stay password-less and compliant-minded.\n\nFinally, we share the cost breakdown and the patterns that make “smart features on a smart budget” repeatable. Built with the Azure SQL Database free offer, Azure App Service (F1), VS Code + GitHub Copilot Pro, Azure OpenAI, and Microsoft Entra ID (managed identity), all in for under $10.\n\nChapters 0:00 - Introduction 0:07 - Student-led clinic use case 0:30 - Requirements 2:53 - Using the Azure SQL Database free of charge 4:13 - Building the app 4:53 - First steps in agent mode in GitHub CoPilot 11:25 - Autoscaling mode for $0 12:20 - Using SQL and Entra ID 18:30 - Architecture and Flow 26:05 - Budget Breakdown\n\n🔔 Subscribe now so you don't miss an episode!",
  "FeedUrl": "https://www.youtube.com/feeds/videos.xml?channel_id=UCsMica-v34Irf9KVTh6xx-g",
  "Tags": [
    "Azure",
    "Cloud Computing",
    "Dev",
    "Development",
    "Microsoft",
    "Tech",
    "Technology"
  ],
  "FeedLevelAuthor": "Microsoft Developer",
  "FeedName": "Microsoft Developer YouTube",
  "Title": "Develop a Web App with CoPilot and Azure SQL Database for Under $10!",
  "EnhancedContent": null
}
