{
  "Title": "Build Powerful AI Apps for under $25 using Azure SQL Database",
  "OutputDir": "_videos",
  "FeedLevelAuthor": "Microsoft Developer",
  "ProcessedDate": "2026-01-15 21:04:28",
  "Tags": [
    "Azure",
    "Cloud Computing",
    "Dev",
    "Development",
    "Microsoft",
    "Tech",
    "Technology"
  ],
  "EnhancedContent": null,
  "Author": "Microsoft Developer",
  "PubDate": "2026-01-15T20:00:20+00:00",
  "FeedName": "Microsoft Developer YouTube",
  "Link": "https://www.youtube.com/watch?v=NY_ESU6GKM0",
  "Description": "Today, we’re excited to launch Budget Bytes, a new series for builders who want to create real, AI-powered apps using Azure SQL Database, without expensive infrastructure or guesswork. 🌟 Get started for FREE: https://aka.ms/budgetbytes/freeoffer 🌟\n\nBudget Bytes is built for budget-conscious developers who care about shipping, not just experimenting. Each episode walks through practical patterns for grounding AI in your own data with Azure SQL Database, building full-stack apps with Copilot, exploring agentic RAG architectures, and keeping costs shockingly low\n\nYou’ll see step-by-step demos, real architectures, and honest cost math, so you know exactly what you can build today and how to use AI responsibly.\n\nHere’s what’s coming up: ✅ Ground AI in your own data using Azure Foundry + Azure SQL Database. ✅ Build and run a full web app with Copilot + Azure SQL DB, all for under $10. ✅ See an end-to-end Agentic RAG sample using Azure SQL, Azure Container Apps, and Static Web Apps. ✅ Learn how to build AI agents with Copilot Studio + Azure SQL ✅A fireside chat with leaders on Azure SQL Database affordability, AI, and the future of building modern applications.\n\nWhether you’re a student, a startup, a small business, or a seasoned developer, Budget Bytes is your guide to building smarter apps with Azure SQL Database, adding AI with confidence, and staying within budget.\n\n🚀Get started for FREE: https://aka.ms/budgetbytes/freeoffer 🔔 Subscribe now so you don't miss an episode!",
  "FeedUrl": "https://www.youtube.com/feeds/videos.xml?channel_id=UCsMica-v34Irf9KVTh6xx-g"
}
