{
  "Description": "There are scenarios where you need to perform CI/CD for your SQL database in Fabric in isolation of other Fabric items. In this episode, we cover two ways that you can perform CI/CD for SQL database in Fabric using Azure DevOps.\n\n✅ Chapters: 0:00 Introduction 1:55 CI/CD for SQL databases in Fabric 3:08 Demo 4:00 Demo 7:50 Demo 8:55 Demo\n\n✅ Resources: What are database projects?: https://learn.microsoft.com/en-us/sql/tools/sql-database-projects/sql-database-projects?view=sql-server-ver17 SqlPackage: https://learn.microsoft.com/en-us/sql/tools/sqlpackage/sqlpackage?view=sql-server-ver17\n\nAbout MVPs: Microsoft Most Valuable Professionals, or MVPs, are technology experts who passionately share their knowledge with the community. They are always on the \"bleeding edge\" and have an unstoppable urge to get their hands on new, exciting technologies. They have very deep knowledge of Microsoft products and services, while also being able to bring together diverse platforms, products and solutions, to solve real world problems. MVPs make up a global community of over 4,000 technical experts and community leaders across 90 countries/regions and are driven by their passion, community spirit, and quest for knowledge. Above all and in addition to their amazing technical abilities, MVPs are always willing to help others - that's what sets them apart. Learn more: https://aka.ms/mvpprogram\n\n📌 Let's connect: Twitter: Anna Hoffman, https://twitter.com/AnalyticAnna Twitter: AzureSQL, https://aka.ms/azuresqltw\n\n🔴 To watch other MVP Edition episodes, see our playlist: https://aka.ms/dataexposedmvps To check out even more Data Exposed episodes, see our playlist: https://aka.ms/dataexposedyt\n\n🔔 Subscribe to our channels for even more SQL tips: Microsoft Azure SQL: https://aka.ms/msazuresqlyt Microsoft SQL Server: https://aka.ms/mssqlserveryt Microsoft Developer: https://aka.ms/microsoftdeveloperyt\n\n#AzureSQL #SQLServer",
  "Tags": [
    "Azure",
    "Cloud Computing",
    "Dev",
    "Development",
    "Microsoft",
    "Tech",
    "Technology"
  ],
  "PubDate": "2025-12-15T17:00:39+00:00",
  "OutputDir": "_videos",
  "FeedLevelAuthor": "Microsoft Developer",
  "FeedUrl": "https://www.youtube.com/feeds/videos.xml?channel_id=UCsMica-v34Irf9KVTh6xx-g",
  "EnhancedContent": null,
  "FeedName": "Microsoft Developer YouTube",
  "ProcessedDate": "2025-12-15 18:05:42",
  "Link": "https://www.youtube.com/watch?v=LJzNNR8nFlI",
  "Author": "Microsoft Developer",
  "Title": "Two ways to perform CI/CD for SQL database in Fabric using Azure DevOps  Data Exposed: MVP Edition"
}
