{
  "Tags": [
    "Azure",
    "Cloud Computing",
    "Dev",
    "Development",
    "Microsoft",
    "Tech",
    "Technology"
  ],
  "ProcessedDate": "2026-01-26 21:04:02",
  "OutputDir": "_videos",
  "EnhancedContent": null,
  "FeedUrl": "https://www.youtube.com/feeds/videos.xml?channel_id=UCsMica-v34Irf9KVTh6xx-g",
  "Link": "https://www.youtube.com/watch?v=QziYJ6Vz1xI",
  "FeedName": "Microsoft Developer YouTube",
  "PubDate": "2026-01-26T20:38:14+00:00",
  "FeedLevelAuthor": "Microsoft Developer",
  "Title": "REST APIs, Vectors, and AI in SQL Server 2025 | Data Exposed: MVP Edition",
  "Description": "In this episode, Ben Weissman, a Microsoft MVP and Data Platform expert, dives in REST APIs, vectors, and AI in SQL Server 2025.\n\n✅ Chapters: 0:00 Introduction 2:19 Demo\n\n✅ Resources: About Ben Weissman: Ben Weissman has been working with SQL Server since SQL Server 6.5, mainly in the BI/Datawarehousing field. He is a Data Platform MVP, MCSE Data Management and Analytics and a Certified Data Vault Data Modeler. He is also the first BimlHero Certified Expert in Germany and a co-author of \"SQL Server Big Data Clusters\" and \"The Biml Book\". Ben has been involved in more than 150 BI Projects and is always looking for ways to become more productive and make SQL Server even more fun!\n\nAbout MVPs: Microsoft Most Valuable Professionals, or MVPs, are technology experts who passionately share their knowledge with the community. They are always on the \"bleeding edge\" and have an unstoppable urge to get their hands on new, exciting technologies. They have very deep knowledge of Microsoft products and services, while also being able to bring together diverse platforms, products and solutions, to solve real world problems. MVPs make up a global community of over 4,000 technical experts and community leaders across 90 countries/regions and are driven by their passion, community spirit, and quest for knowledge. Above all and in addition to their amazing technical abilities, MVPs are always willing to help others - that's what sets them apart. Learn more: https://aka.ms/mvpprogram\n\n📌 Let's connect: Twitter: Anna Hoffman, https://twitter.com/AnalyticAnna Twitter: AzureSQL, https://aka.ms/azuresqltw\n\n🔴 To watch other MVP Edition episodes, see our playlist: https://aka.ms/dataexposedmvps To check out even more Data Exposed episodes, see our playlist: https://aka.ms/dataexposedyt\n\n🔔 Subscribe to our channels for even more SQL tips: Microsoft Azure SQL: https://aka.ms/msazuresqlyt Microsoft SQL Server: https://aka.ms/mssqlserveryt Microsoft Developer: https://aka.ms/microsoftdeveloperyt\n\n#AzureSQL #SQLServer",
  "Author": "Microsoft Developer"
}
