{
  "FeedUrl": "https://devclass.com/feed/",
  "FeedName": "DevClass",
  "PubDate": "2026-01-29T17:01:00+00:00",
  "Title": "Kubernetes leadership warns of Ingress NGINX risks, but has also hastened its deprecation",
  "Tags": [
    "Development",
    "Gateway API",
    "Ingres NGINX",
    "Kubecon",
    "Kubernetes",
    "open source",
    "Security"
  ],
  "ProcessedDate": "2026-01-29 17:11:41",
  "Description": "The Kubernetes Steering and Security Response Committees has warned about the risks of continuing to run Ingress NGINX, […]",
  "FeedLevelAuthor": "DEVCLASS",
  "OutputDir": "_blogs",
  "EnhancedContent": "[Linkedin](https://www.linkedin.com/company/devclass/)\n\n[RSS](https://devclass.com/feed/)\n\n[Twitter](https://twitter.com/d3vclass?lang=en)\n\n[Youtube](https://www.youtube.com/channel/UCEk1p4Omxqi0E0ij6Bfy4HQ)\n\n- [Newsletter](https://devclass.com/newsletter/)\n- [Archive](https://devclass.com/archive/)\n- [The Register](https://www.theregister.com/)\n- [Blocks&Files](https://blocksandfiles.com/)\n- [The Next Platform](https://www.nextplatform.com/)\n\nSearch\n\n[!\\[DevClass\\](https://devclass.com/wp-content/uploads/2018/08/DevClass_logo_White_small-Horizontal.png)NewsPaperDeveloper News](https://devclass.com/)\n\n- [Newsletter](https://devclass.com/newsletter/)\n- [Archive](https://devclass.com/archive/)\n- [The Register](https://www.theregister.com/)\n- [Blocks&Files](https://blocksandfiles.com/)\n- [The Next Platform](https://www.nextplatform.com/)\n\n- [Newsletter](https://devclass.com/newsletter/)\n- [Archive](https://devclass.com/archive/)\n- [The Register](https://www.theregister.com/)\n- [Blocks&Files](https://blocksandfiles.com/)\n- [The Next Platform](https://www.nextplatform.com/)\n\n[!\\[DevClass\\](https://devclass.com/wp-content/uploads/2018/08/DevClass_logo_White_small-Horizontal.png)DevClassDeveloper News](https://devclass.com/)\n\n- [Home](https://devclass.com/)\n- [DevOps](https://devclass.com/devops/)\n- [Serverless](https://devclass.com/serverless/)\n- [Containers](https://devclass.com/containers/)\n- [CI/CD](https://devclass.com/ci-cd/)\n- [ML/AI](https://devclass.com/ml-ai/)\n\n[Home](https://devclass.com/) [Development](https://devclass.com/category/development/) Kubernetes leadership warns of Ingress NGINX risks, but has also hastened its deprecation\n\n- [Development](https://devclass.com/category/development/)\n- [Security](https://devclass.com/category/security/)\n\n![Kubernetes leadership warns of Ingress NGINX risks, but has also hastened its deprecation](https://devclass.com/wp-content/uploads/2022/07/shutterstock_road_block_no_access.webp \"Kubernetes leadership warns of Ingress NGINX risks, but has also hastened its deprecation\") This is the end of the road for\n\nThe Kubernetes Steering and Security Response Committees has warned about the risks of continuing to run Ingress NGINX, which will receive no security patches from March 2026. “We cannot overstate the severity of this situation or the importance of beginning migration to alternatives,” said an official statement on the matter, though despite the severity, recent offers of help have been rejected as coming too late, and the leadership has pushed for a more rapid deprecation than maintainers wanted.\n\nAccording to the statement, “roughly 50 percent of cloud native environments currently rely on this tool,” accounting for the strength of the warning, and users may not notice since existing deployments will continue to work and “you may not know you are affected until you are compromised.”\n\nThe statement also acknowledged that none of the available alternatives are drop-in replacements and that planning and engineering time is required.\n\nIssues with lack of maintainers and contributors for the open-source Ingress NGINX have been known for some time, but [came to a head](https://www.theregister.com/2025/11/14/nginx_retirement/) at the KubeCon event in Atlanta, USA in November 2025. At a session titled “To InGate and beyond Ingress-nginx” maintainers James Strong and Marco Ebert announced the cessation of development effort on both Ingress NGINX and InGate, which was originally intended to be its successor. The first slide at the presentation stated, “Not the title you expected.”\n\nThe core problem, the maintainers said, was unreasonable pressure on them as volunteers and the lack of others stepping up to help. The InGate project never really got started, they said, with just one developer. “People weren’t as excited about InGate and Gateway API as we thought they would be,” they reported.\n\nConsidering the severity of the warning, it was surprising to discover from a [discussion on the matter](https://www.youtube.com/watch?v=1LwHeScfW-8) that Kubernetes leadership pushed for development to cease earlier rather than later. “When we talked about the deprecation date, there were some folks who wanted us to do it that week in Atlanta,” said Strong. “We pushed for about a year or so, we were able to reconcile and get the four months.” The last release is now planned to coincide with KubeCon Europe in Amsterdam, 23-26 March.\n\nAs so often with Kubernetes, it is a complex situation. Kubernetes is an API, for which there are many implementations. The [Ingress API](https://kubernetes.io/docs/concepts/services-networking/ingress/) routes network traffic to different backend services based on user configuration. This API is frozen and the project recommends using its successor, the Gateway API, instead, though the Ingress API is stable and will remain. “Gateway API is a much more complete API in the sense of features,” said RedHat’s Ricardo Katz, who is one of its maintainers (and a former Ingress NGINX maintainer). That said, many of the features of Ingress NGINX come in the form of annotations which add things that are not in the Ingress API specification.\n\n“If you are speaking just about the Ingress NGINX without any annotations, Gateway API can do everything,” said Katz, but because of the annotations, “there are a lot of things that Ingress NGINX can do that Gateway API cannot do yet, and some Gateway API will never do.”\n\nThe annotation issue means that even migration to another Ingress API implementation is not straightforward. For example, even [F5 NGINX Ingress](https://blog.nginx.org/blog/the-ingress-nginx-alternative-open-source-nginx-ingress-controller-for-the-long-term), an alternative which also uses the NGINX engine, has different annotations and a migration guide.\n\nIngress NGINX was one of the earliest implementations of an ingress controller for Kubernetes and was referenced in documentation, such that it seemed the safe and default choice for a deployment, and built on the popularity of the NGINX web server. With hindsight though, the project “exposed too much of the NGINX config … the big downfall for us was allowing people to inject Lua scripts … any time you allow an end user to run arbitrary code, you’re going to have security issues, and we did,” said Strong.\n\nPressure on the small maintainer team increased with the discovery of Ingres Nightmare, a remote code execution vulnerability caused by the ability to inject “an arbitrary NGINX configuration remotely,” as [reported](https://www.wiz.io/blog/ingress-nginx-kubernetes-vulnerabilities) by Wiz security in March 2025.\n\n“Not having more maintainers ended up burning me out and burning James out, and that’s something we need to speak out on open source,” said Katz.\n\nFollowing KubeCon Atlanta, there have been offers of help, but a [post](https://github.com/kubernetes/ingress-nginx/issues/14178#issuecomment-3779849797) from Kubernetes steering committee member Benjamin Elder said that “even if the maintainers of this project agreed to hand it over to someone new, the Kubernetes project has decided jointly between the sponsoring SIG [special interest group], Ingress-Nginx Maintainers, the Security Response Committee, and the Steering Committee, that we must wind down this project.”\n\nBuilding trust to maintain critical software takes time, Elder said, and the offers needed to happen years ago, not at the last minute. “Nobody wanted this outcome and we are all just trying to mitigate the situation, generally in our spare time.”\n\nAsked what users facing migration challenges should do, Strong said, “contribute, get involved. If you have a need for a feature, go to the Gateway API meetings and speak up.”\n\nOptions for other controllers include Envoy Gateway (which integrates with Envoy Proxy), Traefik and Cilium. There are also forks of Ingres NGINX to which users can switch at their own risk, and SuSe is [offering](https://www.suse.com/c/trade-the-ingress-nginx-retirement-for-up-to-2-years-of-rke2-support-stability/) two years of support for paying customers.\n\n[## TypeScript inventor Anders Hejlsberg: AI is 'a big regurgitator of stuff someone has done'](https://devclass.com/2026/01/28/typescript-inventor-anders-hejlsberg-ai-is-a-big-regurgitator-of-stuff-someone-has-done/)[## WebAssembly gaining adoption \"behind the scenes\" as technology advances](https://devclass.com/2026/01/28/webassembly-gaining-adoption-behind-the-scenes-as-technology-advances/)[## Microsoft previews command-line tool created because calling modern Windows APIs is too difficult](https://devclass.com/2026/01/26/microsoft-previews-command-line-tool-created-because-calling-modern-windows-apis-is-too-difficult/)[## VS Code tasks config file abused to run malicious code](https://devclass.com/2026/01/22/vs-code-tasks-config-file-abused-to-run-malicious-code/)[## LLVM project adopts \"human in the loop\" policy following AI-driven nuisance contributions](https://devclass.com/2026/01/21/llvm-project-adopts-human-in-the-loop-policy-following-ai-driven-nuisance-contributions/)[## Microsoft updates React Native for Windows. Developers ask, 'Why not use MAUI?'](https://devclass.com/2026/01/20/microsoft-updates-react-native-for-windows-developers-ask-why-not-use-maui/)[## jQuery 4.0 released, first major version since 2016](https://devclass.com/2026/01/19/jquery-4-0-released-first-major-version-since-2016/)[## Vibe coded applications full of security blunders](https://devclass.com/2026/01/15/vibe-coded-applications-full-of-security-blunders/)[## Code signing Windows apps may be easier and more secure with new Azure Artifact service](https://devclass.com/2026/01/14/code-signing-windows-apps-may-be-easier-and-more-secure-with-new-azure-artifact-service/)[## Open source MySQL repository has no commits in more than three months](https://devclass.com/2026/01/13/open-source-mysql-repository-has-no-commits-in-more-than-three-months/)[## Fly.io introduces Sprites: lightweight, persistent VMs to isolate agentic AI](https://devclass.com/2026/01/13/fly-io-introduces-sprites-lightweight-persistent-vms-to-isolate-agentic-ai/)[## Tailwind Labs lays off 75 percent of its engineers thanks to 'brutal impact' of AI](https://devclass.com/2026/01/08/tailwind-labs-lays-off-75-percent-of-its-engineers-thanks-to-brutal-impact-of-ai/)\n\n[!\\[DevClass\\](https://devclass.com/wp-content/uploads/2018/08/DevClass_logo_White_small-Horizontal.png)DevClassDeveloper News](https://devclass.com/)\n\n### ABOUT US\n\nDevClass is the news and analysis site covering modern software development issues, from the team behind the Continuous Lifecycle, Serverless Computing and MCubed conferences\n\nContact us: [devclass@sitpub.com](mailto:devclass@sitpub.com)\n\n### FOLLOW US\n\n[Linkedin](https://www.linkedin.com/company/devclass/)\n\n[RSS](https://devclass.com/feed/)\n\n[Twitter](https://twitter.com/d3vclass?lang=en)\n\n[Youtube](https://www.youtube.com/channel/UCEk1p4Omxqi0E0ij6Bfy4HQ)\n\n© Situation Publishing, 2018-2024\n\n- [About](https://devclass.com/about/)\n- [Contribute](https://devclass.com/contribute/)\n- [Contact](https://devclass.com/contact-us/)\n- [Sales](https://situationpublishing.com/home/contact-us/)\n- [Privacy](https://devclass.com/privacy/)\n- [Cookies](https://devclass.com/cookies/)\n- [Terms & Conditions](https://devclass.com/tc/)\n- [Do not sell my personal information](https://devclass.com/devclass-privacy-policy-for-california-residents/)",
  "Author": "Tim Anderson",
  "Link": "https://devclass.com/2026/01/29/kubernetes-leadership-warns-of-ingress-nginx-risks-but-has-also-hastened-its-deprecation/"
}
