{
  "FeedName": "Steve Gordon's Blog",
  "OutputDir": "_blogs",
  "EnhancedContent": "Skip to main content\n\n## Abstract\n\nApplication performance always matters. Sometimes critically, sometimes subtly, but it’s never irrelevant. While many developers rightly caution that “premature optimisation is the root of all evil,” the opposite mistake, ignoring performance until it becomes a serious issue, can be just as problematic.\n\nThis talk explores the practical aspects of performance optimisation in .NET. We’ll look at proven strategies for monitoring, identifying, analysing, and iteratively improving applications. You’ll learn how to approach the performance lifecycle, from monitoring applications in production and pinpointing the best areas to optimise, to investing valuable engineering time where it counts most.\n\nThrough a worked example, we’ll follow a feature through the optimisation cycle. We’ll profile the application, design benchmarks, theorise improvements, and iteratively refine the implementation to reduce allocations and execution time, while balancing performance gains with code readability and maintainability.\n\nAlong the way, you’ll learn how to use tools like dotTrace, dotMemory, and BenchmarkDotNet to target areas for improvement and validate gains. We’ll discuss common optimisation opportunities, from smarter memory usage and fewer allocations to more efficient execution flow.\n\nBy the end of this session, you’ll leave with practical techniques to write faster, more efficient .NET code, along with the judgment to know when optimisation is worth the trade-off, and when it’s not.\n\n## Resources\n\n- [Slides](https://speakerdeck.com/stevejgordon/application-performance-optimisation-in-practice-60-mins)\n- [Demo code](https://github.com/stevejgordon/practical-performance-demo)\n\nHave you enjoyed this post and found it useful? If so, please consider supporting me:\n\n[!\\[Buy me a coffee\\](https://cdn.buymeacoffee.com/buttons/bmc-new-btn-logo.svg)Buy me a coffee](https://www.buymeacoffee.com/stevejgordon) [!\\[Donate with PayPal\\](https://www.stevejgordon.co.uk/wp-content/uploads/2020/07/PaypalLogo.png)](https://www.paypal.com/cgi-bin/webscr?cmd=_s-xclick&hosted_button_id=WV4JPPV9FS34L&source=url)\n\n![](https://secure.gravatar.com/avatar/863d6186d3bc32b7c9036101c47d5d5b?s=60&#038;d=blank&#038;r=g)\n\n#### [Steve Gordon](https://www.stevejgordon.co.uk/author/stevejgordon)\n\nSteve Gordon is a Pluralsight author, 7x Microsoft MVP, and a .NET engineer at [Elastic](https://www.elastic.co) where he maintains the .NET APM agent and related libraries. Steve is passionate about community and all things .NET related, having worked with ASP.NET for over 21 years.\n\nSteve enjoys sharing his knowledge through his blog, in videos and by presenting talks at user groups and conferences. Steve is excited to participate in the active .NET community and founded .NET South East, a .NET Meetup group based in Brighton. He enjoys contributing to and maintaining OSS projects. You can find Steve on most social media platforms as [@stevejgordon](https://twitter.com/stevejgordon)",
  "Author": "Steve Gordon",
  "Link": "https://www.stevejgordon.co.uk/talk-application-performance-optimisation-in-practice-60-mins",
  "FeedLevelAuthor": "Steve Gordon – Code with Steve",
  "ProcessedDate": "2026-01-27 17:06:49",
  "FeedUrl": "https://www.stevejgordon.co.uk/feed",
  "Tags": [
    "ASP.NET Core"
  ],
  "Title": "Talk: Application Performance Optimisation in Practice (60 mins)",
  "PubDate": "2026-01-27T16:31:56+00:00",
  "Description": "Abstract Application performance always matters. Sometimes critically, sometimes subtly, but it’s never irrelevant. While many developers rightly caution that “premature optimisation is the root of all evil,” the opposite mistake, ignoring performance until it becomes a serious issue, can be just as problematic. This talk explores the practical aspects of performance optimisation in .NET. We’ll […]\n\nThe post [Talk: Application Performance Optimisation in Practice (60 mins)](https://www.stevejgordon.co.uk/talk-application-performance-optimisation-in-practice-60-mins) appeared first on [Steve Gordon - Code with Steve](https://www.stevejgordon.co.uk).\n\n[Talk: Application Performance Optimisation in Practice (60 mins)](https://www.stevejgordon.co.uk/talk-application-performance-optimisation-in-practice-60-mins) was first posted on January 27, 2026 at 4:31 pm. ©2017 \"[Steve Gordon's Blog](https://www.stevejgordon.co.uk)\". Use of this feed is for personal non-commercial use only. If you are not reading this article in your feed reader, then the site is guilty of copyright infringement. Please contact me at sgordon@hotmail.co.uk"
}
