{
  "Description": "Join us for the premiere episode of MVP Unplugged, where we explore how AI is transforming developer workflows! Host Justin Garrett, Microsoft Principal Customer Experience Program Manager, connects with Microsoft MVP Jeremy Sinclair to dive into Jeremy’s passion project: Social Media Commander—a cross-platform .NET app built with GitHub Spark and Avalonia using GitHub Copilot.\n\nIn this episode, you’ll learn:\n\nHow GitHub Copilot accelerates development with agent-instructions Inserting Microsoft Learn docs as context for app dev Implementing new features with Agent model using the latest models like Claude Sonnet 4.5 Best practices for guiding AI agents and avoiding common pitfalls Insights on the future of AI-assisted coding for developers Jeremy also demonstrates adding a new feature (Blue Sky v2) live, shares tips for integrating the Microsoft Learn MCP server, and shows how Copilot can handle CI/CD automation.\n\n👉 Subscribe for more MVP insights and AI-powered development tips!\n\nAbout Jeremy\n\nJeremy Sinclair is a Microsoft MVP specializing in Windows Development and .NET. He is keen on diving into new technologies and avidly sharing his knowledge with the community. He is a huge fan of all things related to Windows on Arm, and you can always catch him with Arm-based Surface devices. Follow him on LinkedIn\n\nAbout Justin\n\nJustin Garrett is host of MVP Unplugged, Principal PM in Developer Relations which is part of Microsoft Cloud + AI. Justin’s career at Microsoft also spans 20 years across Windows, Bing, Edge, Web Platform, Students/ University Relations, Cloud Advocacy, and most recently a leader of the MVP Program at Microsoft. In his spare time, he enjoys volunteering in STEM, is a soccer team manager, loves planting trees and is an avid Pacific Northwest mountaineer. Follow him on LinkedIn.\n\nAbout MVP Unplugged\n\nAI is reshaping how we work and live. And for developers and technologists alike, the pace of innovation – new tools, new models, patterns & practices, and even culture itself – is changing even faster. Yet it can be difficult to know what to learn, what to prioritize, what truly lives up to the promise of unlocking creativity and boosting productivity. Join Justin Garrett, Principal PM in DevRel and leader in the Microsoft MVP Program as he speaks with MVPs to share what they’re learning using a real-world project in this unplugged, conversational series. In each episode, they’ll experiment, code, and share honest insights that can make a real difference for the audience. Justin and his guests share stories of navigating technological change and look ahead for what’s next in tech. Come discover with us how to thrive in this era of AI!\n\nHashtags: #MVPUnplugged #GitHubCopilot #MicrosoftMVP #AIForDevs #VisualStudio #Azure #DotNet #DeveloperCommunity #AgentInstructions #microsoftlearning\n\n🔗 Resources & Links:\n\nJeremy’s GitHub Repo: https://github.com/snickler/social-media-command Learn more about GitHub Copilot: https://github.com/features/copilot Explore Microsoft Learn MCP: https://learn.microsoft.com/training/support/mcp GitHub Spark: https://github.com/features/spark Avalonia: https://avaloniaui.net/ MVP Unplugged Playlist: https://youtube.com/playlist?list=PLlrxD0HtieHhclud3yVB88znZPKCZYX\\_8&si=4HoycKJyUcl1qwV-\n\n✅ Chapter Markers\n\n00:00 - Welcome to MVP Unplugged & AI Focus 00:31 - Meet Jeremy Sinclair: Microsoft MVP 01:19 - Episode Objectives & Key Topics 02:08 - Inside Social Media Commander Project 03:02 - Why Build a Custom App? 04:07 - Demo: Using GitHub Copilot in Agent Mode 06:07 - Tech Stack Deep Dive: .NET & Avalonia UI 07:11 - Adding Blue Sky v2 with Copilot 08:58 - Copilot Instructions & Context Loading 13:05 - Iterating & Troubleshooting with Copilot 16:07 - Why Developer Knowledge Still Matters 17:18 - Using Microsoft Learn Docs as Context 20:14 - GitHub MCP Server & Repo Walkthrough 22:11 - CI/CD Automation with Copilot 23:37 - Copilot in GitHub Web Experience 27:16 - Handling Errors & Steering AI Output 30:12 - Live Demo: Posting to Blue Sky 31:21 - Future Enhancements: AI Alt Text 33:03 - Implementing Blue Sky v2 Correctly 36:13 - Prompting Tips & Insights 37:34 - Key Learnings & Takeaways 39:11 - What Jeremy Loves About Copilot 41:19 - Closing Thoughts & GitHub Repo Link",
  "Author": "Microsoft Developer",
  "Link": "https://www.youtube.com/watch?v=2EJR1xhTtBs",
  "FeedLevelAuthor": "Microsoft Developer",
  "PubDate": "2025-12-16T17:00:10+00:00",
  "ProcessedDate": "2025-12-16 17:08:28",
  "EnhancedContent": null,
  "Tags": [
    "Azure",
    "Cloud Computing",
    "Dev",
    "Development",
    "Microsoft",
    "Tech",
    "Technology"
  ],
  "FeedName": "Microsoft Developer YouTube",
  "OutputDir": "_videos",
  "Title": "Build a Social Media Commander app with Agent Instructions using GitHub Copilot | MVP Unplugged",
  "FeedUrl": "https://www.youtube.com/feeds/videos.xml?channel_id=UCsMica-v34Irf9KVTh6xx-g"
}
