{
  "Link": "https://andrewlock.net/trying-out-the-zed-editor-on-windows-for-dotnet-and-markdown/",
  "Tags": [
    "IDEs",
    "VS Code"
  ],
  "Author": "Andrew Lock",
  "FeedUrl": "https://andrewlock.net/rss.xml",
  "FeedLevelAuthor": "Andrew Lock | .NET Escapades",
  "ProcessedDate": "2025-12-09 11:05:01",
  "Description": "In this post I try out Zed on Windows to see if it can replace my VS Code usages for quick edits of .NET projects and writing Markdown documents",
  "FeedName": "Andrew Lock's Blog",
  "Title": "Trying out the Zed editor on Windows for .NET and Markdown",
  "EnhancedContent": "In this post I provide my initial thoughts about the [Zed](https://zed.dev/) editor. I provide my first impressions, some of the customizations I made to get comfortable with it, and my conclusions on using it for working with .NET and Markdown documents.\n\n## What's wrong with VS Code?\n\nBefore I get to my actual impressions, I think it's probably worth discussing *why* I started looking at the [Zed editor](https://zed.dev/) in the first place. After all, I currently have JetBrains Rider, Visual Studio, *and* Visual Studio Code installed on my laptop, do I *really* need another one?😅\n\nOf course, while you *can* use all these IDEs/editors for much of the same tasks, they have different sweet spots. For example, JetBrains Rider is my go-to IDE day to day. It's what I use for virtually all my \"real\" development these days. Visual Studio fills essentially the same role for me, and consequently I don't use it much, there's just occasional things where I find the deeper integration with Azure (among other things) come in handy.\n\nAnd then we have VS Code. VS Code always *used* to be a quick, lightweight editor. It had good-enough general syntax highlighting for all sorts of arbitrary languages, the .NET integration was \"good enough\" when all I want to do is hack together a quick console app for a blog post, and it's actually a pretty good markdown editor. But VS Code has been starting to bug me more and more recently. It's nothing that I can really put my finger on, it's the little things…\n\nFirst of all, and the main gripe to be honest, is that VS Code just doesn't feel as snappy as it used to. It's not terrible, but I go out of my way to try to *not* have too many extensions installed now, because it just exacerbates things. I want to be able to edit a file in explorer and have it pop up straight away, not to have to wait 5 seconds for the window to appear.\n\nThe other thing that bugs me recently is, ironically, the \"improved .NET support\", by way of [the C# Dev Kit](https://learn.microsoft.com/en-us/visualstudio/subscriptions/vs-c-sharp-dev-kit). And the experience that irritates me is the same irritating feature Visual Studio insists on: creating *sln* files all over the place. There's a perfectly good *csproj* in the folder, that's good enough! Stop creating pointless *sln* files!\n\n![Oh look, VS Code decided it would create a sln file for no good reason](/content/images/2025/zed_00.png)\n\nObviously I understand *why* it does this, but I literally never want this behaviour. I also don't care about the \"solution explorer\" window—if I need that view I'll use a real IDE like Rider. Why can't you just be happy as an editor, VS Code?!\n\nI have some other more minor gripes, but as none of that's particularly productive, let's move on. One thing that I *do* enjoy about VS code is the markdown editing experience. I use the [Markdown All in One](https://marketplace.visualstudio.com/items?itemName=yzhang.markdown-all-in-one) extension, [Spell Right](https://marketplace.visualstudio.com/items?itemName=ban.spellright), and [Word Count](https://marketplace.visualstudio.com/items?itemName=ms-vscode.wordcount), and it does everything I need.\n\nSo in conclusion I was feeling a bit down on VS Code as an editor. It was still better than anything I had used before, but it wasn't quite the darling that I had once considered it to be. And that's when a colleague at work mentioned they'd been using (and enjoying) Zed.\n\n## Maybe Zed can replace VS Code?\n\nZed is an editor I'd [heard about](https://changelog.com/podcast/531) a [few times](https://changelog.com/podcast/640) on the [changelog podcast](https://changelog.com/podcast/640). It was interesting, as it was created by Nathan Sobo, a developer that previously worked on [Atom](https://atom-editor.cc/) at GitHub, but it went in a completely different direction. While Atom used Chromium and Node (and spawned the Electron framework so many apps use today), Zed was very different. It was built in Rust, and designed to be very fast.\n\nZed was interesting from an academic point of view, but not hugely practical for me, for several reasons:\n\n1. It didn't support Windows, (until recently)!\n2. A big sell is about being \"collaborative\", something I wasn't interested in for an editor.\n3. They've largely pivoted Zed to be an AI play, again something I'm not interested in for an editor.\n\nBut then, in October 2025, Zed released a Windows build. After a colleague at work told me how much they were enjoying it, I decided to give it a go, and see if it could replace VS Code for my day to day usages.\n\nAs a reminder, what I really wanted was and editor that:\n\n- Is *fast*.\n- Works well with Markdown\n- Works with small .NET projects (when opening an IDE is too slow!)\n\nSo I installed Zed onto my personal machine, and gave it a try!\n\n## Installing Zed for Windows\n\nTo install Zed, head to [https://zed.dev/windows](https://zed.dev/windows), and hit the download button (Or just press W!)\n\n![The Zed for Windows home page](/content/images/2025/zed_01.webp)\n\nThis downloads the installer, which is your pretty standard affair, and it includes the usual options for adding Zed to the explorer context window for example (ideal for what I would be using it for).\n\n![The Zed installer Additional Tasks wizard, allowing you to register Zed in the Windows Explorer Shell](/content/images/2025/zed_02.png)\n\nOn running Zed for the first time, you're presented with some base customization options:\n\n![The customization options on the welcome screen of Zed](/content/images/2025/zed_03.png)\n\nThe ability to base your keymap on other well known editors *and* to import settings from other editors is a very neat onboarding trick. I chose to import my settings from VS Code:\n\n![The screen after importing settings from VS Code](/content/images/2025/zed_05.png)\n\nOnce you're done with the setup, you're dropped into the default welcome screen, which overall looks pretty similar to the VS Code experience. You have your getting started actions, an explanation of the shortcuts available, and a bunch of toolbars around the place:\n\n![The Zed start screen after first install](/content/images/2025/zed_06.png)\n\nI tried generally just opening a few files at this point and looking around, typing a little bit, and I have to say, the first impression is very impressive. It's just *so* smooth and snappy. Seriously, it feels *so* fast compared to VS Code. It was a good start! 😄\n\n## Adding support for C# to Zed\n\nMuch like VS Code, Zed is built around various protocols, and delegates [large parts of its core functionality](https://zed.dev/docs/languages) to extensions. There are extensions for themes, extensions for icon packs, extensions for languages…the list goes on! You can open the extension window using the same shortcut as VS Code, Ctrl+Shift+X (at least, assuming you're using the VS Code shortcuts!)\n\n![The Zed extension window showing the extensions you can install](/content/images/2025/zed_09.png)\n\nTo add support for C#, open the extensions window, search for C#, and [install the C# extension](https://github.com/zed-extensions/csharp) by `fminkowski` . This uses the [omnisharp](https://github.com/omnisharp) Language Server to provide language support. This is essentially the same backing implementation as the *original* VS Code C# extension, before Microsoft moved to the C# Dev Kit extension.\n\nOnce the extension is installed you get syntax highlighting for your C# code, as well as refactoring options, just as you would expect in VS Code, though these will likely be more limited than the options available as part of the VS Code C# Dev kit.\n\n![C# file in Zed showing a refactoring popup](/content/images/2025/zed_10.png)\n\nThat's the most important part of getting .NET editing working in Zed, but I also tweaked the themes to be more familiar. I installed [the JetBrains Rider theme](https://github.com/NarmadaWeb/jetbrains-rider-zed), and also [the JetBrains New UI Icon Theme](https://github.com/ankddev/zed-jetbrains-newui-icons), though the latter didn't seem to have special icons for C# files, so that's a bit of a shame. Anyway, that's it for editing .NET for now; let's look at markdown instead.\n\n## Adding support for Markdown\n\nThe good news is that Zed has [built-in support for Markdown](https://zed.dev/docs/languages/markdown), so there's nothing you *need* to install. That said, it's relatively pretty bare bones:\n\n![The markdown experience in Zed](/content/images/2025/zed_11.png)\n\nYou get syntax highlighting of the markdown text, and a preview pane, but there's not a huge number of other features (more on that later). For me, the one critical extension I added was a spell checker. I added [CodeBook](https://github.com/blopker/codebook), which is actually intended to be used as a spell checker inside *code* rather than markdown, but it does work with markdown at least:\n\n![A markdown document with a flagged spelling mistake including suggestions](/content/images/2025/zed_12.png).\n\nBut the question is, did I stick with it? Did I write this post in Zed?\n\n## My first impressions after trying Zed\n\nThe short answer is, no, I didn't stick with Zed, and instead went back to VS Code. There's a lot of reasons for that which I'll get into, but before I start nipicking, I think it's worth highlighting the good bits.\n\n### The good bits\n\nZed feels *really* smooth to use. It opens quickly, tabbing between documents is lighting fast, and even typing feels much faster than VS Code. Switching folders/workspaces is *crazy* fast😮 The performance is one of those things that you don't realise you're missing until you try it for yourself! 😀\n\nAlso, I was really impressed with the care that's clearly gone into building and designing Zed. In the relatively short time I used it, I ran into literally no bugs or issues, and the attempt to accommodate onboarding VS Code and other editor users was a really nice touch. Pretty much all of my reasons for not sticking with Zed were missing features rather than anything else.\n\nSo now let's talk about those missing features.\n\n### .NET is good, but missing Razor support\n\nFirst, editing .NET, for the most part, just worked. I mean, it's like working in VS Code, which is basically all I wanted or needed. I'm not looking to replace Rider with Zed, so I don't need a full IDE.\n\nThe one piece that was missing is that there doesn't seem to be any support for Razor or cshtml files, which I *think* is an Omnisharp limitation. And if that's the case, it'll probably *never* be there unfortunately🙁\n\n![.razor files don't have any syntax highlighting](/content/images/2025/zed_13.png)\n\nThis isn't really a knock against Zed or the Omnisharp project; Razor is a notoriously difficult format to handle as it's *multiple* languages in one: HTML, C#, Blazor `@` syntax, CSS, JavaScript etc. And it's not really a big deal for me; Zed is meant to be my editor and I'm generally not going to be messing with Razor pages in an editor.\n\nSo overall, Zed is \"good enough\" with .NET to be my go-to editor. Unfortunately, that's not the case for Markdown.\n\n### Markdown is missing too many features\n\nAfter checking out .NET I was pretty optimistic with Zed, as I assumed that would be the hard bit, but unfortunately I was ultimately let down by the Markdown support.\n\nMarkdown has first-party support in Zed, but it's missing a lot of features that I'm used to having when writing in VS Code. Many of these are features provided by [the extension I use](https://marketplace.visualstudio.com/items?itemName=yzhang.markdown-all-in-one), but they make for a very smooth writing experience:\n\n- Shortcuts like Ctrl+B to bold the current word. [This has been requested for Zed](https://github.com/zed-industries/zed/issues/13208), but doesn't currently exist.\n- \"Code folding\" for headings and other elements. These let you hide sections, just like you would when folding a method in code.\n- \"IntelliSense\" for internal links and for images (which are added via a shortcut of course!).\n- Images are rendered in the preview pane\n- As you scroll the source page (without moving the cursor), the preview window scrolls too.\n\nHowever, the biggest issue with markdown is the way Zed *constantly* pops up suggestions for the word you're currently writing. This is incredibly distracting, provides no value when writing markdown documents, and frankly made it unusable for me.\n\n![The suggestion popups when writing Markdown in Zed are infuriating](/content/images/2025/zed_08.png)\n\nThese all seem like small things, and they are, but they add up to a slick experience, and importantly an experience I'm *used* to. I've been writing this blog for long enough now that it's just not worth throwing away nearly a decade of muscle memory😅\n\nThat said, most of these are small features that absolutely *could* be added later or addressed, so I'm certainly going to keep an eye on it.\n\n### A lot of shortcuts don't port across\n\nOn the theme of muscle memory, one of the big struggles I had initially was realising *quite* how many shortcuts I use instinctively. This can be very confusing when you hit a shortcut expecting it to (for example) create a new cursor on the line below, and instead it switches to a completely different document😅\n\nNone of this is a big problem, as you can customize basically all of the keyboard shortcuts. I'm also not *entirely* sure if these were just not mapped in the \"import Keymaps from VS Code\" stage, or if these aren't part of the \"core\" VS Code or something. Anyway, I've added the following mappings so far to get something closer to what I have in VS Code:\n\n```json // Zed keymap [ { \"context\": \"Workspace\", \"bindings\": { // \"shift shift\": \"file_finder::Toggle\" } }, { \"context\": \"Editor && vim_mode == insert\", \"bindings\": { // \"j k\": \"vim::NormalBefore\" } }, { \"context\": \"Editor\", \"bindings\": { \"ctrl-shift-delete\": \"editor::DeleteLine\" } }, { \"bindings\": { \"ctrl-d\": \"editor::DuplicateSelection\" } }, { \"bindings\": { \"ctrl-k ctrl-f\": \"editor::FormatSelections\" } }, { \"context\": \"Editor\", \"bindings\": { \"ctrl-k ctrl-d\": \"editor::Format\" } }, { \"context\": \"Editor\", \"bindings\": { \"alt-enter\": \"editor::ToggleCodeActions\" } }, { \"context\": \"Editor\", \"bindings\": { \"shift-f12\": \"editor::FindAllReferences\" } }, { \"context\": \"Editor\", \"bindings\": { \"f3\": [ \"editor::SelectNext\", { \"replace_newest\": false } ] } }, { \"context\": \"Editor\", \"bindings\": { \"shift-f3\": [ \"editor::SelectPrevious\", { \"replace_newest\": false } ] } }, { \"context\": \"Editor\", \"bindings\": { \"ctrl-alt-down\": \"editor::AddSelectionBelow\" } }, { \"context\": \"Editor\", \"bindings\": { \"ctrl-alt-up\": \"editor::AddSelectionAbove\" } }, { \"context\": \"Workspace\", \"bindings\": { \"alt-s\": \"workspace::ToggleLeftDock\" } }, { \"context\": \"Pane\", \"bindings\": { \"alt-left\": \"pane::GoBack\" } }, { \"context\": \"Pane\", \"bindings\": { \"alt-right\": \"pane::GoForward\" } }, { \"context\": \"Editor\", \"bindings\": { \"ctrl-k ctrl-c\": [ \"editor::ToggleComments\", { \"advance_downwards\": false } ] } } ]\n\n```\n\nWhich brings us to the final point.\n\n### The AI elephant in the room\n\nAs I already mentioned, I don't want or need AI in my editor. And yet every company has to add AI to their product whether you want it or not. Such is the way of our times. VS Code and Visual Studio are the same. But the good thing about Zed is that you can simply disable it if you don't want it:\n\n![You can disable AI in Zed if you don't want AI features](/content/images/2025/zed_14.png)\n\nAlternatively you can edit all the settings as JSON. This is what I have currently:\n\n```json // Zed settings { \"ensure_final_newline_on_save\": false, \"remove_trailing_whitespace_on_save\": false, \"format_on_save\": \"off\", \"when_closing_with_no_tabs\": \"keep_window_open\", \"disable_ai\": true, \"telemetry\": { \"diagnostics\": true, \"metrics\": true }, \"project_panel\": { \"auto_fold_dirs\": false }, \"base_keymap\": \"VSCode\", \"minimap\": { \"show\": \"never\" }, \"file_types\": {}, \"show_whitespaces\": \"trailing\", \"icon_theme\": { \"mode\": \"dark\", \"light\": \"Zed (Default)\", \"dark\": \"JetBrains New UI Icons (Dark)\" }, \"ui_font_size\": 13.0, \"buffer_font_size\": 12.0, \"theme\": { \"mode\": \"dark\", \"light\": \"One Light\", \"dark\": \"JetBrains Rider Dark\" } }\n\n```\n\nAnd that's pretty much it. In conclusion, I won't be replacing VS Code with Zed today. But I can definitely see a time in the near future where enough of the missing markdown features I'm used to have been added that I'll make the switch. The Zed team are shipping updates regularly, and they have a really nice product, even if it's not quite there for me.\n\n## Summary\n\nIn this post I described my experience installing the Zed editor, and trying to replace my VS Code usages with Zed. In particular, I wanted to use Zed to edit .NET projects and to write markdown documents. The .NET experience was very similar to the VS Code experience with the Omnisharp plugin, which is mostly only lacking with regards to Razor/Blazor support. For Markdown I found the lack of features I'm used to in VS Code to be a deal breaker. Zed is an incredibly fast and smooth experience, but I won't be switching to it currently. If the features I'm missing are added however, I would seriously consider it.\n\n## Tags\n\nAndrew Lock | .Net Escapades\n\n![](/assets/img/icons/apple/apple-touch-icon-180x180.png) Want an email when there's new posts?\n\nStay up to the date with the latest posts!\n\nOops! Check your details and try again.\n\nThanks! Check your email for confirmation.",
  "PubDate": "2025-12-09T10:00:00+00:00",
  "OutputDir": "_blogs"
}
