{
  "EnhancedContent": "For the past four years, the conversation about AI and software development has moved faster than most people can track. Every week, there is a new tool, a new benchmark, a new paper, or a new claim about what AI will or won’t replace. There is certainly noise, but even if sometimes data seems inconclusive or contradictory, we still know more now than three years ago about AI adoption.\n\nWith four years of AI adoption under our belt, we are also able to start seeing the shift in what it means to be a software developer. I lead key research initiatives at GitHub where I focus especially on understanding developers’ behavior, sentiment, and motivations. The time we are in with AI is pivotal, and I interview developers regularly to capture their current perspective. Most recently I conducted interviews to understand how developers see their identity, work, and preferences change as they work more closely than ever with AI.\n\n**The TL;DR? The developers who have gone furthest with AI are working differently.** They describe their role less as “code producer” and more as “creative director of code,” where the core skill is not implementation, but orchestration and verification. Let’s dive in for the more detailed findings, alongside key stats from the 2025 Octoverse report.\n\n## 2023: Curiosity, hesitation, and identity questions\n\nTwo years ago, we interviewed developers to understand their openness to having AI more deeply integrated into their workflow. At the time, code completions had become mainstream and agents were only a whisper in the AI space. Back then, we found developers eager to get AI’s help with complex tasks, not just filling in boilerplate code. Developers were most interested in:\n\n1. **Summaries and explanations** to speed up how they make sense of code related to their task, and\n2. **AI-suggested plans of action** that reduce activation energy. In contrast, developers wanted AI to stay at arm’s length (at least) on **decision-making** and generating code that **implements whole tasks**.\n\nThe explanation of that qualitative trend from 2023 is important. At the time, AI was seen as still unreliable for large implementations. But there was more to the rationale. **Developers were reluctant to cede implementation because it was core to their identity.**\n\nThat was our baseline in 2023, [which we documented in a research-focused blog](https://github.blog/news-insights/research/a-developers-second-brain-reducing-complexity-through-partnership-with-ai/). Since then, developers’ relationship with AI has changed (and continues to evolve), making each view a snapshot. That makes it critical to update our understanding as the tools have evolved and developer behavior has consequently changed.\n\nOne of the interviewees in 2023 wrapped their hesitation in a question: “If I’m not writing the code, what am I doing?”\n\nThat question has been important to answer since then, especially as we hear future-looking statements about AI writing 90% of code. If we don’t describe what developers do if/when AI does the bulk of implementation, why would they ever be interested in embracing AI meaningfully for their work?\n\n## 2025: Fluency, delegation, and a new center of gravity\n\nFast forward to this year: we interviewed developers again, and this time, we focused on advanced users of AI. This was, in part, because we found a growing number of influential developer blogs focused on agentic workflows. They described sophisticated setups over time, and signalled optimism around coding with and delegating to AI (see [here](https://mikemcquaid.com/why-open-source-maintainers-thrive-in-the-llm-era/), [here](https://harper.blog/2025/04/17/an-llm-codegen-heros-journey/), and [here](https://ghiculescu.substack.com/p/nobody-codes-here-anymore) for just a few examples). It was important to capture that rationale, assess if/how it’s shared by more AI-experienced developers, and understand what fuels it.\n\nThe developers we spoke with described their agentic workflows and how they reached AI fluency: **relentless trial-and-error** and **pushing themselves to use AI tools every day for everything**.\n\nThat was their method for gaining confidence in their AI strategy, from identifying which tools would be helpful for which task to prompting and iterating effectively.\n\nThe tools did not feel magical or intuitive all the time, but their determination eventually led them to make more informed decisions: for example, when to work synchronously with an agent, when to have multiple agents working in parallel, or when to prompt an AI tool to “interview” them for more information (and how to check what it understands). **None of these AI strategists started out that way**. Most of them started as AI skeptics or timid explorers. As we synthesized the interviewees’ reported experiences, we identified that they matured in their knowledge and use of AI moving from **Skeptic**, to **Explorer**, to **Collaborator**, to **Strategist**.\n\n![Side-by-side cards illustrating Stage 1 &lsquo;AI Skeptic&rsquo; and Stage 2 &lsquo;AI Explorer.&rsquo; The left card shows a skeptical face emoji and describes low tolerance for iteration and errors. The right card shows a compass emoji and describes developers who use AI for quick wins and gradually build trust. Decorative GitHub-style cube artwork appears on the right with colorful radiating lines.](https://github.blog/wp-content/uploads/2025/12/ai-fluency-stages-1-2.png?resize=1024%2C576) ![Side-by-side cards illustrating Stage 3 &lsquo;AI Collaborator&rsquo; and Stage 4 &lsquo;AI Strategist.&rsquo; The left card shows a handshake emoji and describes developers who co-create with AI and iterate frequently. The right card shows a target emoji and outlines developers who plan, orchestrate, and verify work with high iteration tolerance and multi-agent workflows. Decorative GitHub-style green cube artwork appears on the right side.](https://github.blog/wp-content/uploads/2025/12/ai-fluency-stages-3-4.png?resize=1024%2C576)\n\nEach stage came with a better **understanding of capabilities and limitations**, and different **expectations around speed, iteration, and accuracy**. A developer that used AI to co-create solutions (a stage we call “AI Collaborator”) knew to expect back-and-forth iteration with an agent. But when they were using exclusively code completions or boilerplate snippets (probably an “AI Skeptic”), they expected low-latency, one-shot success—or they quickly reverted to doing things without AI.\n\nInterestingly, each stage in a developer’s comfort with AI had a matching evolution in the tools and workflows they felt ready to adopt: completions, then a chat and copy-paste workflow, then AI-enabled IDEs, and then multi-agent workflows. The advanced AI users we interviewed used several AI tools and agents in parallel, relying on a self-configured AI stack.\n\n**What looks from the outside like “new features” was, from the inside, a gradual widening of what developers were willing to delegate.** By the time they reached that latest stage, the nature of their work had changed in a noticeable way.\n\nAt the Strategist stage, their development sessions looked very different from the days when they worked with AI as autocomplete. They focused less on writing code in the traditional sense, and more on defining intent, guiding agents, resolving ambiguity, and validating correctness. **Delegation and verification became the primary activities** as they felt the center of gravity shift in their work.\n\n**This transition is the identity shift.** Developers who once wondered, “If I’m not the one writing the code, what am I doing?” now answer that question in practice: they set direction, constraints, architecture, and standards. They shift—using a phrase we first heard in interviews—**from code producers to creative directors of code.** And, crucially, the developers who reach this level do not describe it as a loss of craft but as a reinvention of it.\n\nThis shift is **imperceivable unless experienced**. The path to becoming AI-fluent is paved with trial and error, frustration, a gradual build up of trust, and ah-ha moments when steps start working as intended and become workflows. Most of the interviewees told us that their sentiment toward the future of software development changed only after they saw the shift in their own work. What once felt like an existential threat began to feel like a strategic advantage. Their outlook became more optimistic as they learned how to use AI tools with confidence and agency.\n\n## Ecosystem signals that reinforce the shift\n\nThese interviews are early signals about the impact of AI in developer workflows from the most advanced users. But we are already seeing their practices diffuse outward. Developers are beginning to make different choices *because* AI is present in the workflow and they assume it will increase. Choices about abstractions, code style, testing strategy, and even programming languages are shifting as developers adjust to a world where delegation is normal and verification is foundational.\n\nThe [2025 Octoverse report](https://github.blog/news-insights/octoverse/octoverse-a-new-developer-joins-github-every-second-as-ai-leads-typescript-to-1/) captured one striking example of this shift: **TypeScript became the #1 programming language by monthly contributors on GitHub in August 2025.** Many factors influence language popularity, but this particular rise says something important about the developer–AI relationship. TypeScript brings clarity and structure to a codebase, expresses intent more explicitly, and provides a type system that helps both developers and AI reason about correctness. In interviews, developers mentioned needing to give AI more guardrails and more context to reduce ambiguity and make verification easier. **When AI writes large proportions of code, languages that enforce structure and surface errors early become a strategic choice.** The shift toward TypeScript is a way of choosing languages that make delegation *safer*.\n\nWe also saw another telling signal in [Octoverse](https://github.blog/news-insights/octoverse/octoverse-a-new-developer-joins-github-every-second-as-ai-leads-typescript-to-1/): **80% of new developers on GitHub in 2025 used Copilot within their first week.** This signals that developers are getting their first contact with AI at the beginning of their journey. If early contact brings early confidence, we may see developers reach more advanced stages of AI maturity sooner than previous cohorts did.\n\nAnother compelling data point was shared at GitHub Universe this year: within the first five months of the release of Copilot coding agent, GitHub’s autonomous agent that can generate pull requests, issues, or tasks, developers used it to merge **more than 1 million pull requests**.\n\nEach one of those pull requests represents a small story of delegation and verification. A developer had to imagine the change, articulate intent, decompose the task, provide context, and set boundaries. They had to review, test, and validate the output before merging. Seen collectively, these pull requests are a measure of developers stepping into a new role. They show developers trying AI with increasingly meaningful units of work, and they show developers gradually building trust while taking responsibility for ensuring those units are correct.\n\nThat brings us to the natural next question: **what skills support this new identity and role?**\n\n## The skills that support developers’ new role\n\nAs delegation and verification become the focus, the skills developers will need to rely on shift upward. The work moves from implementation to three layers where developers focus, described below: *understanding the work, directing the work, and verifying the work*. Across interviews, developers consistently described strengths in all three layers as essential to working confidently with AI.\n\n## 1. Understanding the work\n\nThese skills help developers determine *what* needs to be built, *why*, and *how* to shape the problem before any code comes into play.\n\n### AI fluency\n\nDevelopers need an intuitive grasp of how different AI systems behave: what they are good at, where they fail, how much context they require, and how to adjust workflows as capabilities evolve. This fluency comes from repeated use, experimentation, and pattern recognition. With increased AI fluency developers are able to compose their AI stack: tools and features that they use for different projects and tasks, or in parallel configurations for end-to-end workflows.\n\n### Fundamentals\n\nEven as AI takes on more implementation, deep technical understanding remains essential for developers. Knowledge of algorithms, data structures, and system behavior enables developers to evaluate complex output, diagnose hidden issues, and determine whether an AI-generated solution is sound.\n\n### Product understanding\n\nDevelopers will need to increasingly think at the level of outcomes and systems, not snippets. This includes understanding user needs, defining requirements clearly, and reasoning about how a change affects the product as a whole. Framing work from an outcome perspective ensures what is delegated to AI aligns with the actual goals of the feature or system.\n\n## 2. Directing the work\n\nThese skills enable developers to guide AI systems, tools, and agents so that the work moves forward effectively and safely.\n\n### Delegation and agent orchestration\n\nEffective delegation requires clear problem framing, breaking work into meaningful units, providing the right context, articulating constraints, and setting success criteria. Advanced developers also decide when to collaborate interactively with an agent, versus running tasks independently in the background. Strong communication—precise, thorough, and structured—turns delegation into a repeatable practice.\n\n### Developer–AI collaboration\n\nSynchronous collaboration with agents depends on tight, iterative loops: setting stopping points, giving corrective feedback, asking agents to self critique, or prompting them to ask clarifying questions. Some developers described instructing agents to interview them first, as a way to build shared understanding before generating any code.\n\n### Architecture and systems design\n\nAs AI handles more low-level code generation, architecture becomes even more important. Developers design the scaffolding around the work: system boundaries, patterns, data flow, and component interactions. Clear architecture gives agents a safer, more structured environment and makes integration more reliable.\n\n## 3. Verifying the work\n\nThis skill category is becoming part of the defining center of the developer role: **ensuring correct and high-quality outputs**.\n\n### Verification and quality control\n\nAI-generated output requires rigorous scrutiny. Developers validate behavior through reviews, tests, security checks, and assumption checking. Many reported spending more time verifying work than generating it, and feeling this was the right distribution of effort. Strong verification practices are what make larger-scale delegation possible, and allow developers to gradually trust agents with meaningful units of work.\n\nVerification always was a step of the process, usually at the end. In AI-supported workflows, it becomes a continuous practice.\n\n| [Annie Vella](https://annievella.com/about/), a Distinguished Engineer at Westpac NZ, recently wrote an exceptional post about how the software engineer role changes with AI and the new competency map for engineers building systems with LLMs and agents. Annie’s experience (and [research](https://annievella.com/files/devops-summit-melbourne-march-2025-the-future-engineer.pdf)) share many similarities with the findings from our interviews with advanced AI users. A worthy read! | | --- |\n\n## This year’s snapshot\n\n**What started as curiosity has now become preparedness.** Developers see their profession changing in real time. They believe that AI will continue to evolve rapidly, and that the pace of change will not slow. Many are adapting to the change by building AI fluency, practicing confident orchestration of tools and agents, and treating delegation and verification as core parts of their craft. They see these skills as a competitive advantage, one that will define the next era of software development.\n\nThe value of a developer is shifting toward judgment, architecture, reasoning, and responsibility for outcomes, moving their work up the ladder of abstraction. As we build tools to support developers and look to measure AI’s impact, it’s important that our perspective matches the evolution of their work and identity.\n\n## How to track the evolving landscape\n\nThere is no single source of truth for how AI is changing software development, but there are reliable signals:\n\n- **Large-scale data reports** (such as GitHub’s Octoverse report) show macro-level adoption and behavior patterns.\n- **Longitudinal industry studies** (e.g., DORA) reveal where productivity gains stall or compound.\n- **Field research and developer interviews** help us interpret big data correctly and identify trends before we see them at scale.\n- **Open source activity** is a leading indicator of what workflows developers adopt first, before enterprises (you can [track open source activity on GitHub in the Innovation Graph](https://innovationgraph.github.com/), a public data resource we update quarterly).\n\n## Who did we interview?\n\nIn this round of interviews, we recruited 22 US-based participants working full time as software engineers. We used the [Respondent.io](http://respondent.io) platform for recruitment, and there was no requirement for interviewees to be GitHub users. Participants were selected based on a screener that assessed the depth and breadth of their AI use. We included only those who used AI for more than half of their coding work, used at least four AI tools from the thirteen we listed, and indicated experience with all of the advanced AI-assisted development activities included in the screener.\n\nParticipants worked in organizations of various sizes (55% in large or extra-large enterprises, 41% in small- or medium-sized enterprises, and 4% in a startup). Finally, we recruited participants across the spectrum of years of professional experience (14% had 0-5 years of experience, 41% had 6-10 years, 27% had 11-15 years, and 18% had over 16 years of experience).\n\nWe are grateful to all the developers who participated in the interviews for their invaluable input.",
  "Tags": [
    "AI",
    "developer experience",
    "developer tools",
    "News & insights",
    "Octoverse"
  ],
  "ProcessedDate": "2025-12-08 19:02:43",
  "FeedLevelAuthor": "The GitHub Blog",
  "FeedName": "The GitHub Blog",
  "Link": "https://github.blog/news-insights/octoverse/the-new-identity-of-a-developer-what-changes-and-what-doesnt-in-the-ai-era/",
  "Author": "Eirini Kalliamvakou",
  "OutputDir": "_news",
  "Description": "Discover how advanced AI users are redefining software development—shifting from code producers to strategic orchestrators—through delegation, verification, and a new era of AI-fluent engineering.\n\nThe post [The new identity of a developer: What changes and what doesn’t in the AI era](https://github.blog/news-insights/octoverse/the-new-identity-of-a-developer-what-changes-and-what-doesnt-in-the-ai-era/) appeared first on [The GitHub Blog](https://github.blog).",
  "FeedUrl": "https://github.blog/feed/",
  "PubDate": "2025-12-08T18:15:17+00:00",
  "Title": "The new identity of a developer: What changes and what doesn’t in the AI era"
}
