{
  "OutputDir": "_news",
  "EnhancedContent": "Security teams are being pushed to their limits as AI‑powered cyberattacks grow in speed, scale, and sophistication—and only 14% of organizations surveyed by the World Economic Forum report they feel confident they have the right people and skills needed to meet their cybersecurity objectives.1 As cyberthreats evolve faster than many teams can hire or train, pressure mounts to strengthen defenses, increase resilience, and achieve security outcomes faster. We’re here to help. Introducing the new [Microsoft Defender Experts Suite](https://aka.ms/DefenderExpertsSuite), a new security offering that provides expert-led services that help organizations defend against advanced cyberthreats, build long‑term resilience, and modernize security operations with confidence.\n\n## Microsoft Defender Experts Suite\n\nGet integrated security services that protect your organization and accelerate security outcomes in the new security offering from Microsoft.\n\n[Learn more](https://aka.ms/DefenderExpertsSuite)\n\n![A group of workers sitting at computers.](https://www.microsoft.com/en-us/security/blog/wp-content/uploads/2026/01/Untitled.webp)\n\n## Elevate your security with expert-led services\n\nEven as today’s security challenges feel overwhelming, you don’t have to face them alone. The Microsoft Defender Experts Suite combines managed extended detection and response (MXDR), end-to-end proactive and reactive incident response, and direct access to a designated Microsoft security advisor to help you protect your organization and accelerate security outcomes.\n\n![Graphic showing the three benefits of the Microsoft Defender Experts Suite: Defending against cyberthreats, building cyber resilience, and modernizing security operations. ](https://www.microsoft.com/en-us/security/blog/wp-content/uploads/2026/01/DEX-suite.webp)\n\n### **The Defender Experts Suite can help you do the following:**\n\n#### **Defend against cyberthreats**\n\n[Microsoft Defender Experts for XDR](https://www.microsoft.com/security/business/services/microsoft-defender-experts-xdr) delivers round-the-clock MXDR, natively integrated with Microsoft Defender. Our seasoned analysts—bringing more than 600 years of combined experience—triage, investigate, and respond to incidents across endpoints, identities, email, cloud apps, and cloud workloads, helping to reduce alert fatigue and improve security operations center (SOC) efficiency. Defender Experts for XDR includes Microsoft Defender Experts for Hunting, which provides around-the-clock, proactive threat hunting across domains to help uncover emerging cyberthreats earlier.\n\nWith Defender Experts for XDR, you gain access to a designated service delivery engineer who helps you get the full value of the service and provides ongoing recommendations to strengthen your security posture. You can also connect with our experts on-demand for deeper insight into specific incidents, attack vectors, or nation-state cyberthreats.\n\n#### **Build cyber resilience**\n\n[Microsoft Incident Response](https://www.microsoft.com/security/business/microsoft-incident-response) offers proactive and reactive services that help organizations prevent, withstand, and recover from cyber incidents. Backed by extensive threat intelligence, proprietary investigation tools, and direct engagement with Microsoft product engineering, Microsoft Incident Response strengthens resilience and delivers rapid response. Proactive services—such as incident response planning, assessments, simulation exercises, and advisory services—enhance incident response readiness, improve response capabilities, and provide tailored insights on the cyberthreat landscape.\n\nWhen an incident does occur, Microsoft Incident Response rapidly investigates, removes the cyberattacker, and helps accelerates recovery. Operating on the frontlines of the world’s most complex cyberattacks since 2008, the Microsoft Incident Response team provides speed, precision, and confidence in the moments that matter most.\n\n#### **Modernize security operations**\n\n[Microsoft Enhanced Designated Engineering](https://www.microsoft.com/en-us/microsoft-unified/value-acceleration-services) provides direct access to Microsoft security advisors who partner with customers to strengthen security posture and operational maturity. Our experts work with you to help ensure Microsoft security technologies are properly architected, configured, and used effectively to achieve desired security outcomes, supported by ongoing assessments and continuous improvement. They also collaborate with security teams to optimize operations, modernize processes, and apply Microsoft best practices and real world threat intelligence to improve detection, response, and resilience—helping organizations operate with confidence as cyberthreats evolve.\n\n[**Learn more about the Microsoft Defender Experts Suite**](https://aka.ms/DefenderExpertsSuitedatasheet)\n\n## Better together—integrated security services\n\nWith the Defender Experts Suite, organizations get more than standalone expertise—they gain integrated security services that reduce complexity and simplify operations. With shared intelligence and connected workflows, investigations can move faster, recommendations land in context, and improvements compound over time. Instead of managing multiple providers, security teams benefit from streamlined communication, consistent guidance, and comprehensive expertise from Microsoft security experts. This can result in a more resilient, more efficient, and more confident security operation that matures steadily rather than reacting in silos.\n\n## End-to-end, expert-led protection\n\nLet’s look at the Microsoft Defender Experts Suite in action. When you first get started with the Microsoft Defender Experts Suite, Enhanced Designated Engineering guides you through deploying Defender workloads securely and helps ensure Defender Experts for XDR is configured correctly. Once operational, Defender Experts for XDR provides constant MXDR and threat hunting to protect your environment. Defender Experts for XDR will provide ongoing recommendations to improve your security posture, and your designated Microsoft security advisor helps you act on those recommendations as your environment evolves.\n\nAssessments delivered by Microsoft Incident Response may uncover vulnerabilities or gaps. The Microsoft security advisor will step in to help you address them and strengthen resilience. And if an incident occurs, Defender Experts for XDR will work hand-in-hand with the Microsoft Incident Response team to help you respond and recover quickly. With end-to-end services delivered by Microsoft, you can benefit from reduced complexity, streamlined communication, comprehensive expertise, and continuous improvement.\n\n![A circle graph illustrating the benefits of Microsoft Enhanced Designated Engineering. ](https://www.microsoft.com/en-us/security/blog/wp-content/uploads/2026/01/DEX-services.webp)\n\n## Get started with the Microsoft Defender Experts Suite today and save\n\nFor a limited time, organizations can unlock the full value of expert-led services with a promotional offer. From January 1, 2026, through December 1, 2026, eligible customers can save up to 66% on the Microsoft Defender Experts Suite.2 Read more about the [**Microsoft Defender Experts Suite**](https://aka.ms/DefenderExpertsSuite) and get started now.\n\n[Get started with the Microsoft Defender Experts Suite](https://aka.ms/DefenderExpertsSuite)\n\nTo learn more about Microsoft Security solutions, visit our [website.](https://www.microsoft.com/en-us/security/business) Bookmark the [Security blog](https://www.microsoft.com/security/blog/) to keep up with our expert coverage on security matters. Also, follow us on LinkedIn ([Microsoft Security](https://www.linkedin.com/showcase/microsoft-security/)) and X ([@MSFTSecurity](https://twitter.com/@MSFTSecurity)) for the latest news and updates on cybersecurity.\n\n1[Bridging the Cyber Skills Gap](https://initiatives.weforum.org/bridging-the-cyber-skills-gap/home), World Economic Forum, 2025.\n\n2Eligible customers must purchase a minimum of 1,500 seats of the Microsoft Defender Experts Suite and have either Microsoft 365 E5 or Microsoft Defender and Purview  Frontline Workers (formerly Microsoft 365 F5).",
  "FeedUrl": "https://www.microsoft.com/en-us/security/blog/feed/",
  "FeedLevelAuthor": "Microsoft Security Blog",
  "ProcessedDate": "2026-01-06 18:02:09",
  "Link": "https://www.microsoft.com/en-us/security/blog/2026/01/06/introducing-the-microsoft-defender-experts-suite-elevate-your-security-with-expert-led-services/",
  "FeedName": "Microsoft Security Blog",
  "Description": "Announcing Microsoft Defender Experts Suite, a integrated set of expert-led services that helps security teams keep pace with modern cyberattacks.\n\nThe post [Introducing the Microsoft Defender Experts Suite: Elevate your security with expert-led services](https://www.microsoft.com/en-us/security/blog/2026/01/06/introducing-the-microsoft-defender-experts-suite-elevate-your-security-with-expert-led-services/) appeared first on [Microsoft Security Blog](https://www.microsoft.com/en-us/security/blog).",
  "PubDate": "2026-01-06T17:00:00+00:00",
  "Title": "Introducing the Microsoft Defender Experts Suite: Elevate your security with expert-led services",
  "Tags": [],
  "Author": "Aarti Borkar and Andrew Conway"
}
