{
  "Title": "Resurgence of a multi‑stage AiTM phishing and BEC campaign abusing SharePoint",
  "Link": "https://www.microsoft.com/en-us/security/blog/2026/01/21/multistage-aitm-phishing-bec-campaign-abusing-sharepoint/",
  "Tags": [],
  "OutputDir": "_news",
  "PubDate": "2026-01-22T05:14:14+00:00",
  "ProcessedDate": "2026-01-22 07:06:01",
  "Author": "Microsoft Defender Security Research Team",
  "FeedLevelAuthor": "Microsoft Security Blog",
  "FeedName": "Microsoft Security Blog",
  "Description": "Microsoft Defender Researchers uncovered a multi‑stage AiTM phishing and business email compromise (BEC) campaign targeting multiple organizations in the energy sector.\n\nThe post [Resurgence of a multi‑stage AiTM phishing and BEC campaign abusing SharePoint](https://www.microsoft.com/en-us/security/blog/2026/01/21/multistage-aitm-phishing-bec-campaign-abusing-sharepoint/) appeared first on [Microsoft Security Blog](https://www.microsoft.com/en-us/security/blog).",
  "FeedUrl": "https://www.microsoft.com/en-us/security/blog/feed/",
  "EnhancedContent": "Microsoft Defender Researchers uncovered a multi‑stage adversary‑in‑the‑middle (AiTM) phishing and business email compromise (BEC) campaign targeting multiple organizations in the energy sector, resulting in the compromise of various user accounts. The campaign abused SharePoint file‑sharing services to deliver phishing payloads and relied on inbox rule creation to maintain persistence and evade user awareness. The attack transitioned into a series of AiTM attacks and follow-on BEC activity spanning multiple organizations.\n\nFollowing the initial compromise, the attackers leveraged trusted internal identities from the target to conduct large‑scale intra‑organizational and external phishing, significantly expanding the scope of the campaign. Defender detections surfaced the activity to all affected organizations.\n\nThis attack demonstrates the operational complexity of AiTM campaigns and the need for remediation beyond standard identity compromise responses. Password resets alone are insufficient. Impacted organizations in the energy sector must additionally revoke active session cookies and remove attacker-created inbox rules used to evade detection.\n\n## **Attack chain: AiTM phishing attack**\n\n![](https://www.microsoft.com/en-us/security/blog/wp-content/uploads/2026/01/image-1.jpg)\n\n**Stage 1: Initial access via trusted vendor compromise**\n\nAnalysis of the initial access vector indicates that the campaign leveraged a phishing email sent from an email address belonging to a trusted organization, likely compromised before the operation began. The lure employed a SharePoint URL requiring user authentication and used subject‑line mimicry consistent with legitimate SharePoint document‑sharing workflows to increase credibility.\n\nThreat actors continue to leverage trusted cloud collaboration platforms particularly Microsoft SharePoint and OneDrive due to their ubiquity in enterprise environments. These services offer built‑in legitimacy, flexible file‑hosting capabilities, and authentication flows that adversaries can repurpose to obscure malicious intent. This widespread familiarity enables attackers to deliver phishing links and hosted payloads that frequently evade traditional email‑centric detection mechanisms.\n\n**Stage 2: Malicious URL clicks**\n\nThreat actors often abuse legitimate services and brands to avoid detection. In this scenario, we observed that the attacker leveraged the SharePoint service for the phishing campaign. While threat actors may attempt to abuse widely trusted platforms, Microsoft continuously invests in safeguards, detections, and abuse prevention to limit misuse of our services and to rapidly detect and disrupt malicious activity\n\n**Stage 3: AiTM attack**\n\nAccess to the URL redirected users to a credential prompt, but visibility into the attack flow did not extend beyond the landing page.\n\n![](https://www.microsoft.com/en-us/security/blog/wp-content/uploads/2026/01/image-20.webp)\n\n**Stage 4: Inbox rule creation**\n\nThe attacker later signed in with another IP address and created an Inbox rule with parameters to delete all incoming emails on the user’s mailbox and marked all the emails as read.\n\n**Stage 5: Phishing campaign**\n\nFollowed by Inbox rule creation, the attacker initiated a large-scale phishing campaign involving more than 600 emails with another phishing URL. The emails were sent to the compromised user’s contacts, both within and outside of the organization, as well as distribution lists. The recipients were identified based on the recent email threads in the compromised user’s inbox.\n\n**Stage 6: BEC tactics**\n\nThe attacker then monitored the victim user’s mailbox for undelivered and out of office emails and deleted them from the Archive folder. The attacker read the emails from the recipients who raised questions regarding the authenticity of the phishing email and responded, possibly to falsely confirm that the email is legitimate. The emails and responses were then deleted from the mailbox. These techniques are common in any BEC attacks and are intended to keep the victim unaware of the attacker’s operations, thus helping in persistence.\n\n**Stage 7: Accounts compromise**\n\nThe recipients of the phishing emails from within the organization who clicked on the malicious URL were also targeted by another AiTM attack. Microsoft Defender Experts identified all compromised users based on the landing IP and the sign-in IP patterns.\n\n## Mitigation and protection guidance\n\nMicrosoft Defender XDR detects suspicious activities related to AiTM phishing attacks and their follow-on activities, such as sign-in attempts on multiple accounts and creation of malicious rules on compromised accounts. To further protect themselves from similar attacks, organizations should also consider complementing MFA with conditional access policies, where sign-in requests are evaluated using additional identity-driven signals like user or group membership, IP location information, and device status, among others.\n\nDefender Experts also initiated rapid response with Microsoft Defender XDR to contain the attack including:\n\n- [Automatically disrupting](https://techcommunity.microsoft.com/t5/microsoft-365-defender-blog/automatically-disrupt-adversary-in-the-middle-aitm-attacks-with/ba-p/3821751) the AiTM attack on behalf of the impacted users based on the signals observed in the campaign.\n- Initiating [zero-hour auto purge (ZAP)](https://learn.microsoft.com/microsoft-365/security/office-365-security/zero-hour-auto-purge) in Microsoft Defender XDR to find and take automated actions on the emails that are a part of the phishing campaign.\n\nDefender Experts further worked with customers to remediate compromised identities through the following recommendations:\n\n- [Revoking session cookies](https://learn.microsoft.com/azure/active-directory/enterprise-users/users-revoke-access) in addition to resetting passwords.\n- Revoking the MFA setting changes made by the attacker on the compromised user’s accounts.\n- Deleting suspicious rules created on the compromised accounts.\n\n## **Mitigating AiTM phishing attacks**\n\nThe general remediation measure for any identity compromise is to reset the password for the compromised user. However, in AiTM attacks, since the sign-in session is compromised, password reset is not an effective solution. Additionally, even if the compromised user’s password is reset and sessions are revoked, the attacker can set up persistence methods to sign-in in a controlled manner by tampering with MFA. For instance, the attacker can add a new MFA policy to sign in with a one-time password (OTP) sent to attacker’s registered mobile number. With these persistence mechanisms in place, the attacker can have control over the victim’s account despite conventional remediation measures.\n\nWhile AiTM phishing attempts to circumvent MFA, implementation of MFA still remains an essential pillar in identity security and highly effective at stopping a wide variety of threats. MFA is the reason that threat actors developed the AiTM session cookie theft technique in the first place. Organizations are advised to work with their identity provider to ensure security controls like MFA are in place. Microsoft customers can implement MFA through various methods, such as using the Microsoft Authenticator, FIDO2 security keys, and certificate-based authentication.\n\nDefenders can also complement MFA with the following solutions and best practices to further protect their organizations from such attacks:\n\n- **Use** [**security defaults**](https://learn.microsoft.com/azure/active-directory/fundamentals/concept-fundamentals-security-defaults) as a baseline set of policies to improve identity security posture. For more granular control, **enable conditional access policies, especially risk-based access policies.** [Conditional access](https://learn.microsoft.com/azure/active-directory/conditional-access/overview?ocid=magicti_ta_learndoc) policies evaluate sign-in requests using additional identity-driven signals like user or group membership, IP location information, and device status, among others, and are enforced for suspicious sign-ins. Organizations can protect themselves from attacks that leverage stolen credentials by enabling policies such as compliant devices, trusted IP address requirements, or risk-based policies with proper access control.\n- **Implement** [**continuous access evaluation**](https://learn.microsoft.com/azure/active-directory/conditional-access/concept-continuous-access-evaluation?ocid=magicti_ta_learndoc)**.**\n- **Invest in advanced anti-phishing solutions** that monitor and scan incoming emails and visited websites. For example, organizations can leverage web browsers that automatically [identify and block malicious websites](https://learn.microsoft.com/deployedge/microsoft-edge-security-smartscreen?ocid=magicti_ta_learndoc), including those used in this phishing campaign, and solutions that [detect and block malicious emails, links, and files](https://www.microsoft.com/security/business/siem-and-xdr/microsoft-defender-office-365).\n- **Continuously monitor suspicious or anomalous activities.** Hunt for sign-in attempts with suspicious characteristics (for example, location, ISP, user agent, and use of anonymizer services).\n\n## **Detections**\n\nBecause AiTM phishing attacks are complex threats, they require solutions that leverage signals from multiple sources. [Microsoft Defender XDR](https://www.microsoft.com/security/business/threat-protection/microsoft-365-defender) uses its cross-domain visibility to detect malicious activities related to AiTM, such as session cookie theft and attempts to use stolen cookies for signing in.\n\nUsing Microsoft Defender for Cloud Apps [connectors](https://learn.microsoft.com/defender-cloud-apps/enable-instant-visibility-protection-and-governance-actions-for-your-apps), Microsoft Defender XDR raises AiTM-related alerts in multiple scenarios. For Microsoft Entra ID customers using Microsoft Edge, attempts by attackers to replay session cookies to access cloud applications are detected by Defender for Cloud Apps connectors for [Microsoft 365](https://learn.microsoft.com/defender-cloud-apps/connect-office-365) and [Azure](https://learn.microsoft.com/defender-cloud-apps/connect-azure). In such scenarios, Microsoft Defender XDR raises the following alert:\n\n- Stolen session cookie was used\n\nIn addition, signals from these Defender for Cloud Apps connectors, combined with data from the Defender for Endpoint network protection capabilities, also triggers the following Microsoft Defender XDR alert on Microsoft Entra ID. environments:\n\n- Possible AiTM phishing attempt\n\nA specific Defender for Cloud Apps [connector for Okta](https://learn.microsoft.com/defender-cloud-apps/connect-okta), together with Defender for Endpoint, also helps detect AiTM attacks on Okta accounts using the following alert:\n\n- Possible AiTM phishing attempt in Okta\n\nOther detections that show potentially related activity are the following:\n\n**Microsoft Defender for Office 365**\n\n- Email messages containing malicious file removed after delivery\n- Email messages from a campaign removed after delivery\n- A potentially malicious URL click was detected\n- A user clicked through to a potentially malicious URL\n- Suspicious email sending patterns detected\n\n**Microsoft Defender for Cloud Apps**\n\n- Suspicious inbox manipulation rule\n- Impossible travel activity\n- Activity from infrequent country\n- Suspicious email deletion activity\n\n**Microsoft Entra ID Protection**\n\n- Anomalous Token\n- Unfamiliar sign-in properties\n- Unfamiliar sign-in properties for session cookies\n\n**Microsoft Defender XDR**\n\n- BEC-related credential harvesting attack\n- Suspicious phishing emails sent by BEC-related user\n\n**Indicators of Compromise**\n\n- Network Indicators\n- 178.130.46.8 – Attacker infrastructure\n\n- 193.36.221.10 – Attacker infrastructure\n\n## **Recommended actions**\n\nMicrosoft recommends the following mitigations to reduce the impact of this threat:\n\n- Enable [Conditional Access policies](https://learn.microsoft.com/azure/active-directory/conditional-access/overview) in Microsoft Entra, especially risk-based access policies. Conditional access policies evaluate sign-in requests using additional identity-driven signals like user or group membership, IP address location information, and device status, among others, are enforced for suspicious sign-ins. Organizations can protect themselves from attacks that leverage stolen credentials by enabling policies such as compliant devices, Azure trusted IP address requirements, or risk-based policies with proper access control. If you are still evaluating Conditional Access, use [security defaults](https://learn.microsoft.com/azure/active-directory/fundamentals/concept-fundamentals-security-defaults) as an initial baseline set of policies to improve identity security posture.\n- Implement [continuous access evaluation](https://learn.microsoft.com/azure/active-directory/conditional-access/concept-continuous-access-evaluation).\n- Implement [Microsoft Entra passwordless sign-in with FIDO2 security keys](https://learn.microsoft.com/azure/active-directory/authentication/concept-authentication-passwordless#fido2-security-keys).\n- Turn on [network protection](https://learn.microsoft.com/microsoft-365/security/defender-endpoint/enable-network-protection) in Microsoft Defender for Endpoint to block connections to malicious domains and IP addresses.\n- Implement [Microsoft Defender for Endpoint – Mobile Threat Defense](https://learn.microsoft.com/defender-endpoint/mtd) on mobile devices used to access enterprise assets.\n- Leverage Microsoft Edge automatically [identify and block malicious websites](https://learn.microsoft.com/deployedge/microsoft-edge-security-smartscreen), including those used in this phishing campaign, and [Microsoft Defender for Office 365](https://learn.microsoft.com/defender-office-365/tenant-allow-block-list-about) to detect and block malicious emails, links, and files. [Monitor suspicious or anomalous activities](https://learn.microsoft.com/entra/id-protection/howto-identity-protection-configure-notifications) in Microsoft Entra ID Protection. Investigate sign-in attempts with suspicious characteristics (such as the location, ISP, user agent, and use of anonymizer services). Educate users about the risks of secure file sharing and emails from trusted vendors.\n\n## **Hunting queries** – **Microsoft XDR**\n\n**AHQ#1 – Phishing Campaign:**\n\nEmailEvents\n\n| where Subject has “*NEW PROPOSAL – NDA”*\n\n**AHQ#2 – Sign-in activity from the suspicious IP Addresses**\n\nAADSignInEventsBeta\n\n| where Timestamp &gt;= ago(7d)\n\n| where IPAddress startswith “178.130.46.” or IPAddress startswith “193.36.221.”\n\n## **Microsoft Sentinel**\n\nMicrosoft Sentinel customers can use the following analytic templates to find BEC related activities similar to those described in this post:\n\n- [Exchange workflow MailItemsAccessed operation anomaly](https://github.com/Azure/Azure-Sentinel/blob/master/Solutions/Microsoft%20365/Analytic%20Rules/MailItemsAccessedTimeSeries.yaml)\n- [Malicious Inbox Rule](https://github.com/Azure/Azure-Sentinel/blob/master/Solutions/Microsoft%20365/Analytic%20Rules/Malicious_Inbox_Rule.yaml)\n- [SharePointFileOperation via previously unseen IPs](https://github.com/Azure/Azure-Sentinel/blob/master/Solutions/Microsoft%20365/Analytic%20Rules/SharePoint_Downloads_byNewIP.yaml)\n- [SharePointFileOperation via devices with previously unseen user agents](https://github.com/Azure/Azure-Sentinel/blob/master/Solutions/Microsoft%20365/Analytic%20Rules/SharePoint_Downloads_byNewUserAgent.yaml)\n- [User login from different countries within 3 hours](https://github.com/Azure/Azure-Sentinel/blob/master/Detections/ASimAuthentication/imAuthSigninsMultipleCountries.yaml)\n- [TI Matching Analytics](https://github.com/Azure/Azure-Sentinel/tree/master/Solutions/Threat%20Intelligence)\n\nIn addition to the analytic templates listed above, Microsoft Sentinel customers can use the following hunting content to perform Hunts for BEC related activities:\n\n- [Possible AiTM phishing attempt against Microsoft Entra ID](https://github.com/Azure/Azure-Sentinel/blob/master/Solutions/SecurityThreatEssentialSolution/Analytic%20Rules/PossibleAiTMPhishingAttemptAgainstAAD.yaml)\n- [Unfamiliar Signin Correlation with AzurePortal Signin Attempts and AuditLogs](https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/MultipleDataSources/UnfamiliarsignincorrelationwithPortalSigninandAuditlogs.yaml)\n- [Multiple users email forwarded to same destination](https://github.com/Azure/Azure-Sentinel/blob/master/Solutions/Microsoft%20365/Hunting%20Queries/MultipleUsersEmailForwardedToSameDestination.yaml)\n- [Sign-ins From VPS providers](https://github.com/Azure/Azure-Sentinel/blob/master/Solutions/Cloud%20Identity%20Threat%20Protection%20Essentials/Hunting%20Queries/Signins-From-VPS-Providers.yaml)"
}
