{
  "FeedLevelAuthor": "Microsoft Security Blog",
  "ProcessedDate": "2025-12-17 19:03:42",
  "PubDate": "2025-12-17T17:00:00+00:00",
  "Author": "Igor Sakhnov",
  "Tags": [],
  "FeedName": "Microsoft Security Blog",
  "Title": "Access Fabric: A modern approach to identity and network access",
  "FeedUrl": "https://www.microsoft.com/en-us/security/blog/feed/",
  "EnhancedContent": "Today, most organizations use multiple identity systems and multiple network access solutions from multiple vendors. This happens, either intentionally or organically, when different areas of a company choose different tools, creating a fragmented environment that leaves weaknesses that cyberattackers are quick to weaponize.\n\n[Get unified identity and network solutions with Microsoft Entra](https://www.microsoft.com/en-us/security/business/microsoft-entra)\n\nSimply adding more tools isn’t enough. No matter how many you have, when identity systems and network security systems don’t work together, visibility drops, gaps form, and risks skyrocket. A unified, adaptive approach to access security, in contrast, can better ensure that only the right users are accessing your data and resources from the right places.\n\nWhen [identity and network access](https://www.microsoft.com/en-us/security/business/microsoft-entra) work in concert, sharing signals and amplifying each other’s strengths through a unified policy engine, they create a dynamic safety net—an Access Fabric—that continuously evaluates trust at the authentication and network levels throughout every session and enforces risk-based access decisions in real-time, not just at first sign-in.\n\n## **AI is amplifying the risk of defensive seams and gaps**\n\nAccess isn’t a single wall between your organizational resources and cyberthreats. It’s a lattice of decisions about people, devices, applications, agents, and networks. With multiple tools, management becomes patchwork: identity controls in this console, network controls over there, endpoint rules somewhere else, and software as a service (SaaS) configurations scattered across dozens of admin planes. Although each solution strives to do the right thing, the overall experience is disjointed, the signals are incomplete, and the policies are rarely consistent.\n\n## What is phishing?\n\n[Learn about the different types. ↗](https://www.microsoft.com/en-us/security/business/security-101/what-is-phishing)\n\nIn the age of AI, this fragmentation is dangerous. In fact, 79% of organizations that use six or more identity and network solutions reported an increase in significant breaches.1 Threat actors are using AI to get better at finding and exploiting weaknesses in defenses. For example, our data shows that threat actors are using AI to make phishing campaigns four and a half times more effective and to automate intrusion vectors at scale.2\n\nThe best strategy moving forward is to remove seams and close gaps that cyberattackers target. This is what an Access Fabric does. It isn’t a product or platform but a unified approach to access security across AI and SaaS apps, internet traffic, and private resources to protect every identity, access point, session, and resource with the same adaptive controls.\n\nAn Access Fabric solution continuously decides who can access what, from where, and under what conditions—in real time. It reduces complexity and closes the gaps that cyberattackers look for, because the same adaptive controls protect human users, devices, and even AI agents as they move between locations and networks.\n\n## **Why a unified approach to access security is better than a fragmented one**\n\nLet’s use an everyday example to illustrate the difference between an access security approach that uses fragmented tools versus one that uses an Access Fabric solution.\n\nIt’s a typical day at the office. After signing into your laptop and opening your confidential sales report, it hits you: You need coffee. There’s a great little cafe just in your building, so you pop downstairs with your laptop and connect to its public wireless network.\n\nUnfortunately, disconnected identity and security systems won’t catch that you just switched from a secure network to a public one. This means that the token issued while you were connected to your secure network will stay valid until it expires. In other words, until the token times out, you can still connect to sensitive resources, like your sales report. What’s more, anything you access is now exposed over the cafe’s public wireless network to anyone nearby—even to AI-empowered cyberattackers stalking the public network, just waiting to pounce.\n\nThe system that issued your token worked exactly as designed. It simply had no mechanism to receive a signal from your laptop that you had switched to an insecure network mid-session.\n\nNow let’s revise this scenario. This time you, your device, your applications, and your data are wrapped in the protection of an Access Fabric solution that connects identity, device, and network signals. You still need coffee and you still go down to the cafe. This time, however, your laptop sends a signal the moment you connect to the cafe’s public wireless network, triggering a policy that immediately revokes access to your confidential sales report.\n\nThe Access Fabric solution doesn’t simply trust a “one-and-done” sign-in but applies the [Zero Trust principles](https://www.microsoft.com/en-us/security/business/zero-trust) of “never trust, always verify” and “assume breach” to keep checking: Is this still really you? Is your device still healthy? Is this network trustworthy? How sensitive is the app or data you’re trying to access?\n\nAnything that looks off, like a change in network conditions, triggers a policy that automatically tightens or even pauses your access to sensitive resources. You don’t have to think about it. The safety net is always there, weaving identity and network signals together, updating risk scores, and continuously re-evaluating access to keep your data safe, wherever you are.\n\n[Protect and modernize your organization with a Zero Trust strategy](https://www.microsoft.com/en-us/security/business/zero-trust)\n\n>\n> *By weaving protection into every connection and every node at the authentication and network levels—an approach that integrates identity, networking, device, application, and data access solutions—and continuously responding to risk signals in real time, an Access Fabric solution transforms access security from disconnected tools into a living system of trust that adapts as threats, user scenarios, and digital environments evolve.*\n>\n\n## **What makes an Access Fabric solution effective**\n\nFor an Access Fabric solution to secure access in hybrid work environments effectively, it must be contextual, connected, and continuous.\n\n- **Contextual:** Instead of granting a human user, device, or autonomous agent access based on a password or one-time authentication token, a rich set of signals across identity, device posture, network telemetry, and business context inform every access decision. If context changes, the policy engine re-evaluates conditions and reassesses risk in real-time.\n- **Connected:** Instead of operating independently, identity and network controls share signals and apply consistent policies across applications, endpoints, and network edges. When identity and network telemetry reinforce one another, access decisions become comprehensive and dynamic instead of disjointed and episodic. This unified approach simplifies governance for security teams, who can set policies in one place.\n- **Continuous:** Verification at the authentication and network levels is ongoing throughout every session—not just at sign-in—as users, devices, and agents interact with resources. The policy engine at the heart of the solution is always learning and adapting. If risk levels change in response to a shift in device health, network activity, or suspicious behavior, the system responds instantly to mitigate cyberthreats before they escalate.\n\nWith an Access Fabric solution, life gets more secure for everyone. Identity and network access teams can configure comprehensive policies, review granular logs, and take coordinated action in one place. They can deliver better security while employees get a more consistent and intuitive experience, which improves security even more. Organizations can experiment with AI more safely because their Access Fabric solution will ensure that machine identities and AI agents play by the same smart rules as people.\n\nBy moving beyond static identity checks to real-time, context-aware access decisions, an Access Fabric solution delivers stronger access security and a smoother user experience wherever and however work happens.\n\n[Learn more about Microsoft Entra identity and network access solutions](http://aka.ms/entra)\n\nTo learn more about Microsoft Security solutions, visit our [website.](https://www.microsoft.com/en-us/security/business) Bookmark the [Security blog](https://www.microsoft.com/security/blog/) to keep up with our expert coverage on security matters. Also, follow us on LinkedIn ([Microsoft Security](https://www.linkedin.com/showcase/microsoft-security/)) and X ([@MSFTSecurity](https://twitter.com/@MSFTSecurity)) for the latest news and updates on cybersecurity.\n\n1[Secure employee access in the age of AI](https://cdn-dynmedia-1.microsoft.com/is/content/microsoftcorp/microsoft/final/en-us/microsoft-brand/documents/639917-secure-employee-access-report-2025-final.pdf).\n\n2[Microsoft Digital Defense Report 2025](https://www.microsoft.com/en-us/security/security-insider/threat-landscape/microsoft-digital-defense-report-2025).",
  "OutputDir": "_news",
  "Description": "An Access Fabric is a unified access security solution that continuously decides who can access what, from where, and under what conditions—in real time.\n\nThe post [Access Fabric: A modern approach to identity and network access](https://www.microsoft.com/en-us/security/blog/2025/12/17/access-fabric-a-modern-approach-to-identity-and-network-access/) appeared first on [Microsoft Security Blog](https://www.microsoft.com/en-us/security/blog).",
  "Link": "https://www.microsoft.com/en-us/security/blog/2025/12/17/access-fabric-a-modern-approach-to-identity-and-network-access/"
}
