{
  "OutputDir": "_news",
  "FeedLevelAuthor": "Microsoft Security Blog",
  "Description": "To bolster security for our customers, we need to align with our ecosystem partners. Our new collaboration with Beazley as an incident response partner is a step in that direction.\n\nThe post [Stronger together: New Beazley collaboration enhances cyber resilience](https://www.microsoft.com/en-us/security/blog/2025/12/08/stronger-together-new-beazley-collaboration-enhances-cyber-resilience/) appeared first on [Microsoft Security Blog](https://www.microsoft.com/en-us/security/blog).",
  "ProcessedDate": "2025-12-08 18:03:08",
  "FeedName": "Microsoft Security Blog",
  "Author": "Aarti Borkar",
  "Tags": [],
  "PubDate": "2025-12-08T17:00:00+00:00",
  "EnhancedContent": "Today’s cyberthreat landscape demands more than technical expertise: it requires a unified response team of technical responders, insurers, brokers, and legal counsel. This integrated approach is key to building long-term cyber resilience to help your organization anticipate, withstand, recover from, and adapt to cyberattacks. It’s not just about strong defenses, but how quickly and effectively you [respond to an incident](https://www.microsoft.com/en-us/security/business/microsoft-incident-response). Cyber insurance plays a critical role, helping you recover faster while reinforcing trust across your organization and with your partners.\n\n[Microsoft Incident Response: Dedicated experts and intelligence-driven response](https://www.microsoft.com/en-us/security/business/microsoft-incident-response)\n\nTo bolster security for our customers, we recognize the need to align ourselves with our closest ecosystem partners. And our new collaboration with [Beazley](https://www.beazley.com/en-US/cyber-customer-centre/cyber-risk-management-tools/data-recovery-guide/vendor-examples/) as an approved incident response partner for its InfoSec and Media Tech policies is a strong step in that direction. As a globally recognized specialist insurer, Beazley has built a reputation for innovation and responsiveness, with deep security expertise. Their commitment to cyber resilience, combined with strategic partnerships and a strong claims performance record, positions Beazley as a trusted partner for organizations navigating today’s complex cyberthreat landscape.\n\n> >\n> *“We believe that cyber resilience is built on speed, expertise, and trusted partnerships. Our collaboration with Microsoft brings together world-class incident response capabilities and deep insurance experience—helping our clients recover faster and with greater confidence when every second counts.”*\n> >\n> —Marcello Antonucci, Claims Team Leader, Cyber and Tech Risks, Beazley\n> >\n\nOur collaboration with Beazley, and its Full Spectrum Cyber proposition, highlights Microsoft’s commitment to delivering trusted, best-in-class cyber incident response services. For decades, [Microsoft Incident Response](https://www.microsoft.com/security/business/microsoft-incident-response?msockid=2033ff1ceb3e609904bdeb02ea13613a) has been on the front lines, working with customers to solve some of the world’s most complex and high-profile security incidents. Our Incident Response team’s direct access to Microsoft’s engineering resources, combined with the support of Microsoft Threat Intelligence, gives us robust capabilities to support organizations facing an incident. Working with Beazley, we are reinforcing a shared focus on proactive, high-quality incident response, helping customers prepare for, respond to, and recover from security incidents with confidence.\n\n## **Tech, insurance, and legal, expertly aligned**\n\nMicrosoft takes a comprehensive, coordinated approach to incident response, teaming with industry-recognized law firms and leading insurance providers and brokers to help organizations have a complete, streamlined response when a cyber incident occurs. These teams work together to help minimize damage, assist with legal protection, and expedite financial recovery for your organization.\n\nMicrosoft Incident Response quickly identifies and mitigates cyberthreats, while supporting insurance brokers and providers who assess the financial impact and facilitate claims. Pre-aligned law firms stand ready to help with regulatory compliance and legal repercussions. Our singular focus is bringing your organization back to normal as smoothly and quickly as possible.\n\n## Faster response, seamless reimbursement\n\nWe’ve built Microsoft Incident Response with both technical strength and ease of use. Our invoicing process follows insurance industry standards, so customers can easily list Microsoft Incident Response as their incident response provider, either with their insurer or through a broker. This helps streamline onboarding and supports reimbursements for covered incidents under eligible cyber insurance policies.\n\nFor Microsoft customers, the collaboration with Beazley means that incident response services used during a cyber event are considered reimbursable expenses, simplifying the claims process and enabling faster action.\n\nTo add Microsoft to a new or existing policy, just notify your broker or Beazley and select a policy that supports this option.\n\nWith the right players in place, your security team doesn’t have to waste precious time figuring out next steps. We look forward to other insurance carriers joining us on this journey to provide our customers with clear options for insurance policies that recognize and approve Microsoft Incident Response.\n\n## Microsoft Incident Response\n\nStrengthen your security with an end-to-end portfolio of proactive and reactive cybersecurity incident response services.\n\n[Get started.](https://www.microsoft.com/en-us/security/business/microsoft-incident-response)\n\n![CISO (chief information security officer) collaborating with practitioners in a security operations center.](https://www.microsoft.com/en-us/security/blog/wp-content/uploads/2025/11/CLO22_SecOps_001.jpg)\n\n## **Learn more**\n\nTo learn more about how our teams are working together, and how our collaboration with cyber insurance providers like Beazley can help you strengthen your cyber resilience, visit the [Microsoft Incident Response webpage](https://www.microsoft.com/security/business/microsoft-incident-response).\n\nTo learn more about Microsoft Security solutions, visit our [website.](https://www.microsoft.com/en-us/security/business) Bookmark the [Security blog](https://www.microsoft.com/security/blog/) to keep up with our expert coverage on security matters. Also, follow us on LinkedIn ([Microsoft Security](https://www.linkedin.com/showcase/microsoft-security/)) and X ([@MSFTSecurity](https://twitter.com/@MSFTSecurity)) for the latest news and updates on cybersecurity.",
  "Link": "https://www.microsoft.com/en-us/security/blog/2025/12/08/stronger-together-new-beazley-collaboration-enhances-cyber-resilience/",
  "Title": "Stronger together: New Beazley collaboration enhances cyber resilience",
  "FeedUrl": "https://www.microsoft.com/en-us/security/blog/feed/"
}
