{
  "PubDate": "2026-02-12T17:00:00+00:00",
  "FeedName": "Microsoft Security Blog",
  "Description": "Microsoft Security returns to RSAC Conference to show how Frontier Firms—organizations that are human-led and agent-operated—can stay ahead.\n\nThe post [Your complete guide to Microsoft experiences at RSAC™ 2026 Conference](https://www.microsoft.com/en-us/security/blog/2026/02/12/your-complete-guide-to-microsoft-experiences-at-rsac-2026-conference/) appeared first on [Microsoft Security Blog](https://www.microsoft.com/en-us/security/blog).",
  "FeedUrl": "https://www.microsoft.com/en-us/security/blog/feed/",
  "FeedLevelAuthor": "Microsoft Security Blog",
  "OutputDir": "_news",
  "Link": "https://www.microsoft.com/en-us/security/blog/2026/02/12/your-complete-guide-to-microsoft-experiences-at-rsac-2026-conference/",
  "ProcessedDate": "2026-02-12 18:14:52",
  "Author": "Microsoft Security Team",
  "Title": "Your complete guide to Microsoft experiences at RSAC™ 2026 Conference",
  "Tags": [],
  "EnhancedContent": "The era of AI is reshaping both opportunity and risk faster than any shift security leaders have seen. Every organization is feeling the momentum; and for security teams, the question is no longer *if* AI will transform their work, but *how* to stay ahead of what comes next.\n\nAt Microsoft, we see this moment giving rise to what we call the [Frontier Firm](https://www.microsoft.com/en-us/worklab/work-trend-index/2025-the-year-the-frontier-firm-is-born?msockid=20e770866e266e77224566ea6f436f74): organizations that are human-led and agent-operated. With more than 80% of leaders already using agents or planning to within the year, we’re entering a world where every person may soon have an entire agentic team at their side1. By 2028, IDC projects 1.3 billion agents in use—a scale that changes everything about how we work and how we secure2.\n\nIn the agentic era, security must be ambient and autonomous, just like the AI it protects. This is our vision for security as the core primitive, woven into and around everything we build and throughout everything we do. At [RSAC 2026](https://www.rsaconference.com/usa), we’ll share how we are delivering on that vision through our AI-first, end-to-end, security platform that helps you protect every layer of the AI stack and secure with agentic AI.\n\n## Join us at RSAC Conference 2026—March 22–26 in San Francisco\n\nRSAC 2026 will give you a front‑row seat to how AI is transforming the global threat landscape, and how defenders can stay ahead with:\n\n- A deeper understanding of how AI is reshaping the global threat landscape\n- Insight into how Microsoft can help you protect every layer of the AI stack and secure with agentic AI\n- Product demos, curated sessions, executive conversations, and live meetings with our experts in the booth\n\nThis is your moment to see what’s next and what’s possible as we enter the era of agentic security.\n\n## Microsoft at RSAC™ 2026\n\nFrom Microsoft Pre‑Day to innovation sessions, networking opportunities, and 1:1 meetings, explore experiences designed to help you navigate the age of AI with clarity and impact.\n\n[Explore conference events](http://microsoftsecurityevents.eventbuilder.com/RSACMicrosoftEvents26?ref=blog_RSACpreevent)\n\n![](https://www.microsoft.com/en-us/security/blog/wp-content/uploads/2026/02/Highlights_Day-1_19571-1-scaled.jpg)\n\n## Microsoft Pre-Day: Your first look at what’s next in security\n\nKick off RSAC 2026 on Sunday, March 22 at the Palace Hotel for Microsoft Pre‑Day, an exclusive experience designed to set the tone for the week ahead.\n\nHear keynote insights from Vasu Jakkal, CVP of Microsoft Security Business and other Microsoft security leaders as they explore how AI and agents are reshaping the security landscape.\n\nYou’ll discover how Microsoft is advancing agentic defense, informed by more than 100 trillion security signals each day. You’ll learn how solutions like Agent 365 deliver observability at every layer, and how Microsoft’s purpose‑built security capabilities help you secure every layer of the AI stack. You’ll also explore how our expert-led services can help you defend against cyberthreats, build cyber resilience, and transform your security operations.\n\nThe experience concludes with opportunities to connect, including a networking reception and an invite-only dinner for CISOs and security executives.\n\nMicrosoft Pre‑Day is your chance to hear what is coming next and prepare for the week ahead. [Secure your spot today](http://microsoftsecurityevents.eventbuilder.com/RSACMicrosoftEvents26?ref=blog_RSACpreevent).\n\n## Executive events: Exclusive access to insights, strategy, and connections\n\nFor CISOs and senior security decision makers, RSAC 2026 offers curated experiences designed to deliver maximum value:\n\n- **CISO Dinner (Sunday, March 22):** Join Microsoft Security executives and fellow CISOs for an intimate dinner following Microsoft Pre-Day. Share insights, compare strategies, and build connections that matter.\n- [**The CISO and CIO Mandate for Securing and Governing AI**](https://microsoftsecurityevents.eventbuilder.com/events/11f0faef6fed36308e19d96fa2d54087?ref=blog_RSACpreevent) **(Monday, March 23):** A session outlining why organizations need integrated AI security and governance to manage new risks and accelerate responsible innovation.\n- [**Executive Lunch & Learn: AI Agents are here! Are you Ready?**](https://microsoftsecurityevents.eventbuilder.com/events/11f0faf0b65f28708e19d96fa2d54087?ref=blog_RSACpreevent) **(Tuesday, March 24):** A panel exploring how observability, governance, and security are essential to safely scaling AI agents and unlocking human potential.\n- [**The AI Risk Equation: Visibility, Control, and Threat Acceleration**](https://microsoftsecurityevents.eventbuilder.com/events/11f0faf1ae4b7b1092042d2e601772ba?ref=blog_RSACpreevent) **(Wednesday, March 25):** A deeply interactive discussion on how CISOs address AI proliferation, visibility challenges, and expanding attack surfaces while guiding enterprise risk strategy.\n- [**Post-Day Forum**](https://microsoftsecurityevents.eventbuilder.com/events/11f08f87de9a33909ead7b6ebdb91d99?ref=blog_RSACpreevent) **(Thursday, March 26):** Wrap up RSAC with an immersive, half‑day program at the Microsoft Experience Center in Silicon Valley—designed for deeper conversations, direct access to Microsoft’s security and AI experts, and collaborative sessions that go beyond the main‑stage content. Explore securing and managing AI agents, protecting multicloud environments, and deploying agentic AI through interactive discussions. Transportation from the city center will be provided. Space is limited, so [register early](https://microsoftsecurityevents.eventbuilder.com/events/11f08f87de9a33909ead7b6ebdb91d99?ref=blog_RSACpreevent).\n\nThese experiences are designed to help CISOs move beyond theory and into actionable strategies for securing their organizations in an AI-first world.\n\n## Keynote and sessions: Insights you can act on\n\nOn Monday, March 23, don’t miss the RSAC 2026 keynote featuring Vasu Jakkal, CVP of Microsoft Security. In *[Ambient and Autonomous Security: Building Trust in the Agentic AI Era](https://path.rsaconference.com/flow/rsac/us26/FullAgenda/page/catalog/session/1765210885629001yTWd)* (3:55 PM-4:15 PM PDT), learn how ambient, autonomous platforms with deep observability are evolving to address AI-powered threats and build a trusted digital foundation.\n\n**Here are two sessions you don’t want to miss:**\n\n1. **[Security, Governance, and Control for Agentic AI](https://path.rsaconference.com/flow/rsac/us26/FullAgenda/page/catalog/session/1766007313150001Ao0e)**\n\n- **Monday, March 23 | 2:20–3:10 PM.**Learn the core principles that keep autonomous agents secure and governed so organizations can innovate with AI without sprawl, misuse, or unintended actions.\n- Speakers: Neta Haiby, Partner, Product Manager and Tina Ying, Director, Product Marketing, Microsoft\n\n2. **[Advancing Cyber Defense in the Era of AI Driven Threats](https://path.rsaconference.com/flow/rsac/us26/FullAgenda/page/catalog/session/1766179592286001Gnzq)**\n\n- **Tuesday, March 24 | 9:40–10:30 AM.** Explore how AI elevates threat sophistication and what resilient, intelligence-driven defenses look like in this new era.\n- Speaker: Brad Sarsfield, Senior Director, Microsoft Security, NEXT.ai\n\n**Plus, don’t miss our sessions throughout the week:**\n\n- **Monday, March 23**\n- [Cyber Coaches: Lessons from Securing US Water Infrastructure](https://path.rsaconference.com/flow/rsac/us26/FullAgenda/page/catalog/session/1756072687341001qyhB)\n- **Tuesday, March 24**\n- [How to Red Team a Frontier AI Model](https://path.rsaconference.com/flow/rsac/us26/FullAgenda/page/catalog/session/1754088458312001YuA5)\n- [Turning Mandates Into Momentum: Policy Tools for PQC Adoption](https://path.rsaconference.com/flow/rsac/us26/FullAgenda/page/catalog/session/1769202450618001F5zZ)\n- [AI, Identity, and Ethical Governance: Building Trust in High Stakes Systems](https://path.rsaconference.com/flow/rsac/us26/FullAgenda/page/catalog/session/1755968790926001EhVR)\n- **Wednesday, March 25**\n- [VC Investments—2026 and Beyond](https://path.rsaconference.com/flow/rsac/us26/FullAgenda/page/catalog/session/1755143969632001tfHi)\n- [The Fundamentals Forum: Let’s Get Back to Basics](https://path.rsaconference.com/flow/rsac/us26/FullAgenda/page/catalog/session/1766346761940001LNt8)\n- **Thursday, March 26**\n- [Beyond Red Teaming: Why AI Security Needs a Bigger Playbook](https://path.rsaconference.com/flow/rsac/us26/FullAgenda/page/catalog/session/1753742315984001saKU)\n- [Architecting Systems for Human–AI Collaboration in Cyber Defense](https://path.rsaconference.com/flow/rsac/us26/FullAgenda/page/catalog/session/1755448641370001IWRp)\n- [Disrupting Cybercrime Networks, Successfully, Continuously, and at Scale](https://path.rsaconference.com/flow/rsac/us26/FullAgenda/page/catalog/session/1755983926195001DHiK)\n- [Automated Cyber Defense: Lessons from DARPA’s AI Cyber Challenge](https://path.rsaconference.com/flow/rsac/us26/FullAgenda/page/catalog/session/1763481904259001CAwO)\n- [AI on Trial: How CISOs Navigate Hype, Risk, and Accountability](https://path.rsaconference.com/flow/rsac/us26/FullAgenda/page/catalog/session/1768249356753001YPvg)\n\n## Microsoft Booth #5744: Theater sessions and interactive experiences\n\nVisit the Microsoft booth at Moscone Center for an immersive look at how modern security teams protect AI‑powered environments. Connect with Microsoft experts, explore security and governance capabilities built for agentic AI, and see how solutions work together across identity, data, cloud, and security operations.\n\n![People talking near a Microsoft Security booth.](https://www.microsoft.com/en-us/security/blog/wp-content/uploads/2026/02/Highlights_Day-1_19584-scaled.jpg)\n\n### Test your skills and compete in security games\n\nAt the center of the booth is an interactive single‑player experience that puts you in a high‑stakes security scenario, working with adaptive agents to triage incidents, optimize conditional access, surface threat intelligence, and keep endpoints secure and compliant, then guiding you to demo stations for deeper exploration.\n\n### Quick sessions, big takeaways, plus a custom pet sticker\n\nYou can also stop by the booth theater for short, expert‑led sessions highlighting real‑world use cases and practical guidance, giving you a clear view of how to strengthen your security approach across the AI landscape—and while you’re there, don’t miss the Security Companion Sticker activation, where you can upload a photo of your pet and receive a curated AI-generated sticker.\n\n## Microsoft Security Hub: Your space to connect\n\n![People talking around tables at a conference.](https://www.microsoft.com/en-us/security/blog/wp-content/uploads/2026/02/Highlights_Day-1_19558-1-scaled.jpg)\n\nThroughout the week, the iconic Palace Hotel will serve as Microsoft’s central gathering place—a welcoming hub where you can step away from the bustle of the conference. It’s a space to recharge and connect with Microsoft security experts and executives, participate in focused thought leadership sessions and roundtable discussions, and take part in networking experiences designed to spark meaningful conversations. Full details on sessions and activities are available on the [Microsoft Security Experiences at RSAC™ 2026 page](http://microsoftsecurityevents.eventbuilder.com/RSACMicrosoftEvents26?ref=blog_RSACpreevent).\n\nCustomers can also take advantage of scheduled one-on-one meetings with Microsoft security experts during the week. These meetings offer an opportunity to dig deeper into today’s threat landscape, discuss specific product questions, and explore strategies tailored to your organization. To schedule a one-on-one meeting with Microsoft executives and subject matter experts, speak with your account representative or [submit a meeting request form](https://aka.ms/RSAC/MeetingRequest).\n\n## Partners: Building security together\n\nMicrosoft’s presence at RSAC 2026 isn’t just about our technology. It’s about the ecosystem. Visit the booth and the Security Hub to meet members of the [**Microsoft Intelligent Security Association (MISA)**](https://aka.ms/MISA) and explore how our partners extend and enhance Microsoft Security solutions. From integrated threat intelligence to compliance automation, these collaborations help you build a stronger, more resilient security posture.\n\nSpecial thanks to Ascent Solutions, Avertium, BlueVoyant, CyberProof, Darktrace, and Huntress for sponsoring the Microsoft Security Hub and karaoke party.\n\n## Why join us at RSAC?\n\nAttending RSAC™ 2026? By engaging with Microsoft Security, you’ll gain clear perspective on how AI agents are reshaping risk and response, practical guidance to help you focus on what matters most, and meaningful connections with peers and experts facing the same challenges.\n\nTogether, we can make the world safer for all. Join us in San Francisco and be part of the conversation defining the next era of cybersecurity.\n\n[Explore Microsoft experiences at RSAC 2026](http://microsoftsecurityevents.eventbuilder.com/RSACMicrosoftEvents26?ref=blog_RSACpreevent)\n\nTo learn more about Microsoft Security solutions, visit our [website.](https://www.microsoft.com/en-us/security/business) Bookmark the [Security blog](https://www.microsoft.com/security/blog/) to keep up with our expert coverage on security matters. Also, follow us on LinkedIn ([Microsoft Security](https://www.linkedin.com/showcase/microsoft-security/)) and X ([@MSFTSecurity](https://twitter.com/@MSFTSecurity)) for the latest news and updates on cybersecurity.\n\n*1According to data from the [2025 Work Trend Index](https://www.microsoft.com/en-us/worklab/work-trend-index/2025-the-year-the-frontier-firm-is-born), 82% of leaders say this is a pivotal year to rethink key aspects of strategy and operations, and 81% say they expect agents to be moderately or extensively integrated into their company’s AI strategy in the next 12–18 months. At the same time, adoption on the ground is spreading but uneven: 24% of leaders say their companies have already deployed AI organization-wide, while just 12% remain in pilot mode.2IDC Info Snapshot, sponsored by Microsoft, 1.3 Billion AI Agents by 2028, May 2025 #US53361825*"
}
