{
  "OutputDir": "_news",
  "PubDate": "2026-03-12T17:00:00+00:00",
  "FeedLevelAuthor": "Microsoft Security Blog",
  "ProcessedDate": "2026-03-12 19:15:59",
  "Tags": [
    "Credential theft",
    "Storm"
  ],
  "Author": "Microsoft Threat Intelligence and Microsoft Defender Experts",
  "EnhancedContent": "In mid-January 2026, Microsoft Defender Experts identified a credential theft campaign that uses fake virtual private network (VPN) clients distributed through search engine optimization (SEO) poisoning. The campaign redirects users searching for legitimate enterprise software to malicious ZIP files on attacker-controlled websites to deploy digitally signed trojans that masquerade as trusted VPN clients while harvesting VPN credentials. Microsoft Threat Intelligence attributes this activity to the cybercriminal threat actor Storm-2561.\n\nActive since May 2025, Storm-2561 is known for distributing malware through SEO poisoning and impersonating popular software vendors. The techniques they used in this campaign highlight how threat actors continue to exploit trusted platforms and software branding to avoid user suspicion and steal sensitive information. By targeting users who are actively searching for enterprise VPN software, attackers take advantage of both user urgency and implicit trust in search engine rankings. The malicious ZIP files that contain fake installer files are hosted on GitHub repositories, which have since been taken down. Additionally, the trojans are digitally signed by a legitimate certificate that has since been revoked.\n\n## STORM-2561\n\n[Learn how Microsoft names threat actors ↗](https://learn.microsoft.com/unified-secops/microsoft-threat-actor-naming)\n\nIn this blog, we share our in-depth analysis of the tactics, techniques, and procedures (TTPs) and indicators of compromise in this Storm-2561 campaign, highlighting the social engineering techniques that the threat actor used to improve perceived legitimacy, avoid suspicion, and evade detection. We also share protection and mitigation recommendations, as well as [Microsoft Defender](https://www.microsoft.com/security/business/microsoft-defender) detection and hunting guidance.\n\n## MICROSOFT DEFENDER EXPERTS\n\n[Around the clock, expert-led defense ↗](https://www.microsoft.com/security/business/services/microsoft-defender-experts-xdr)\n\n## From search to stolen credentials: Storm-2561 attack chain\n\nIn this campaign, users searching for legitimate VPN software are redirected from search results to spoofed websites that closely mimic trusted VPN products but instead deploy malware designed to harvest credentials and VPN data. When users click to download the software, they are redirected to a malicious GitHub repository (no longer available) that hosts the fake VPN client for direct download.\n\nThe GitHub repo hosts a ZIP file containing a Microsoft Windows Installer (MSI) installer file that mimics a legitimate VPN software and side-loads malicious dynamic link library (DLL) files during installation. The fake VPN software enables credential collection and exfiltration while appearing like a benign VPN client application.\n\nThis campaign exhibits characteristics consistent with financially motivated cybercrime operations employed by Storm-2561. The malicious components are digitally signed by “Taiyuan Lihua Near Information Technology Co., Ltd.”\n\n![Diagram showing the attack chain of the Storm-2561 campaign](https://www.microsoft.com/en-us/security/blog/wp-content/uploads/2026/03/Fig1-Storm-2561-attack-chain.webp)*Figure 1. Storm-2561 campaign attack chain*\n\n### Initial access and execution\n\nThe initial access vector relies on abusing SEO to push malicious websites to the top of search results for queries such as “Pulse VPN download” or “Pulse Secure client,” but Microsoft has observed spoofing of various VPN software brands and has observed the GitHub link at the following two domains: *vpn-fortinet[.]com* and *ivanti-vpn[.]org*.\n\nOnce the user lands on the malicious website and clicks to download the software, the malware is delivered through a ZIP download hosted at *hxxps[:]//github[.]com/latestver/vpn/releases/download/vpn-client2/VPN-CLIENT.zip.* At the time of this report, this repository is no longer active.\n\n![Screenshot of fake website posting as Fortinet](https://www.microsoft.com/en-us/security/blog/wp-content/uploads/2026/03/Fig2-actor-controlled-website.webp)*Figure 2. Screenshot from actor-controlled website vpn-fortinet[.]com masquerading as Fortinet* ![Code snippet for downloading the fake VPN installer](https://www.microsoft.com/en-us/security/blog/wp-content/uploads/2026/03/Fig3-code-snippet.webp)*Figure 3. Code snippet from vpn-fortinet[.]com showing download of VPN-CLIENT.zip hosted on GitHub*\n\nWhen the user launches the malicious MSI masquerading as a legitimate Pulse Secure VPN installer embedded within the downloaded ZIP file, the MSI file installs *Pulse.exe* along with malicious DLL files to a directory structure that closely resembles a real Pulse Secure installation path: *%CommonFiles%\\Pulse Secure*. This installation path blends in with legitimate VPN software to appear trustworthy and avoid raising user suspicion.\n\nAlongside the primary application, the installer drops malicious DLLs, *dwmapi.dll* and *inspector.dll*, into the *Pulse Secure* directory. The *dwmapi.dll* file is an in-memory loader that drops and launches an embedded shellcode payload that loads and launches the *inspector.dll* file, a variant of the infostealer Hyrax. The Hyrax infostealer extracts URI and VPN sign-in credentials before exfiltrating them to attacker-controlled command-and-control (C2) infrastructure.\n\n**Code signing abuse**\n\nThe MSI file and the malicious DLLs are signed with a valid digital certificate, which is now revoked, from *Taiyuan Lihua Near Information Technology Co., Ltd.* This abuse of code signing serves multiple purposes:\n\n- Bypasses default Windows security warnings for unsigned code\n- Might bypass application whitelisting policies that trust signed binaries\n- Reduces security tool alerts focused on unsigned malware\n- Provides false legitimacy to the installation process\n\nMicrosoft identified several other files signed with the same certificates. These files also masqueraded as VPN software. These IOCs are included in the below.\n\n### Credential theft\n\nThe fake VPN client presents a graphical user interface that closely mimics the legitimate VPN client, prompting the user to enter their credentials. Rather than establishing a VPN connection, the application captures the credentials entered and exfiltrates them to attacker-controlled C2 infrastructure (*194.76.226[.]93:8080*). This approach relies on visual deception and immediate user interaction, allowing attackers to harvest credentials as soon as the target attempts to sign in. The credential theft operation follows the below structured sequence:\n\n- **UI presentation**: A fake VPN sign-in dialog is displayed to the user, closely resembling the legitimate Pulse Secure client.\n- **Error display**: After credentials are submitted, a fake error message is shown to the user.\n- **Redirection**: The user is instructed to download and install the legitimate Pulse Secure VPN client.\n- **Access to stored VPN data**: The *inspector.dll* component accesses stored VPN configuration data from *C:\\ProgramData\\Pulse Secure\\ConnectionStore\\connectionstore.dat*.\n- **Data exfiltration**: Stolen credentials and VPN configuration data are transmitted to attacker-controlled infrastructure.\n\n### Persistence\n\nTo maintain access, the MSI malware establishes persistence during installation through the Windows *RunOnce* registry key, adding the *Pulse.exe* malware to run when the device reboots.\n\n### Defense evasion\n\nOne of the most sophisticated aspects of this campaign is the post-credential theft redirection strategy. After successfully capturing user credentials, the malicious application conducts the following actions:\n\n- Displays a convincing error message indicating installation failure\n- Provides instructions to download the legitimate Pulse VPN client from official sources\n- In certain instances, opens the user’s browser to the legitimate VPN website\n\nIf users successfully install and use legitimate VPN software afterward, and the VPN connection works as expected, there are no indications of compromise to the end user. Users are likely to attribute the initial installation failure to technical issues, not malware.\n\n## Defending against credential theft campaigns\n\nMicrosoft recommends the following mitigations to reduce the impact of this threat.\n\n- Turn on [cloud-delivered protection](https://learn.microsoft.com/defender-endpoint/configure-block-at-first-sight-microsoft-defender-antivirus) in Microsoft Defender Antivirus or the equivalent for your antivirus product to cover rapidly evolving attacker tools and techniques. Cloud-based machine learning protections block a huge majority of new and unknown variants.\n- Run [endpoint detection and response (EDR) in block mode](https://learn.microsoft.com/defender-endpoint/edr-in-block-mode) so that Microsoft Defender for Endpoint can block malicious artifacts, even when your non-Microsoft antivirus does not detect the threat or when Microsoft Defender Antivirus is running in passive mode. EDR in block mode works behind the scenes to remediate malicious artifacts that are detected post-breach.\n- Enable [network protection](https://learn.microsoft.com/defender-endpoint/enable-network-protection) in Microsoft Defender for Endpoint.\n- Turn on [web protection](https://learn.microsoft.com/defender-endpoint/web-protection-overview) in Microsoft Defender for Endpoint.\n- Encourage users to use Microsoft Edge and other web browsers that support [SmartScreen](https://learn.microsoft.com/windows/security/operating-system-security/virus-and-threat-protection/microsoft-defender-smartscreen/), which identifies and blocks malicious websites, including phishing sites, scam sites, and sites that contain exploits and host malware.\n- Enforce multifactor authentication (MFA) on all accounts, remove users excluded from MFA, and strictly [require MFA](https://learn.microsoft.com/entra/id-protection/howto-identity-protection-configure-mfa-policy) from all devices, in all locations, at all times.\n- Remind employees that enterprise or workplace credentials should not be stored in browsers or password vaults secured with personal credentials. Organizations can turn off password syncing in browser on managed devices using [Group Policy](https://learn.microsoft.com/deployedge/microsoft-edge-enterprise-sync#sync-group-policies).\n- Turn on the following [attack surface reduction rule](https://learn.microsoft.com/defender-endpoint/attack-surface-reduction) to block or audit activity associated with this threat:\n- [Block executable files from running unless they meet a prevalence, age, or trusted list criterion](https://learn.microsoft.com/defender-endpoint/attack-surface-reduction-rules-reference#block-executable-files-from-running-unless-they-meet-a-prevalence-age-or-trusted-list-criterion)\n\n## Microsoft Defender detection and hunting guidance\n\n[Microsoft Defender](https://www.microsoft.com/security/business/microsoft-defender) customers can refer to the list of applicable detections below. Microsoft Defender coordinates detection, prevention, investigation, and response across endpoints, identities, email, apps to provide integrated protection against attacks like the threat discussed in this blog.\n\n| **Tactic** | **Observed activity** | **Microsoft Defender coverage** | | --- | --- | --- | | Execution | Payloads deployed on the device. | **[Microsoft Defender Antivirus](https://www.microsoft.com/windows/comprehensive-security)** <br>– [Trojan:Win32/Malgent](https://www.microsoft.com/wdsi/threats/malware-encyclopedia-description?Name=Backdoor:Win32/MalAgent)<br>– [TrojanSpy:Win64/Hyrax](https://www.microsoft.com/wdsi/threats/malware-encyclopedia-description?Name=TrojanSpy:Win64/Hyrax) <br><br>**[Microsoft Defender for Endpoint](https://www.microsoft.com/security/business/endpoint-security/microsoft-defender-endpoint)** (set to [block mode](https://learn.microsoft.com/defender-endpoint/edr-in-block-mode)) <br>– An active ‘Malagent’ malware was blocked<br>– An active ‘Hyrax’ credential theft malware was blocked <br>– Microsoft Defender for Endpoint VPN launched from unusual location | | Defense evasion | The fake VPN software side-loads malicious DLL files during installation. | **[Microsoft Defender for Endpoint](https://www.microsoft.com/security/business/endpoint-security/microsoft-defender-endpoint)** <br>– An executable file loaded an unexpected DLL file | | Persistence | The *Pulse.exe* malware runs when the device reboots. | **[Microsoft Defender for Endpoint](https://www.microsoft.com/security/business/endpoint-security/microsoft-defender-endpoint)** <br>– Anomaly detected in ASEP registry |\n\n### Microsoft Security Copilot\n\n[Microsoft Security Copilot](https://www.microsoft.com/en-us/security/business/ai-machine-learning/microsoft-security-copilot) is [embedded in Microsoft Defender](https://learn.microsoft.com/defender-xdr/security-copilot-in-microsoft-365-defender) and provides security teams with AI-powered capabilities to summarize incidents, analyze files and scripts, summarize identities, use guided responses, and generate device summaries, hunting queries, and incident reports.\n\n## MICROSOFT SECURITY COPILOT\n\n[Protect at the speed and scale of AI ↗](https://www.microsoft.com/security/business/ai-machine-learning/microsoft-security-copilot)\n\nCustomers can also [deploy AI agents](https://learn.microsoft.com/defender-xdr/security-copilot-agents-defender), including the following [Microsoft Security Copilot agents](https://learn.microsoft.com/copilot/security/agents-overview), to perform security tasks efficiently:\n\n- [Threat Intelligence Briefing agent](https://learn.microsoft.com/defender-xdr/threat-intel-briefing-agent-defender)\n- [Phishing Triage agent](https://learn.microsoft.com/defender-xdr/phishing-triage-agent)\n- [Threat Hunting agent](https://learn.microsoft.com/defender-xdr/advanced-hunting-security-copilot-threat-hunting-agent)\n- [Dynamic Threat Detection agent](https://learn.microsoft.com/defender-xdr/dynamic-threat-detection-agent)\n\nSecurity Copilot is also available as a [standalone experience](https://learn.microsoft.com/en-us/copilot/security/experiences-security-copilot) where customers can perform specific security-related tasks, such as incident investigation, user analysis, and vulnerability impact assessment. In addition, Security Copilot offers [developer scenarios](https://learn.microsoft.com/copilot/security/developer/custom-agent-overview) that allow customers to build, test, publish, and integrate AI agents and plugins to meet unique security needs.\n\n### Threat intelligence reports\n\nMicrosoft Defender XDR customers can use the following [threat analytics](https://learn.microsoft.com/defender-xdr/threat-analytics) reports in the Defender portal (requires license for at least one Defender XDR product) to get the most up-to-date information about the threat actor, malicious activity, and techniques discussed in this blog. These reports provide the intelligence, protection information, and recommended actions to prevent, mitigate, or respond to associated threats found in customer environments.\n\n- [Actor Profile: Storm-2561](https://security.microsoft.com/threatanalytics3/a9b575b6-1705-44b1-93c2-9edad079e864/overview)\n- [Activity Profile: Storm-2561 uses SEO poisoning to distribute fake VPN clients for credential theft](https://security.microsoft.com/threatanalytics3/8978a136-5547-46c3-8ab1-0ca501785126/overview)\n\nMicrosoft Security Copilot customers can also use the [Microsoft Security Copilot integration](https://learn.microsoft.com/defender/threat-intelligence/security-copilot-and-defender-threat-intelligence?bc=%2Fsecurity-copilot%2Fbreadcrumb%2Ftoc.json&amp;toc=%2Fsecurity-copilot%2Ftoc.json#turn-on-the-security-copilot-integration-in-defender-ti) in Microsoft Defender Threat Intelligence, either in the Security Copilot standalone portal or in the [embedded experience](https://learn.microsoft.com/defender/threat-intelligence/using-copilot-threat-intelligence-defender-xdr) in the Microsoft Defender portal to get more information about this threat actor.\n\n### Hunting queries\n\nMicrosoft Defender XDR customers can run the following [advanced hunting](https://learn.microsoft.com/defender-xdr/advanced-hunting-overview) queries to find related activity in their networks:\n\n**Files signed by** ***Taiyuan Lihua Near Information Technology Co., Ltd.***\n\nLook for files signed with *Taiyuan Lihua Near Information Technology Co., Ltd.* signer.\n\n```\n\nlet a = DeviceFileCertificateInfo | where Signer == \"Taiyuan Lihua Near Information Technology Co., Ltd.\" | distinct SHA1; DeviceProcessEvents | where SHA1 in(a) ```\n\n**Identify suspicious DLLs in** ***Pulse Secure* folder**\n\nIdentify launching of malicious DLL files in folders masquerading as Pulse Secure.\n\n```\n\nDeviceImageLoadEvents | where FolderPath contains \"Pulse Secure\" and FolderPath contains \"Program Files\" and (FolderPath contains \"\\\\JUNS\\\\\" or FolderPath contains \"\\\\JAMUI\\\\\") | where FileName has_any(\"inspector.dll\",\"dwmapi.dll\") ```\n\n## Indicators of compromise\n\n| **Indicator** | **Type** | **Description** | | --- | --- | --- | | 57a50a1c04254df3db638e75a64d5dd3b0d6a460829192277e252dc0c157a62f | SHA-256 | ZIP file retrieved from GitHub (*VPN-Client.zip*) | | 862f004679d3b142d9d2c729e78df716aeeda0c7a87a11324742a5a8eda9b557 | SHA-256 | Suspicious MSI file downloaded from the masqueraded Ivanti pulse VPN client domain (*VPN-Client.msi*) | | 6c9ab17a4aff2cdf408815ec120718f19f1a31c13fc5889167065d448a40dfe6 | SHA-256 | Suspicious DLL file loaded by the above executables; also signed by *Taiyuan Lihua Near Information Technology Co., Ltd.* (*dwmapi.dll*) | | 6129d717e4e3a6fb4681463e421a5603b640bc6173fb7ba45a41a881c79415ca | SHA-256 | Malicious DLL that steals data from *C:\\ProgramData\\Pulse Secure\\ConnectionStore\\connstore.dat* and exfiltrating it (*inspector.dll*) | | 44906752f500b61d436411a121cab8d88edf614e1140a2d01474bd587a8d7ba832397697c209953ef0252b95b904893cb07fa975 | SHA-256 | Malware signed by *Taiyuan Lihua Near Information Technology Co., Ltd.* (*Pulse.exe*) | | 85c4837e3337165d24c6690ca63a3274dfaaa03b2ddaca7f1d18b3b169c6aac1 | SHA-256 | Malware signed by *Taiyuan Lihua Near Information Technology Co., Ltd.* (*Sophos-Connect-Client.exe*) | | 98f21b8fa426fc79aa82e28669faac9a9c7fce9b49d75bbec7b60167e21963c9 | SHA-256 | Malware signed by *Taiyuan Lihua Near Information Technology Co., Ltd.* (*GlobalProtect-VPN.exe*) | | cfa4781ebfa5a8d68b233efb723dbde434ca70b2f76ff28127ecf13753bfe011 | SHA-256 | Malware signed by *Taiyuan Lihua Near Information Technology Co., Ltd.* (*VPN-Client.exe*) | | 26db3fd959f12a61d19d102c1a0fb5ee7ae3661fa2b301135cdb686298989179 | SHA-256 | Malware signed by *Taiyuan Lihua Near Information Technology Co., Ltd.* (*vpn.exe*) | | 44906752f500b61d436411a121cab8d88edf614e1140a2d01474bd587a8d7ba8 | SHA-256 | Malware signed by *Taiyuan Lihua Near Information Technology Co., Ltd.* (*Pulse.exe*) | | eb8b81277c80eeb3c094d0a168533b07366e759a8671af8bfbe12d8bc87650c9 | SHA-256 | Malware signed by *Taiyuan Lihua Near Information Technology Co., Ltd.* (*WiredAccessMethod.dll*) | | 8ebe082a4b52ad737f7ed33ccc61024c9f020fd085c7985e9c90dc2008a15adc | SHA-256 | Malware signed by *Taiyuan Lihua Near Information Technology Co., Ltd.*(*PulseSecureService.exe*) | | 194.76.226[.]93 | IP address | IP address where stolen data is sent | | *checkpoint-vpn[.]com* | Domain | Suspect initial access domain | | *cisco-secure-client[.]es* | Domain | Suspect initial access domain | | *forticlient-for-mac[.]com* | Domain | Suspect initial access domain | | *forticlient-vpn[.]de* | Domain | Suspect initial access domain | | *forticlient-vpn[.]fr* | Domain | Suspect initial access domain | | *forticlient-vpn[.]it* | Domain | Suspect initial access domain | | *forticlient[.]ca* | Domain | Suspect initial access domain | | *forticlient.co[.]uk* | Domain | Suspect initial access domain | | *forticlient[.]no* | Domain | Suspect initial access domain | | *fortinet-vpn[.]com* | Domain | Suspect initial access domain | | *ivanti-vpn[.]org* | Domain | Initial access domain (GitHub ZIP) | | *ivanti-secure-access[.]de* | Domain | Suspect initial access domain | | *ivanti-pulsesecure[.]com* | Domain | Suspect initial access domain | | *sonicwall-netextender[.]nl* | Domain | Suspect initial access domain | | *sophos-connect[.]org* | Domain | Suspect initial access domain | | *vpn-fortinet[.]com* | Domain | Initial access domain (GitHub ZIP) | | *watchguard-vpn[.]com* | Domain | Suspect initial access domain | | v*pn-connection[.]pro* | Domain | C2 where stolen credentials are sent | | *myconnection[.]pro* | Domain | C2 where stolen credentials are sent | | *hxxps://github[.]com/latestver/vpn/releases/download/vpn-client2/VPN-CLIENT.zip* | URL | GitHub URL hosting *VPN-CLIENT.zip* file (no longer available) |\n\n### References\n\n- [SEO Poisoning Targets Ivanti VPN: Credential Theft Alert](https://www.zscaler.com/blogs/security-research/spoofed-ivanti-vpn-client-sites) (Zscaler)\n- [Storm-2561 distributes trojanized SonicWall NetExtender SilentRoute](https://security.microsoft.com/threatanalytics3/f07799f3-6612-492a-b3a1-a60e0bc61863) (Microsoft)\n- [A Sting on Bing: Bumblebee delivered through Bing SEO poisoning campaign](https://www.cyjax.com/resources/blog/a-sting-on-bing-bumblebee-delivered-through-bing-seo-poisoning-campaign) (Cyjax)\n\n### Learn more\n\nFor the latest security research from the Microsoft Threat Intelligence community, check out the [Microsoft Threat Intelligence Blog](https://aka.ms/threatintelblog).\n\nTo get notified about new publications and to join discussions on social media, follow us on [LinkedIn](https://www.linkedin.com/showcase/microsoft-threat-intelligence), [X (formerly Twitter)](https://x.com/MsftSecIntel), and [Bluesky](https://bsky.app/profile/threatintel.microsoft.com).\n\nTo hear stories and insights from the Microsoft Threat Intelligence community about the ever-evolving threat landscape, listen to the [Microsoft Threat Intelligence podcast](https://thecyberwire.com/podcasts/microsoft-threat-intelligence).",
  "Link": "https://www.microsoft.com/en-us/security/blog/2026/03/12/storm-2561-uses-seo-poisoning-to-distribute-fake-vpn-clients-for-credential-theft/",
  "FeedUrl": "https://www.microsoft.com/en-us/security/blog/feed/",
  "Description": "Storm-2561 uses SEO poisoning to push fake VPN downloads that install signed trojans and steal VPN credentials. Active since 2025, Storm-2561 mimics trusted brands and abuses legitimate services. This post reviews TTPs, IOCs, and mitigation guidance.\n\nThe post [Storm-2561 uses SEO poisoning to distribute fake VPN clients for credential theft](https://www.microsoft.com/en-us/security/blog/2026/03/12/storm-2561-uses-seo-poisoning-to-distribute-fake-vpn-clients-for-credential-theft/) appeared first on [Microsoft Security Blog](https://www.microsoft.com/en-us/security/blog).",
  "FeedName": "Microsoft Security Blog",
  "Title": "Storm-2561 uses SEO poisoning to distribute fake VPN clients for credential theft"
}
