{
  "Author": "Paul Chapman",
  "PubDate": "2025-11-24T15:00:06+00:00",
  "Description": "Visual Studio will adopt the Modern Support Lifecycle as a continuously updated IDE designed to deliver innovation as soon as it is ready, while maintaining the reliability and stability you count on every day with control over your build tools choices.\n\nThe post [Visual Studio – Built for the Speed of Modern Development](https://devblogs.microsoft.com/visualstudio/visual-studio-built-for-the-speed-of-modern-development/) appeared first on [Visual Studio Blog](https://devblogs.microsoft.com/visualstudio).",
  "FeedUrl": "https://devblogs.microsoft.com/visualstudio/feed/",
  "Link": "https://devblogs.microsoft.com/visualstudio/visual-studio-built-for-the-speed-of-modern-development/",
  "Tags": [
    "Announcement",
    "lifecycle",
    "Support",
    "Visual Studio",
    "Visual Studio 2026"
  ],
  "OutputDir": "_news",
  "FeedLevelAuthor": "Visual Studio Blog",
  "ProcessedDate": "2025-11-24 15:03:08",
  "FeedName": "Microsoft VisualStudio Blog",
  "Title": "Visual Studio – Built for the Speed of Modern Development",
  "EnhancedContent": "The release of Visual Studio 2026 two weeks ago marks the next evolution in Microsoft’s 50-year commitment to deliver the tools that developers love and enterprises trust, built to move at the pace of modern development. Software development is moving faster than ever, and Visual Studio is evolving right along with you.\n\nToday, we’re announcing an important step forward in the lifecycle and release cadence for Visual Studio. Visual Studio will be a continuously updated modern IDE designed to deliver innovation as soon as it is ready, while maintaining the reliability and stability you count on every day. We’ll deliver this through monthly feature updates and a new annual major release.\n\n## Why We’re Modernizing\n\nVisual Studio now innovates at the pace of modern software. Whether you build desktop apps, cloud services, games, web APIs, or AI agents, the IDE will now ship the latest performance and capability improvements every month, with GitHub Copilot experiences always up to date.\n\nWe also heard the request for frictionless updates. Your existing projects, solutions, and extensions continue to work as they do today. We’re maintaining a high compatibility bar across monthly and annual releases, so you stay productive while the IDE evolves in place and your builds remain stable.\n\nBecause the IDE is decoupled from the build tools, these changes do not require you to modify existing projects or rebuild working applications. Visual Studio updates monthly, but your .NET or C++ compiler build tools, runtimes, and extensions continue to work exactly as before. Build tools and SDKs have their own multi-year lifecycles, so your build environment remains stable even as the IDE gets new features.\n\n## Built for Modern Development\n\nSince Visual Studio 2017, we have been steadily increasing our release cadence, delivering quarterly feature updates, servicing releases, and flexible build tools choices. With Visual Studio 2026, we are taking the next step, moving to a [modern support lifecycle](https://learn.microsoft.com/lifecycle/faq/modern-policy) that keeps you on the latest tools and features automatically.\n\nThis new approach means:\n\n- Feature [updates every month](https://learn.microsoft.com/visualstudio/releases/2026/release-rhythm), not every quarter.\n- A new annual version each year, released in November alongside the .NET release.\n- Predictable servicing and support under the [Modern Support Lifecycle](https://learn.microsoft.com/lifecycle/faq/modern-policy), with one year of monthly feature updates followed by one year of security fixes.\n- Update to the latest release to remain supported and serviced with new features, fixes, and security updates.\n\nIt is all about giving you updates as soon as they are ready.\n\n## Build Tools Freedom – You Are in Control\n\nWith these changes to how Visual Studio is updated and supported, it’s equally important to understand how build tools and components fit into this new model.\n\nWe know every team moves at its own pace. Visual Studio continues to carry a wide range of build tools and components to target the platforms you’ve come to expect. With multiple supported versions of these build tools included, you can choose when to move your projects forward. You can adopt the latest compiler, runtime, or SDK on your schedule while still benefiting from IDE improvements and AI features each month.\n\nThese build tools, SDKs, and runtimes are available under their own support lifecycles. For example, modern [.NET releases every year](https://learn.microsoft.com/lifecycle/faq/dotnet-core), with Standard Term Support (STS) for 2 years and Long-Term Support (LTS) support for 3 years. The lifecycle for [.NET Framework is tied to the Windows release](https://learn.microsoft.com/lifecycle/faq/dotnet-framework) in which it ships.\n\nFor C++ developers, we are also decoupling the Microsoft C++ (MSVC) compilers and Build Tools from the Visual Studio lifecycle. This lets the compiler team ship faster, more agile updates every six months, with long-term supported versions every 2 years. For more details, see [today’s blog post on the new MSVC lifecycle](http://aka.ms/msvc/servicing).\n\n## Insiders and Stable Channels\n\nTo support this faster cadence, starting with Visual Studio 2026 two channels are available:\n\n- **Insiders Channel** – Try upcoming features first, share feedback, and help shape what is next. To install go to [https://visualstudio.microsoft.com/insiders/](https://visualstudio.microsoft.com/insiders/). (Insiders replaces the “Preview” Channel previously available.)\n- **Stable Channel** – Get validated, production-ready features every month. To install, go to [https://visualstudio.microsoft.com/downloads/](https://visualstudio.microsoft.com/downloads/). (Stable replaces the “Current” Channel previously available.)\n\nFeatures that appear in the Insiders Channel will roll into the Stable Channel when they’re ready for broad adoption. If you are on Stable, you will receive a monthly feature update and servicing releases as needed. (For more information, see [Visual Studio Channels and Release Rhythm](https://learn.microsoft.com/visualstudio/releases/2026/release-rhythm) and [Visual Studio Product Lifecycle and Servicing](https://learn.microsoft.com/visualstudio/releases/2026/servicing-vs).)\n\nEach year, the IDE will update to the next annual version, for example next November, Visual Studio 2026 will update in place to Visual Studio 2027, with no disruption to your environment.\n\nOur enterprise customers at times need more flexibility in when they schedule updates. To ensure they are fully supported, we’ll also offer a side-by-side **Long-Term-Servicing Channel (LTSC)** for the prior annual release. The LTSC provides security servicing for 1 year. For example, in November of 2026, [you will be able to choose to switch to](https://learn.microsoft.com/visualstudio/install/update-visual-studio?view=visualstudio&amp;preserve-view=true#configure-source-location-of-updates-2) the Visual Studio 2026 LTS Channel to remain on a static feature set for an additional year.\n\nHowever, it’s important to note that Visual Studio LTSC is not necessary to maintain your project in a known state. If your project uses .NET 10 or MSVC 14.50 that ship with Visual Studio 2026, when you update to Visual Studio 2027 those build tools will still be available, and your projects should just build as before.\n\n## Flexible Licensing and Registration\n\nThese changes for Visual Studio result in a shift in how we handle product registration. There are no changes to Visual Studio Community, it remains free for open-source projects, education, and small organizations. (See [the license for details](https://aka.ms/VisualStudioLicenses).)\n\nFor the **Professional and Enterprise** editions, if you have a Visual Studio Subscription, there’s no change to the registration process. You will continue signing in as before and automatically receive updates through the modern lifecycle or obtain your product key from the [Visual Studio Subscribers portal](https://my.visualstudio.com). If you use a stand-alone Professional license, you simply purchase the new annual version each year. Product keys will continue to work for that annual version, and new keys will unlock the next year’s release.\n\nAdditionally, there are no changes to the lifecycle for [Visual Studio 2022](https://learn.microsoft.com/lifecycle/products/visual-studio-2022), [Visual Studio 2019](https://learn.microsoft.com/lifecycle/products/visual-studio-2019), and [Visual Studio 2017](https://learn.microsoft.com/lifecycle/products/visual-studio-2017).\n\n## Always Current, Always Ready\n\nVisual Studio 2026 marks the start of a new era, an IDE that is modern, intelligent, and continuously improving. You will spend less time waiting for updates and more time building great software with the latest tools.\n\nWe are excited for you to experience this new cadence, share your feedback, and help shape the future of Visual Studio. The journey continues, and Visual Studio will be right there with you, every month, every release."
}
