{
  "Description": "If you use editor productivity extensions for Visual Studio 2026, there’s good news—they can now load faster! Extension developers with existing MEF-based editor productivity extensions should read this blog to learn about recent changes and how they might be affected. We introduced VisualStudio.Extensibility to simplify the creation of Visual Studio extensions for developers. Previously, handling threads in VSSDK-based extensions […]\n\nThe post [Performance improvements to MEF-based editor productivity extensions](https://devblogs.microsoft.com/visualstudio/performance-improvements-to-mef-based-editor-productivity-extensions/) appeared first on [Visual Studio Blog](https://devblogs.microsoft.com/visualstudio).",
  "FeedUrl": "https://devblogs.microsoft.com/visualstudio/feed/",
  "Link": "https://devblogs.microsoft.com/visualstudio/performance-improvements-to-mef-based-editor-productivity-extensions/",
  "ProcessedDate": "2026-02-03 15:13:49",
  "Author": "Tina Schrepfer (LI), Amadeus Wieczorek",
  "FeedLevelAuthor": "Visual Studio Blog",
  "FeedName": "Microsoft VisualStudio Blog",
  "OutputDir": "_news",
  "PubDate": "2026-02-03T15:00:21+00:00",
  "EnhancedContent": "If you use editor productivity extensions for Visual Studio 2026, there’s good news—they can now load faster! Extension developers with existing MEF-based editor productivity extensions should read this blog to learn about recent changes and how they might be affected.\n\nWe introduced [VisualStudio.Extensibility](https://aka.ms/VisualStudio.Extensibility) to simplify the creation of Visual Studio extensions for developers. Previously, handling [threads](https://learn.microsoft.com/en-us/visualstudio/extensibility/visualstudio.extensibility/extensibility-models?view=vs-2022#ui-thread-versus-background-thread) in VSSDK-based extensions was often difficult, requiring knowledge of thread affinity and even the ins and outs of COM just to avoid freezing Visual Studio. The new extensibility model abstracts these technical details away seamlessly.\n\nDespite this advancement, we recognize most Visual Studio extensions still use VSSDK, so we’re striving to make targeted improvements there as well – especially regarding performance. For Visual Studio 2026, we’ve added the ability to load MEF-based editor extensions on a background thread, which significantly speeds up startup times for users. A major highlight of Visual Studio 2026 is its improved performance, and the proposed change we’re making to MEF is just one of many enhancements planned to make it even faster. We hope you’ll be pleased with the results.\n\n## What changed?\n\nVisual Studio editor components use the [Managed Extensibility Framework (MEF)](https://learn.microsoft.com/en-us/dotnet/framework/mef/), which requires that objects be constructed in a free-threaded manner. Despite official MEF guidelines, we’ve often loaded components on the UI thread, resulting in many extensions relying on this behavior and limiting our ability to enhance startup performance.\n\nWith Visual Studio 2026, we’re shifting to a free-threaded model, loading MEF components on background threads. This means extensions with UI thread dependencies might fail to load. We’ve been rigorously testing this approach in recent Visual Studio 2022 updates, and we are aware that some extensions that expect to load on the UI thread will fail to load with this optimization. To support extension developers through this transition, we’ve provided a setting and an analyzer that allows you to experiment with background loading and detect if your extension could be impacted by this change before we push it out more broadly. This initiative reflects our commitment to reducing disruptive changes and help extenders adapt when updates are necessary for the overall improvement of the product.\n\n## Does it impact my extension?\n\nTo help extension developers better detect if this change impacts you, we created an analyzer to identify potential issues. We hope that this will give you the opportunity to bring your extension in compliance with MEF rules, so that your extension can also get a startup performance boost like the rest of Visual Studio 2026.\n\nThe example below shows the analyzer running and reporting access to the `Microsoft.VisualStudio.Shell.ThreadHelper` and `DTE2.StatusBar` require UI thread.\n\n[![Picture1 image](data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAA6gAAAHmAQMAAABEQjFeAAAAA1BMVEXW1taWrGEgAAAACXBIWXMAAA7EAAAOxAGVKw4bAAAATklEQVR4nO3BMQEAAADCoPVPbQlPoAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAADgY+AEAAFY3RnDAAAAAElFTkSuQmCC)](https://devblogs.microsoft.com/visualstudio/wp-content/uploads/sites/4/2026/02/Picture1.webp)\n\nTo use the analyzer, add a reference to the latest version of the [Microsoft.VisualStudio.SDK.Analyzers](https://www.nuget.org/packages/microsoft.visualstudio.sdk.analyzers) package:\n\n`<PackageReference Include=\"Microsoft.VisualStudio.SDK.Analyzers\" Version=\"17.7.98\" PrivateAssets=\"all\" />`\n\nTo validate your extension can adapt to this change, enable the Preview Feature flag “Initialize editor parts asynchronously during solution load”.\n\n[![Picture2 image](data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAA5YAAABpAQMAAAB76S5sAAAAA1BMVEXW1taWrGEgAAAACXBIWXMAAA7EAAAOxAGVKw4bAAAAI0lEQVRoge3BMQEAAADCoPVPbQdvoAAAAAAAAAAAAAAAgMcAL5QAAX5D6WIAAAAASUVORK5CYII=)](https://devblogs.microsoft.com/visualstudio/wp-content/uploads/sites/4/2026/02/Picture2.webp)\n\nWhen debugging, you may set a breakpoint in MEF part constructors and evaluate `System.Threading.Thread.CurrentThread.ManagedThreadId` . If it’s different than `1` , then your code executes on the background thread.\n\n[![Picture3 image](data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAA6gAAAIHAQMAAACosuPkAAAAA1BMVEXW1taWrGEgAAAACXBIWXMAAA7EAAAOxAGVKw4bAAAAUklEQVR4nO3BMQEAAADCoPVPbQo/oAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAA+BrvOgABKqRXIwAAAABJRU5ErkJggg==)](https://devblogs.microsoft.com/visualstudio/wp-content/uploads/sites/4/2026/02/Picture3.webp)\n\n## Call to action\n\nLoading MEF parts on a background thread is essential for improving Visual Studio’s performance, and we have gradually enabled this change in Visual Studio 2026. We recognize that code changes can be inconvenient, so we’ve made it straightforward to spot and resolve any issues. To see examples of removing UI thread affinity, please see our [documentation](https://github.com/microsoft/VSSDK-Analyzers/blob/f0823e48d7a43cc84dc0eb3ce622cc149451854b/doc/VSSDK008.md) or a sample [PR](https://github.com/dotnet/razor/pull/10593) on how we made this change ourselves.\n\n## We want to hear from you!\n\nThank you for sharing your issues and suggestions with us, and we hope you’ll keep providing feedback about what you like and what we can improve in Visual Studio. For those new and experienced to extending Visual Studio, we invite you to visit our [documentation](https://aka.ms/VisualStudio.Extensibility) to learn more, or watch the [video series](https://aka.ms/vsextensibilityseries) on Visual Studio Toolbox where Visual Studio engineers take you through how to build extensions using our [samples](https://aka.ms/VisualStudio.Extensibility/Samples) on GitHub. Feel free to share feedback with us via [Developer Community](https://developercommunity.visualstudio.com/home%22%20/t%20%22_blank): report any bugs or issues via [report a problem](https://learn.microsoft.com/en-us/visualstudio/ide/how-to-report-a-problem-with-visual-studio?view=visualstudio) and [share your suggestions](https://developercommunity.microsoft.com/VisualStudio/suggest) for new features or improvements to existing ones. If you want a closer engagement with other partners in the ecosystem, please visit our GitHub repo to report [issues](https://github.com/microsoft/VSExtensibility/issues) as well.\n\nStay connected with the Visual Studio team by following us on [YouTube](https://www.youtube.com/@visualstudio), [Twitter](https://twitter.com/VisualStudio), [LinkedIn](https://www.linkedin.com/showcase/microsoft-visual-studio/), [Twitch](https://www.twitch.tv/visualstudio) and on [Microsoft Learn](https://learn.microsoft.com/en-us/visualstudio/?view=vs-2022).",
  "Title": "Performance improvements to MEF-based editor productivity extensions",
  "Tags": [
    "Extensibility",
    "Extensions",
    "Performance",
    "Visual Studio"
  ]
}
