{
  "PubDate": "2026-01-27T18:30:12+00:00",
  "Link": "https://devblogs.microsoft.com/visualstudio/visual-studio-january-update-enhanced-editor-experience/",
  "FeedLevelAuthor": "Visual Studio Blog",
  "FeedUrl": "https://devblogs.microsoft.com/visualstudio/feed/",
  "ProcessedDate": "2026-01-27 19:08:04",
  "Description": "Productivity Improvements This month, we are bringing you a series of small yet long requested and popular features to let you better control and customize your editor. Fast scrolling: Hold down the Alt key while scrolling the mouse wheel to move quickly when reviewing code or reading documentation. You can adjust the fast-scrolling speed in […]\n\nThe post [Visual Studio January Update — Enhanced Editor Experience](https://devblogs.microsoft.com/visualstudio/visual-studio-january-update-enhanced-editor-experience/) appeared first on [Visual Studio Blog](https://devblogs.microsoft.com/visualstudio).",
  "OutputDir": "_news",
  "Title": "Visual Studio January Update — Enhanced Editor Experience",
  "FeedName": "Microsoft VisualStudio Blog",
  "EnhancedContent": "### [![Summary of VS January updates](data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAACcQAAAV+AQMAAABoTD0ZAAAAA1BMVEXW1taWrGEgAAAACXBIWXMAAA7EAAAOxAGVKw4bAAABw0lEQVR4nO3BMQEAAADCoPVPbQZ/oAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAACAxwC85gABaULoSAAAAABJRU5ErkJggg==)](https://devblogs.microsoft.com/visualstudio/wp-content/uploads/sites/4/2026/01/VS-Jan-update-scaled.webp)\n\n### Productivity Improvements\n\nThis month, we are bringing you a series of small yet long requested and popular features to let you better control and customize your editor.\n\n- Fast scrolling: Hold down the `Alt`\nkey while scrolling the mouse wheel to move quickly when reviewing code or reading documentation. You can adjust the fast-scrolling speed in Tools &gt; Options &gt; **Text Editor &gt; Advanced &gt; Touchpad and mouse wheel scrolling sensitivity**.\n- Middle click scroll: Press down on your scroll wheel and move the mouse to quickly scroll through your document, making it easier to explore large files. This feature is off by default in 18.3 Insiders 2 and needs to be enabled via Tools &gt; Options &gt; **Text Editor &gt; Advanced &gt; Middle click to scroll**.\n- HTML-rich copy paste: Visual Studio now supports HTML clipboard format when cutting or copying code from the editor. You can paste colorized code into web versions of Office apps, Azure DevOps work items, or other HTML-based controls. This feature is available in the latest Insiders and will be shipped in the Release channel soon.\n- Syntactic line compression: Lines without letters or numbers are compressed by 25%, letting you see more code at once. Regular lines stay the same height. Enable this feature in Tools &gt; Options &gt; **Text Editor &gt; Advanced** by checking **Compress blank lines** and **Compress lines that do not have any alphanumeric characters**.\n- Slimmer left margin: We’ve heard you that you would like to see a slimmer left margin to have more horizontal space for your code! To save an extra column, we moved the Quick Actions icon (lightbulb or screwdriver) from the margin into the editor, where it appears inline with your code when fixes or refactoring are available. To try out the experience now, go to Tools &gt; Options &gt; **Text Editor &gt; Advanced** and check **Show Quick Actions icon inside the editor*****.*** We also have more customized margin controls coming, so stay tuned!\n\n### Colorized Code Completions\n\nCode completions are now colorized with syntax highlighting to help you quickly parse suggested code between variables, functions, and other elements! To try out this experience, go to Tools &gt; Options &gt; **Text Editor &gt; Code Completions** and check “**Use colorized text for code completions.**”\n\nTo differentiate suggestions from actual code, colorized completions use lower opacity and italic styling. If you want to further customize the look, go to Tools &gt; Options &gt; **Environment &gt; Fonts and Colors** and select “Code Completions” from the Display items list. From there, you can customize the font, size, foreground/background colors, and styles (bold, italicized…).\n\n### Click to Accept Code Completions Partially\n\nHave you ever wanted to accept a code completion partially with a single click? With this new feature, you can click directly inside a suggestion to accept it up to the cursor position. As you hover over the suggestion, each segment highlights to show exactly what will be accepted.\n\n[![Using mouse clicks to partially accept a suggestion](data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAyAAAAGZAQMAAABL5Me/AAAAA1BMVEXW1taWrGEgAAAACXBIWXMAAA7EAAAOxAGVKw4bAAAAP0lEQVR4nO3BgQAAAADDoPlT3+AEVQEAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAcA6FdAAE4h6pGAAAAAElFTkSuQmCC)](https://devblogs.microsoft.com/visualstudio/wp-content/uploads/sites/4/2026/01/ClickToAccept.gif)\n\nThis feature gives you more control over how much of a completion you want to accept. If you prefer using the keyboard, you can still press `Ctrl`\n+ `Right Arrow`\nto accept one word at a time, or `Ctrl`\n+ `Down Arrow`\nto accept one line at a time.\n\n### Streamlined Markdown Preview Controls\n\nVisual Studio Markdown editor now gives you faster, clearer access to preview options:\n\n- Switch between preview modes: **Split Preview** shows the editor and preview side by side, **Open Preview** shows only the preview, and **Edit Markdown** shows just the editor. The preview-only mode helps you focus on rendered content, especially for large images or complex Mermaid diagrams.\n- When previewing a Mermaid diagram, use the zoom controls in the top-left corner to zoom in or out for better readability.\n- When Copilot Chat generates markdown content, click the **Preview** button at the top right corner of the chat window to see a rendered view. You can then edit and save the content directly. No need to copy and paste manually.\n\nTo try all this latest goodness, please update your Visual Studio regularly and join us in the [Insiders Channel](https://visualstudio.microsoft.com/insiders/) if you haven’t yet! (Note: All features shared in this blog post are available in Visual Studio 2026 only.) Please give them a try and let us know any feedback you have or the next thing you would like to see!",
  "Tags": [
    "Developer Productivity",
    "Editor",
    "GitHub Copilot",
    "Productivity"
  ],
  "Author": "Simona Liao"
}
