{
  "OutputDir": "_news",
  "FeedUrl": "https://devblogs.microsoft.com/visualstudio/feed/",
  "Description": "I always enjoy the quiet stretch between Christmas and New Year’s. It’s one of the few moments in the year when things slow down just enough to reflect on what actually resonated. While many of us were unplugging, our digital team was doing the opposite, editing and publishing 19 sessions from VS Live! Orlando to […]\n\nThe post [Welcome to 2026, A Growth Year for All of Us](https://devblogs.microsoft.com/visualstudio/vs-live-2026-immersive-learning-for-vs2026/) appeared first on [Visual Studio Blog](https://devblogs.microsoft.com/visualstudio).",
  "FeedName": "Microsoft VisualStudio Blog",
  "Author": "Jim Harrer",
  "Title": "Welcome to 2026, A Growth Year for All of Us",
  "Tags": [
    "Events",
    "Training",
    "Visual Studio",
    "Visual Studio 2026",
    "vslive"
  ],
  "FeedLevelAuthor": "Visual Studio Blog",
  "Link": "https://devblogs.microsoft.com/visualstudio/vs-live-2026-immersive-learning-for-vs2026/",
  "ProcessedDate": "2026-01-05 15:02:39",
  "PubDate": "2026-01-05T14:29:43+00:00",
  "EnhancedContent": "I always enjoy the quiet stretch between Christmas and New Year’s. It’s one of the few moments in the year when things slow down just enough to reflect on what actually resonated.\n\nWhile many of us were unplugging, our digital team was doing the opposite, editing and publishing 19 sessions from VS Live! Orlando to the [Visual Studio YouTube channel](https://youtube.com/playlist?list=PLReL099Y5nRcrdj7sPw2ln9VXOmxy2F8P&amp;si=RI49bFM5_cQ7dThb). What surprised me wasn’t just the pace at which those sessions went live, it was what happened next.\n\nDuring the holidays alone, those sessions were viewed nearly 30,000 times.\n\nThat tells me two things. First, learning doesn’t stop just because the calendar does. Second, developers are being very intentional about what they choose to spend time on.\n\n[![VS YouTube Header image](data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAyAAAADIAQMAAAAqQRdZAAAAA1BMVEXW1taWrGEgAAAACXBIWXMAAA7EAAAOxAGVKw4bAAAAKklEQVR4nO3BMQEAAADCoPVPbQlPoAAAAAAAAAAAAAAAAAAAAAAAAADgZ07oAAFuUb5aAAAAAElFTkSuQmCC)](https://youtube.com/playlist?list=PLReL099Y5nRcrdj7sPw2ln9VXOmxy2F8P&amp;si=RI49bFM5_cQ7dThb)\n\nWhat’s even more interesting is where that attention went. The most watched Orlando sessions clustered around a few clear themes, and these six titles consistently rose to the top:\n\n- [The Road to Visual Studio 2026: Building a Faster, Smarter IDE](https://youtu.be/uX67Il4hQBs)\n- [C# Source Generators, Why They Matter and How to Use Them](https://youtu.be/CLTSkEr3wmQ)\n- [Next-Level Debugging with GitHub Copilot in Visual Studio](https://youtu.be/iFjQghRbJUw)\n- [Aspire, Beyond the Basics](https://youtu.be/rZQbhDfj7ek)\n- [The Forgotten Features of Visual Studio You NEED In Your Life!](https://youtu.be/IefZzruStwI)\n- [Fast Focus: Caching Options in .NET](https://youtu.be/PqvvlmUA7IU)\n\nThese aren’t casual topics. They reflect developers looking for leverage, better tooling, and smarter ways to work as the stack continues to evolve at a rapid pace.\n\nWhen I step back and look at those sessions together, a clear story emerges, and it’s one worth paying attention to as we head into 2026.\n\n## From Watching to Immersion, Where Real Growth Happens\n\nThere’s real value in learning on your own time. Sitting in a quiet space, pausing a session, trying something locally, rewinding, and revisiting it later all matter. That’s exactly why we publish VS Live! sessions and why so many of you spent time with them over the holidays.\n\nBut watching is only the first step.\n\nWhat Orlando reinforced for me is how different the experience becomes when learning turns immersive. When you step away from daily interruptions, your laptop is open, you’re building real things, and the person teaching the session is standing right there answering questions as they come up. When a conversation that starts in a session continues in the hallway, over lunch, or later that evening, until it finally clicks.\n\nThat’s what developers consistently tell us they value most about the [VS Live! events](https://aka.ms/VSLiveEvents) held in Las Vegas NV (March), Redmond WA (July), San Diego CA (Sept) and wrapping up in Orlando FL (Nov).\n\nIt’s not just the volume of content. It’s the depth. The chance to spend five or six days fully focused on improving how you work, surrounded by people solving the same problems, guided by engineers and practitioners who do this for a living. It’s scenario-based learning, not feature tours. It’s practical guidance you can take straight back to your team.\n\nThis kind of immersion matters even more now. AI-assisted workflows, modern .NET architectures, cloud-native patterns, and evolving tooling aren’t things most teams can absorb piecemeal. They require time, context, and space to experiment, ask questions, and pressure-test ideas before rolling them out more broadly.\n\nThat’s the difference between picking up an idea and building confidence. And confidence is what turns learning into action.\n\n| [![DMA 0800 image](data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAACcQAAAaDAQMAAADwqC1DAAAAA1BMVEXW1taWrGEgAAAACXBIWXMAAA7EAAAOxAGVKw4bAAACEklEQVR4nO3BAQ0AAADCoPdPbQ8HFAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAwKMB/RcAAbzj3mMAAAAASUVORK5CYII=)](https://devblogs.microsoft.com/visualstudio/wp-content/uploads/sites/4/2026/01/DMA_0800-scaled.webp) | [![DMA 3968 image](data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAACcQAAAaDAQMAAADwqC1DAAAAA1BMVEXW1taWrGEgAAAACXBIWXMAAA7EAAAOxAGVKw4bAAACEklEQVR4nO3BAQ0AAADCoPdPbQ8HFAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAwKMB/RcAAbzj3mMAAAAASUVORK5CYII=)](https://devblogs.microsoft.com/visualstudio/wp-content/uploads/sites/4/2026/01/DMA_3968-scaled.webp) | [![DMA 1346 image](data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAACcQAAAaCAQMAAAA79P7mAAAAA1BMVEXW1taWrGEgAAAACXBIWXMAAA7EAAAOxAGVKw4bAAACEklEQVR4nO3BMQEAAADCoPVPbQ0PoAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAgGcD+90AAYrw1L4AAAAASUVORK5CYII=)](https://devblogs.microsoft.com/visualstudio/wp-content/uploads/sites/4/2026/01/DMA_1346-scaled.webp) | [![DMA 6329 image](data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAACcQAAAaDAQMAAADwqC1DAAAAA1BMVEXW1taWrGEgAAAACXBIWXMAAA7EAAAOxAGVKw4bAAACEklEQVR4nO3BAQ0AAADCoPdPbQ8HFAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAwKMB/RcAAbzj3mMAAAAASUVORK5CYII=)](https://devblogs.microsoft.com/visualstudio/wp-content/uploads/sites/4/2026/01/DMA_6329-scaled.webp) | | --- | --- | --- | --- |\n\n## Immersion That Changes How You Work\n\nOne of the reasons VS Live! continues to resonate is the format. This isn’t a conference where you sit back and passively listen all week.\n\nThe week is intentionally structured to let you immerse yourself in the technology, and just as intentionally, these events are kept **small**. We cap attendance, often around **500 developers or fewer**, on purpose. That size changes everything.\n\nOn Monday and Friday, we run full-day, instructor-led, hands-on labs. Laptops open. Real code. Real scenarios. You follow along step by step, and when something doesn’t make sense, you don’t wait until later. You raise your hand and ask. The speaker is right there, and the conversation happens in the moment. In a smaller room, that kind of interaction is natural, not intimidating. Many attendees tell us these days alone are worth the trip because they leave with working code and a much deeper understanding of how to apply what they learned back at work.\n\nTuesday through Thursday shift into a fast-paced mix of deep technical sessions across Visual Studio, .NET, Azure, GitHub, AI-assisted development, cloud-native architecture, data, security, and DevOps. Because sessions aren’t packed wall to wall, it’s easy to engage. Questions get answered. Discussions go deeper. You’re not fighting for attention in a sea of thousands.\n\nThat smaller scale carries through the entire week. Speakers don’t disappear after their session. They stay. Conversations continue in the hallway, at lunch tables, and during evening events. Many attendees tell us they head home with every question they brought fully answered, something that’s hard to achieve at much larger conferences.\n\n## Choosing Your Immersion, Las Vegas or Redmond\n\nIn 2026, there are two distinct ways to experience that immersion.\n\n[**VS Live! Las Vegas 2026 (March 16–20, 2026)**](https://vslive.com/events/las-vegas-2026/home.aspx) Las Vegas is designed to be accessible and high-energy. It’s easy to get to from almost anywhere, which makes it an excellent option for individuals and teams alike. The week combines full-day, hands-on labs on Monday and Friday with deep technical sessions Tuesday through Thursday.\n\nIt’s an environment built for momentum. You step away from daily delivery pressure, immerse yourself in learning, ask questions in real time, and head home with practical guidance you can put into motion immediately.\n\n[**VS Live! at Microsoft HQ 2026 (July 27–31, 2026)**](https://vslive.com/events/microsofthq-2026/home.aspx) Redmond offers a different kind of immersion. Being on campus changes the experience in meaningful ways. In addition to the same hands-on labs and deep technical sessions, attendees have opportunities to participate in direct conversations with product managers from many of the Azure services they use every day.\n\nThere’s also the Meet the Visual Studio PM Team networking event, where you can talk directly with the people who drive features, priorities, and roadmap decisions inside Visual Studio. These conversations go beyond documentation and demos. They provide context, insight, and a clearer understanding of why things work the way they do and where they’re headed next.\n\nBoth events are built around the same core idea, creating space for developers to fully immerse themselves in the technology, learn directly from experts, and return to work better equipped to lead technical change.\n\n## This Is the Year to Join Us, and Here’s the Incentive\n\nThis is the year to experience VS Live! in person. If Las Vegas or Redmond is on your radar, now is the time to plan, [secure budget approval,](https://vslive.com/events/microsofthq-2026/information/sell-your-boss.aspx) and commit to the experience.\n\nVisual Studio subscribers unlock exclusive pricing through [**my.visualstudio.com**](https://aka.ms/myvs). Simply sign in with your subscriber ID, navigate to **Benefits | Professional Development**, and grab the **Priority Code** from the Visual Studio Live! Events tile to save **up to $900 on registration**.\n\nNot a subscriber? No problem.\n\nAs a reader of the Visual Studio Blog, you can use **Priority Code `VSLMS`** at checkout to save **up to $600 off registration** for [**VS Live! Las Vegas**](https://vslive.com/events/las-vegas-2026/home.aspx) or **[VS Live! at Microsoft HQ](https://vslive.com/events/microsofthq-2026/home.aspx)** in Redmond.\n\nBoth events offer a full week of deep technical learning, hands-on labs on Monday and Friday, and dozens of expert-led sessions Tuesday through Thursday. You’ll also have the opportunity to connect directly with the engineers and product managers behind Visual Studio, .NET, Azure, and GitHub Copilot.\n\nLas Vegas is easy to get to and ideal for teams looking to immerse themselves in a high-energy learning environment. Redmond offers something uniquely different, direct access to Microsoft product teams, Azure PM conversations, and the opportunity to meet the Visual Studio team on campus.\n\nWhether you’re a long-time Visual Studio subscriber or just starting to explore GitHub Copilot, AI-assisted development, and modern .NET, this is your chance to spend a week learning deeply, asking real questions, and bringing practical guidance back to your team.\n\n## See You in 2026\n\nThe technology we use to build software is evolving faster than ever. Keeping up isn’t about watching more videos, it’s about creating space to learn deeply, ask better questions, and bring proven ideas back to your team.\n\nVS Live! is designed for exactly that. It’s a week to step away from the noise, immerse yourself in hands-on learning, and spend time with the engineers and product managers who build the tools you rely on every day.\n\nThis is the year to do it in person.\n\nOne Orlando attendee summed it up perfectly in the post-conference survey:\n\n> >\n> **“This is the best conference if you want to learn things you can actually use when you get back to the office.”**\n> >\n\nI hope you’ll join us in Las Vegas or Redmond and make 2026 a true growth year, for you and for your team.\n\n…Jim"
}
