{
  "EnhancedContent": "This month’s Visual Studio update continues our focus on helping you move faster and stay in flow, with practical improvements across AI assistance, debugging, testing, and modernization. Building on the momentum from January’s editor updates, the February release brings smarter diagnostics and targeted support for real world development scenarios, from WinForms maintenance to C++ modernization.\n\nAll of the features highlighted are available in the Visual Studio 2026 Stable Channel as part of the February 2026 feature update (18.3). Please update to the latest version to try out these new features!\n\n### WinForms Expert Agent\n\nThe WinForms Expert agent provides a focused guide for handling key challenges in WinForms development. It covers several important areas: Designer vs. regular code: Understand which C# features apply to designer-generated code and business logic.\n\n- Modern .NET patterns: Updated for .NET 8-10, including MVVM with Community Toolkit, async/await with proper InvokeAsync overloads, Dark mode with high-DPI support, and nullable reference types.\n- Layout: Advice on using TableLayoutPanel and FlowLayoutPanel for responsive, cross-device design.\n- CodeDOM serialization: Rules for property serialization and avoiding common issues with [DefaultValue] and ShouldSerialize\\*() methods.\n- Exception handling: Patterns for async event handlers and robust application-level error handling.\n\nThe agent serves as an expert reviewer for your WinForms code, providing comprehensive guidance on everything from naming controls to ensuring accessibility. The WinForms Agent is automatically implemented and included in the system prompt when necessary.\n\n### Smarter Test Generation with GitHub Copilot\n\nVisual Studio now includes intelligent [test generation with GitHub Copilot](https://devblogs.microsoft.com/dotnet/github-copilot-testing-for-dotnet-available-in-visual-studio/), making it faster to create and refine unit tests for your C# code. This purpose-built workflow works seamlessly with xUnit, NUnit, and MSTest.\n\n[![GitHub Copilot Chat pane in Visual Studio showing a new chat thread. The Copilot Chat welcome screen appears with a message about checking accuracy, a prompt asking ‘generate tests for my entire solution,’ and the selected model labeled Claude Haiku 4.5. The input box includes a reference button and test generation command.](data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAATwAAAGaAQMAAACojm22AAAAA1BMVEXW1taWrGEgAAAACXBIWXMAAA7EAAAOxAGVKw4bAAAAJ0lEQVR4nO3BgQAAAADDoPlTX+EAVQEAAAAAAAAAAAAAAAAAAADwGUGqAAHlcQhfAAAAAElFTkSuQmCC)](https://devblogs.microsoft.com/visualstudio/wp-content/uploads/sites/4/2026/02/prompt-image-intro.webp)\n\nSimply type `@Test` in GitHub Copilot Chat, describe what you want to test, and Copilot generates the test code for you. Whether you’re starting fresh or improving coverage on existing projects, this feature helps you write tests faster without leaving your workflow.\n\n### Slash Commands for Custom Prompts\n\nInvoke your favorite custom prompts faster using slash commands in Copilot Chat. Type `/` and your custom prompts appear at the top of the list, marked with a bookmark icon for easy identification.\n\n[![Copilot Chat slash command menu in Visual Studio showing available commands such as quality check, clear, explain, fix, and generate, with Agent mode enabled and Claude Sonnet 4.5 selected in the chat input area.](data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAkAAAAF1AQMAAAA6C8f2AAAAA1BMVEXW1taWrGEgAAAACXBIWXMAAA7EAAAOxAGVKw4bAAAAMUlEQVR4nO3BMQEAAADCoPVPbQ0PoAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAuDFqXQABSRPX5wAAAABJRU5ErkJggg==)](https://devblogs.microsoft.com/visualstudio/wp-content/uploads/sites/4/2026/02/slash-commands.webp)\n\nWe’ve also added two additional commands:\n\n– `/generateInstructions` : Automatically generate a copilot-instructions.md file for your repository using project context like coding style and preferences\n\n– `/savePrompt` : Extract a reusable prompt from your current chat thread and save it for later use via `/` commands\n\nThese shortcuts make it easier to build and reuse your workflow patterns.\n\n### C++ App Modernization\n\n[GitHub Copilot app modernization for C++](https://devblogs.microsoft.com/cppblog/github-copilot-app-modernization-cpp-public-preview/) is now available in Public Preview. GitHub Copilot app modernization for C++ helps you update your C++ projects to use the latest versions of MSVC and to resolve upgrade-related issues. You can find our [user documentation on Microsoft Learn](https://learn.microsoft.com/cpp/porting/copilot-app-modernization-cpp?view=msvc-170).\n\n[![Split view in Visual Studio showing a Markdown file on the left and a rendered preview on the right with an Executive Summary and Key Findings for an MSVC Build Tools upgrade including errors and warnings.](data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAABZQAAAITAQMAAACqjwucAAAAA1BMVEXW1taWrGEgAAAACXBIWXMAAA7EAAAOxAGVKw4bAAAAc0lEQVR4nO3BMQEAAADCoPVPbQwfoAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAA4GN1awABxzMjKwAAAABJRU5ErkJggg==)](https://devblogs.microsoft.com/visualstudio/wp-content/uploads/sites/4/2026/02/assesment-markdown.webp)\n\n### DataTips in IEnumerable Visualizer\n\nYou can now use DataTips in the IEnumerable Visualizer while debugging. Just hover over any cell in the grid to see the full object behind that value, the same DataTip experience you’re used to in the editor or Watch window.\n\nWhen you hover over a cell, a DataTip shows all the object’s properties in one place. This makes it much easier to debug collections with complex or nested data. Whether it’s a `List<T>` of objects or a dictionary with structured values, one hover lets you quickly inspect everything inside.\n\n[![Visual Studio IEnumerable Visualizer showing the expression lpvm.Posts. A table displays one row with columns for PostViewModel properties, including Categories with a count of one, AllCategories, NewCategory, and AllowComments set to True. A tooltip shows a CategoryViewModel object with an option to view raw data.](data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAABFMAAAJtAQMAAADASq01AAAAA1BMVEXW1taWrGEgAAAACXBIWXMAAA7EAAAOxAGVKw4bAAAAaklEQVR4nO3BAQEAAACCIP+vbkhAAQAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAA/BpTqwAB45RoHwAAAABJRU5ErkJggg==)](https://devblogs.microsoft.com/visualstudio/wp-content/uploads/sites/4/2026/02/IEnumerableVisualizer.webp)\n\n### Analyze Call Stack with Copilot\n\nYou can now **Analyze Call Stack with Copilot** to help you quickly understand what your app is doing when debugging stops. When you pause execution, you can select **Analyze with Copilot** in the Call Stack window. Copilot reviews the current stack and explains why the app isn’t progressing whether the thread is waiting on work, looping, or blocked by something.\n\nThis makes the call stack more than just a list of frames. It becomes a helpful guide that shows what’s happening in your app so you can move faster toward the real fix.\n\n[https://devblogs.microsoft.com/visualstudio/wp-content/uploads/sites/4/2026/02/callstackanalysis.mp4](https://devblogs.microsoft.com/visualstudio/wp-content/uploads/sites/4/2026/02/callstackanalysis.mp4)\n\n### Profiler agent with Unit Test support\n\nThe Profiler Agent (`@profiler` ) now works with unit tests. You can use your existing tests to check performance improvements, making it easier to measure and optimize your code in more situations. The agent can discovers relevant unit tests/BenchmarkDotNet benchmarks that exercise performance-critical code paths.\n\nIf no good tests or benchmarks are available, it automatically creates a small measurement setup so you can capture a baseline and compare results after changes. This unit-test-focused approach also makes the Profiler Agent useful for C++ projects, where benchmarks aren’t always practical, but unit tests often already exist.\n\n[![GitHub Copilot Chat showing profiler suggestion to optimize code step identify scope message requesting permission to run CPU performance profiler with confirm and deny buttons and model selector visible](data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAfMAAAJyAQMAAADqxbvoAAAAA1BMVEXW1taWrGEgAAAACXBIWXMAAA7EAAAOxAGVKw4bAAAAPklEQVR4nO3BMQEAAADCoPVPbQlPoAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAgJcBnIAAASD1U9kAAAAASUVORK5CYII=)](https://devblogs.microsoft.com/visualstudio/wp-content/uploads/sites/4/2026/02/copilot-profiler-chat-1.webp)\n\n### Faster and More Reliable Razor Hot Reload\n\nHot Reload for Razor files are now faster and more reliable. By hosting the Razor compiler inside the Roslyn process, edits to *.razor* files apply more quickly and avoid delays that previously slowed Blazor workflows. We also reduced the number of blocked edits, with more changes now applying without requiring a rebuild, including file renames and several previously unsupported code edits. When a rebuild is still required, Hot Reload can now automatically restart the app instead of ending the debug session, helping you stay in flow.\n\nWe are continuing to invest in features that help you understand, test, and improve existing code, not just write new code. Try these updates in the Visual Studio 2026 Stable Channel and [let us know what is working well and where we can improve](https://developercommunity.visualstudio.com/VisualStudio). Your feedback directly shapes what we build next.",
  "FeedUrl": "https://devblogs.microsoft.com/visualstudio/feed/",
  "Title": "Visual Studio February Update",
  "ProcessedDate": "2026-02-24 23:06:57",
  "Link": "https://devblogs.microsoft.com/visualstudio/visual-studio-february-update/",
  "Tags": [
    ".NET",
    "Debugging and Diagnostics",
    "GitHub Copilot",
    "Productivity"
  ],
  "PubDate": "2026-02-24T22:16:30+00:00",
  "Description": "This month’s Visual Studio update continues our focus on helping you move faster and stay in flow, with practical improvements across AI assistance, debugging, testing, and modernization. Building on the momentum from January’s editor updates, the February release brings smarter diagnostics and targeted support for real world development scenarios, from WinForms maintenance to C++ modernization. […]\n\nThe post [Visual Studio February Update](https://devblogs.microsoft.com/visualstudio/visual-studio-february-update/) appeared first on [Visual Studio Blog](https://devblogs.microsoft.com/visualstudio).",
  "OutputDir": "_news",
  "FeedLevelAuthor": "Visual Studio Blog",
  "FeedName": "Microsoft VisualStudio Blog",
  "Author": "Mark Downie"
}
