{
  "Tags": [
    "Company News",
    "Press releases"
  ],
  "Description": "The post [Global technology leaders launch Trusted Tech Alliance](https://news.microsoft.com/source/2026/02/13/global-technology-leaders-launch-trusted-tech-alliance/) appeared first on [Source](https://news.microsoft.com/source).",
  "FeedName": "Microsoft News",
  "Author": "stclarke",
  "Link": "https://news.microsoft.com/source/2026/02/13/global-technology-leaders-launch-trusted-tech-alliance/",
  "PubDate": "2026-02-13T17:01:09+00:00",
  "EnhancedContent": "**MUNICH — Feb. 13, 2026 —** Friday, at the Munich Security Conference, 15 companies from Africa, Asia, Europe and North America announced the launch of the Trusted Tech Alliance (TTA), a group of like-minded global technology providers coming together to work across borders, and based on a shared set of principles for a trusted technology stack — from connectivity, cloud infrastructure and semiconductors to software and AI.\n\nThese principles are designed to ensure that, regardless of a supplier’s nationality, companies in this Alliance will adhere to common commitments of transparency, security and data protection, which build trust and pass on the benefits of technology to people across the globe.\n\nIn response to an unprecedented pace of technological change and an increasingly complex environment, countries and customers are seeking greater reliability and resilience across technology providers and the services they deliver. At the same time, there is continued skepticism about digital technologies and their potential negative impact on individuals and societies. In this environment it is critical that companies from across the tech stack come together to address these concerns.\n\nIn defining the attributes for trusted technology and a set of operating principles to which signatories will adhere, TTA members are committing to work with governments and customers to ensure that the benefits of emerging technologies can accrue to broader public trust while driving job creation and economic growth.\n\nThe Alliance brings together leading companies committed to a shared set of clear, verifiable practices and principles that manifest how technology can be secure, reliable and responsibly operated, regardless of where it is built or deployed.\n\nAs of today, the signatories of the Trusted Tech Alliance are Anthropic, AWS, Cassava Technologies, Cohere, Ericsson, Google Cloud, Hanwha, Jio Platforms, Microsoft, Nokia, Nscale, NTT, Rapidus, Saab, and SAP.\n\nParticipating companies have agreed to five specific principles that define what it means to develop, deploy, operate and cooperate as a trusted global technology provider:\n\n1. Transparent Corporate Governance and Ethical Conduct\n2. Operational Transparency, Secure Development and Independent Assessment\n3. Robust Supply Chain and Security Oversight\n4. Open, Cooperative, Inclusive and Resilient Digital Ecosystem\n5. Respect for the Rule of Law and Data Protection\n\nThese commitments require companies to have strong corporate governance and ethical conduct, build technology securely and manage it responsibly throughout its lifecycle, and use contractually binding security and quality assurances with suppliers. They will hold their suppliers to strong global security standards and support a digital environment that is open, cooperative, and encourages innovation.\n\nThe TTA will continue to grow its community of global providers dedicated to advancing a trusted, interoperable and open technology stack and shaping shared approaches that support national and international efforts to strengthen sovereignty, resilience and competitiveness.\n\n*“In an era of rapid technological change, collaboration between like-minded industry peers is essential to promote customer trust and realise the full benefit of technology on the economy and society. We are joining the Trusted Tech Alliance to reinforce our continued commitment to provide customers with trusted, secure, and resilient technology,” said **David Zapolsky, Chief Global Affairs & Legal Officer, Amazon.***\n\n*“As AI systems grow more powerful — driving innovation, accelerating economic growth and reshaping national security — the United States and its allies and partners must ensure that the world’s most widely adopted models are safe, reliable, trustworthy and transparently developed. Anthropic is proud to join the Trusted Tech Alliance and to support American AI leadership and advance common principles for trusted AI alongside like-minded partners,” said **Sarah Heck, Head of External Affairs, Anthropic.***\n\n*“* *At a time of unprecedented progress in emerging technology adoption globally, Cassava Technologies is proud to be a founding member of the Trusted Tech Alliance. I believe that responsible leadership and collaboration at a global level will ensure that technology continues to enable human progress and inclusive economic development, especially important for our youth and future generations,” said **Strive Masiyiwa, Founder and Executive Chairman, Cassava Technologies.***\n\n*“* *No single company or a country can build a secure and trusted digital stack alone. Rather, trust and security can only be achieved together. That’s why, together with like-minded industry peers, we have launched the Trusted Tech Alliance — an initiative committed to verifiable trust practices across the digital stack,” said **Börje Ekholm, President and CEO of Ericsson.***\n\n*“Google Cloud has a long-held commitment to promote choice, trust and sovereignty that is codified in our technology today. Through the Trusted Tech Alliance, we aim to champion the principles we already adhere to: promoting customer choice and providing a portfolio of solutions, enabled by technical controls and local partnerships, to meet strict sovereignty requirements and regional standards,”* *said **Marcus Jadotte, Vice President, Government Affairs and Public Policy, Google Cloud.***\n\n*“Trust will play a critical role in advancing technology to ensure it addresses society’s most pressing needs. From energy security and sovereign defense to advanced manufacturing, we believe trusted ecosystems are key to securing societies, strengthening industries and driving future resilience,” said **Dong Kwan (DK) Kim, Vice Chairman of Hanwha Group.***\n\n*“Trusted, secure and transparent technology is essential to unlocking inclusive digital growth at global scale. Jio Platforms is proud to join the Trusted Tech Alliance to advance common standards and verifiable practices across the technology stack. Through collaboration with global partners, we aim to strengthen resilience, expand digital opportunity, and build long-term confidence in next-generation connectivity, cloud and AI systems,” said **Kiran Thomas, CEO, Jio Platforms.***\n\n*“In the current geopolitical environment, it is critical that like-minded companies work together to protect security and advance high global standards to preserve trust in technology across borders,” said **Brad Smith, Vice Chair and President of Microsoft.** “Based not on the nationality of the provider but on shared commitments to customers, this Alliance brings together leading companies around clear, verifiable principles that show technology can be secure, reliable and responsibly operated wherever it is deployed.”*\n\n*“AI is accelerating change across the technology stack and raising the bar for trust. Networks and critical infrastructure must be secure, resilient and interoperable by design. We’re joining with industry partners through the Trusted Tech Alliance to reinforce that foundation as intelligence scales globally,” said **Justin Hotard, President and CEO of Nokia.***\n\n*“AI infrastructure is the foundation upon which innovation is built — and that foundation needs to be trusted and secure. Customers must have absolute confidence in where their data resides, how it is protected and who governs the systems powering their AI. At Nscale, our sovereign AI infrastructure is purpose-built to deliver that assurance, combining performance with rigorous security, transparency and local control. We’re proud to partner with organizations around the world to advance AI in a way that is secure, trusted and built for long-term resilience,” said **Josh Payne, Founder and CEO of Nscale.***\n\n*“No matter how superior a technology such as AI and cybersecurity on the connected network may be, diverse discourse is essential for its societal acceptance. It is of utmost importance that trusted enterprises sharing common values and moral principles work in close coordination to advance their initiatives,” said **Jun Sawada, Executive Chairman of NTT.***\n\n*“Rapidus is proud to join the Trusted Tech Alliance, recognizing the importance of a trusted global technology ecosystem. We are fully aligned with the Alliance’s principles and are committed to contributing to the transparency, security, open innovation and resilient supply chains through collaboration with like-minded global partners,” said **Dr. Atsuyoshi Koike, CEO of Rapidus Corporation.***\n\n*“We are proud to join the Trusted Tech Alliance to promote secure and reliable digital infrastructure. Through this initiative, we want to contribute to increased digital security and foster innovation through international cooperation. In an era of rapid digital transformation, this kind of collaboration is not only a good step, but also a necessary one to achieve a more secure and competitive digital future,” said **Micael Johansson, President and CEO, Saab.***\n\n*“Trust and global technology cooperation remain essential for competitive economies. In today’s environment of heightened data sensitivity and regulation, where trust and sovereignty are increasingly intertwined, trust must be built diligently over time. At SAP, we are committed to fostering a trustworthy, reliable environment through open ecosystems, transparent security standards and responsible innovation,” said **Dominik Asam, Chief Financial Officer and Member of the Executive Board, SAP.***\n\nMore information can be found at [https://www.trustedtechalliance.com](https://www.trustedtechalliance.com).\n\n**For more information, press only:**\n\n[\\[email protected\\]](/cdn-cgi/l/email-protection)",
  "FeedLevelAuthor": "Source",
  "Title": "Global technology leaders launch Trusted Tech Alliance",
  "FeedUrl": "https://news.microsoft.com/source/feed/",
  "OutputDir": "_news",
  "ProcessedDate": "2026-02-13 17:15:11"
}
