{
  "Title": "Everything you need to get started with Xbox Cloud Gaming",
  "EnhancedContent": "![]()\n\nSkip to main content\n\n[!\\[\\](https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RE1Mu3b?ver=5c31)](https://microsoft.com) [Xbox Wire](https://news.xbox.com/en-us/)\n\n- Visit:\n- https://x.com/xboxwire\n- https://whatsapp.com/channel/0029VakfW7e5K3ze30Dp1247\n\n- Share:\n- https://www.twitter.com/share?url=https://news.xbox.com/en-us/2025/12/19/getting-started-with-xbox-cloud-gaming/\n- https://api.whatsapp.com/send?text=Getting%20Started%20with%20Xbox%20Cloud%20Gaming%20https://news.xbox.com/en-us/2025/12/19/getting-started-with-xbox-cloud-gaming/\n\nConsoles and PCs now have a powerful new partner offering even more ways to play: the cloud. With Xbox Cloud Gaming, you have access to a huge and dynamic library of the latest and greatest titles, wherever there’s a compatible screen, a stable internet connection, and a cloud-supported Xbox Game Pass subscription.\n\nXbox Cloud Gaming is now out of beta and available with [Xbox Game Pass Essential, Premium, and Ultimate subscriptions](https://news.xbox.com/en-us/2025/10/01/xbox-game-pass-ultimate-premium-essential-plans/), meaning it’s easier than ever to check out cloud streaming. Overall cloud gaming hours have [gone up 45%](https://news.xbox.com/en-us/2025/11/26/xbox-cloud-gaming-expansion-india-brazil-argentina-countries/) since this time last year as the service has rolled out to millions of new gamers around the world, with particularly strong uptake in Argentina and Brazil.\n\nBelow we’ll go over where you can play and everything you need to get started (which you’ll likely already have).\n\n## **What is Xbox Cloud Gaming?**\n\nXbox Cloud Gaming is a benefit included with most Game Pass plans that allows you to play games anywhere you have a compatible, internet-connected device (such as a PC, TV, or even your phone). Xbox Cloud Gaming lets you stream your games like you stream your shows and movies, through apps and browsers on the devices you already have – and it’s playable with a variety of game controllers and other input methods.\n\n![Cloud Gaming Guide](https://xboxwire.thesourcemediaassets.com/sites/2/2025/12/FY26_Holiday-Lookbook_Cloud-1-a018820d958abf5928ba-1900x1080.jpg)\n\n## **What You Will Need**\n\n### **Xbox Game Pass**\n\nUnlimited cloud gaming is included with Xbox Game Pass Essential, Premium, and Ultimate plans. Xbox Game Pass is our monthly subscription service that provides access to an ever-growing library of games, online multiplayer, in-game benefits for popular favorites like *League of Legends* and *Call of Duty: Warzone*, store rewards, and more with each plan. In addition to streaming from the cloud, you can also download Game Pass titles directly to your preferred console, PC, or handheld device for offline play.\n\n[Xbox Game Pass Essential](https://www.xbox.com/en-US/xbox-game-pass?msockid=0b3eb6060f726c8130cda0c60e056d71) offers unlimited cloud gaming for as low as $10/month and access to more than 50 games. [Xbox Game Pass Premium](https://www.xbox.com/en-US/xbox-game-pass?xr=shellnav) includes everything from Essential as well as access to 200+ games across console, PC, and supported devices for $14.99/month. For the best all‑around experience, [Xbox Game Pass Ultimate](https://www.xbox.com/en-us/xbox-game-pass/ultimate?xr=shellnav) delivers unlimited cloud gaming, 400+ games across console, PC, and more devices, day‑one new titles, online console multiplayer, plus added benefits like EA Play, Fortnite Crew, and Ubisoft+ Classics, as well as in‑game benefits across Riot titles and Rewards with Xbox — at no extra cost.\n\n### **Supported Platforms**\n\nThe following devices currently support Xbox Cloud Gaming (with more details [here](https://support.xbox.com/en-TT/help/games-apps/cloud-gaming/verified-devices-for-xbox-cloud-gaming)):\n\n- **Xbox Consoles** – *Xbox One and later. Why stream games to a gaming console? It can be a great way to try a title before you download, or to play newer Xbox Series X games on your trusty Xbox One.*\n- **Windows PCs** – *Windows 10 version 20H2 and later*\n- **Mac Computers** – *MacOS 14.1.2 and later*\n- **Windows Handhelds** – *Including ROG Xbox Ally, ROG Xbox Ally X, Logitech G Cloud, and Razer Edge*\n- **Steam Deck**\n- **Android Phones and Tablets** – *Android OS 12.0 and later*\n- **Apple Phones and Tablets** – *iOS 14.4 and later*\n- **Smart TVs and Streaming Devices** – *Including those from LG, Samsung, and Amazon Fire*\n- **Meta Quest VR** – *Including Meta Quest 2, Meta Quest Pro, Meta Quest 3, and Meta Quest 3S*\n- **Cars** – [*Coming soon!*](https://news.xbox.com/en-us/2025/09/09/xbox-cloud-gaming-vehicles-cars-lg/)\n\n### **Internet Connection**\n\nWhatever device you choose to play on, it’s recommended that you have an internet connection speed of at least 20 Mbps to ensure a stable connection while cloud gaming. If you don’t know what your connection speed is, you can use any number of free online speed tests, such as [Speedtest.net](https://www.speedtest.net/), [Fast.com](https://fast.com/), or [MeasurementLab](https://speed.measurementlab.net/#/).\n\nWhere possible, it’s recommended that you play over a wired, Ethernet connection, but it’s also possible to play over 5 GHz Wi-Fi or 5G with capable devices. If your wireless router is dual-band, broadcasting at both 5 and 2.4 GHz, you may need to make sure that your device is properly set up to only connect over the 5 GHz network.\n\n### **Controller**\n\nMost games require a gamepad to be connected to your device, either wired or wirelessly. If you have nearly any kind of contemporary game controller, Xbox Cloud Gaming probably supports it, allowing you to use whatever hardware you already have on hand. This includes Microsoft’s own [official Xbox controllers](https://www.xbox.com/en-US/accessories/controllers/xbox-wireless-controller?msockid=0dae4f9bbc9f607e15c5591dbd736195) and those made by direct partners, as well as a wide range of verified controllers from third-party manufacturers, such as 8BitDo, GameSir, Backbone, or even Sony’s DualSense.\n\nSee a full list of supported manufacturers [here](https://support.xbox.com/en-US/help/games-apps/cloud-gaming/cloud-gaming-tested-controllers).\n\nMany games are also playable by [mouse and keyboard](https://www.xbox.com/en-US/play/gallery/mouse-and-keyboard) as well as [touch](https://www.xbox.com/en-US/play/gallery/touch), for devices that support those respective modes of input.\n\nIf you really want to game in style, check out the [Xbox Design Lab](https://xboxdesignlab.xbox.com/) for a variety of special branded and customizable controllers to suit your personal sense of style.\n\n### **Supported Regions**\n\nXbox Cloud Gaming is supported in a growing list of currently 29 countries all over the world, including India most recently. If you’re not sure whether yours is included, find out [here](https://www.xbox.com/en-US/regions#xboxgamepass).\n\n![Cloud Gaming Guide](https://xboxwire.thesourcemediaassets.com/sites/2/2025/12/FY26_Holiday-Lookbook_XGP-8cd6f8785737fcda54b0-1900x1080.jpg)\n\n## **What You Can Play**\n\n### **Xbox Game Pass**\n\nIn total, the Xbox Game Pass library includes hundreds of games across all genres, ranging from indie curios to the biggest AAA blockbusters. At this time, more than two thirds of those are enabled for cloud streaming, with more coming all the time.\n\nGame Pass Ultimate subscribers are also given access to EA Play and Ubisoft+ Classics, which adds additional cloud-playable titles to their libraries from those respective publishers.\n\n### **Stream Your Own Games**\n\nMany titles not included in Game Pass are still cloud playable, which means that you can stream them if you own them. Progress is saved and shared across all platforms, so you can pick up and play your games your way, wherever you are. [See the full list](https://www.xbox.com/en-US/play/gallery/buy-and-stream).\n\n## **How to Get Started**\n\nThe main division between ways to play with Xbox Cloud Gaming is whether you connect through an app or through a web browser. While the means may be slightly different, the results are the same.\n\n### **App**\n\n- [**Xbox Consoles**](https://support.xbox.com/en-US/help/games-apps/cloud-gaming/setup-cloud-gaming-xbox-console)\n- [**Windows PCs**](https://support.xbox.com/en-US/help/games-apps/cloud-gaming/setup-cloud-gaming-windows)\n- [**Windows Handhelds**](https://support.xbox.com/en-US/help/games-apps/cloud-gaming/setup-cloud-gaming-handheld-device)\n- **[Smart TVs and Streaming Devices](https://support.xbox.com/en-US/help/games-apps/cloud-gaming/set-up-smart-tv-xbox-app)**\n- [**Meta Quest**](https://www.meta.com/help/quest/3644196869183457/)\n\nFor consoles, the process is as simple as tabbing over to your library and Game Pass, then selecting a cloud-enabled game. The other devices listed above might just require the additional step of going to their respective app store and downloading the Xbox app first if it’s not already installed, then opening it and signing in to access your library.\n\n### **Browser**\n\n- [**Android**](https://support.xbox.com/en-US/help/games-apps/cloud-gaming/setup-cloud-gaming-android)\n- [**Apple**](https://support.xbox.com/en-US/help/games-apps/cloud-gaming/setup-cloud-gaming-apple)\n- [**Steam Deck**](https://support.microsoft.com/en-us/topic/xbox-cloud-gaming-in-microsoft-edge-with-steam-deck-43dd011b-0ce8-4810-8302-965be6d53296)\n\nFor devices running Android, MacOS, and iOS, the cloud streaming works through a web browser, rather than a dedicated app. First make sure that your browser version is supported [here](https://support.xbox.com/en-US/help/games-apps/cloud-gaming/supported-browsers) and update if necessary. Then navigate to [Xbox.com/play,](https://Xbox.com/play) sign in, and start gaming on the cloud. Selecting the **Menu** button, then **Add to Home Screen** will make it easier to access directly.\n\nSteam Deck requires going to desktop mode and installing Microsoft Edge, with detailed instructions linked above.\n\n![Cloud Gaming Guide](https://xboxwire.thesourcemediaassets.com/sites/2/2025/12/FY26_Holiday-Lookbook_Games-4d112884db4db01b82f2-1900x1080.jpg)\n\n## **See You in the Cloud**\n\nThat should cover everything you need to get started with Xbox Cloud Gaming. If you have any additional questions, our rigorous [support pages](https://support.xbox.com/en-US/help/games-apps/cloud-gaming/about-cloud-gaming) have you covered. Otherwise, you should go [check out the available library](https://www.xbox.com/en-US/play) and start playing something.\n\nHappy gaming!\n\n![]()\n\n![]()",
  "Tags": [
    "Company News",
    "Gaming"
  ],
  "Description": "The post [Everything you need to get started with Xbox Cloud Gaming](https://news.xbox.com/en-us/2025/12/19/getting-started-with-xbox-cloud-gaming/) appeared first on [Source](https://news.microsoft.com/source).",
  "PubDate": "2025-12-22T17:52:56+00:00",
  "Author": "stclarke",
  "Link": "https://news.xbox.com/en-us/2025/12/19/getting-started-with-xbox-cloud-gaming/",
  "FeedLevelAuthor": "Source",
  "FeedName": "Microsoft News",
  "ProcessedDate": "2025-12-22 20:03:21",
  "FeedUrl": "https://news.microsoft.com/source/feed/",
  "OutputDir": "_news"
}
