{
  "Description": "The post [How Microsoft is empowering Frontier Transformation with Intelligence + Trust](https://blogs.microsoft.com/blog/2026/01/27/how-microsoft-is-empowering-frontier-transformation-with-intelligence-trust/) appeared first on [Source](https://news.microsoft.com/source).",
  "ProcessedDate": "2026-01-28 01:30:50",
  "Title": "How Microsoft is empowering Frontier Transformation with Intelligence + Trust",
  "Author": "stclarke",
  "EnhancedContent": "![A collage of images of people overlaid with the words Frontier Transformation.](https://blogs.microsoft.com/wp-content/uploads/2025/12/OMB-FY26Q2-Hero.jpg)\n\nAt [Microsoft Ignite](https://ignite.microsoft.com/en-US/home) in November, we introduced Frontier Transformation — a holistic reimagining of business aligning AI with human ambition to help organizations achieve their highest aspirations and growth potential. While AI Transformation centered on efficiency and productivity, Frontier Transformation challenges us to do more for humanity by democratizing intelligence to unlock creativity and innovation for organizations and people around the world.\n\nAcross industries, our customers are leading the way to becoming Frontier; sharing three common traits anchored in a foundation of Intelligence + Trust. **AI in the flow of human ambition**, putting Copilots and agents directly in the tools people use; and **ubiquitous innovation**, empowering the maker in every role. These capabilities are served through Microsoft’s new intelligence layer: Work IQ, which understands how people work; Fabric IQ, which provides a trusted semantic layer for reasoning over an organization’s data; and Foundry IQ, the world’s leading AI app server powering safe, scalable agent experiences. Together, these capabilities put the “I” back in AI by grounding Copilots and agents in an organization’s own data, logic and workflows to fully understand operations and drive decisions that matter most. The third trait is **observability at every layer of the stack**; ensuring trust, safety and reliable outcomes. As the control plane to observe, govern and secure all AI artifacts, Agent 365 provides a unified view of every AI agent running in an organization’s environment — whether built on Microsoft’s platforms or others.\n\nOur customers and partners are showcasing what can be achieved with Frontier Transformation and human ambition paired with Copilots + agents, and I am pleased to share their stories — including many [onstage with us at Ignite](https://www.youtube.com/watch?v=zHHziUHK9Cs). Their journeys demonstrate what is possible for organizations everywhere when AI-first innovation is built upon Intelligence + Trust.\n\nYouTube Video\n\n#### **Putting AI in the flow of human ambition so people can achieve more in every role, across every industry**\n\nUsing a secure Azure foundation, [**Epic**](https://www.youtube.com/watch?v=zHHziUHK9Cs) embedded AI directly into clinical workflows, enabling hundreds of thousands of clinicians worldwide to work faster and deliver higher quality care. Epic AI generates documentation in the flow of work, reducing time spent on prior authorization questions by over 40% and surfacing critical insights that could be missed during manual review. In one month alone, Epic AI automatically generated more than 16 million patient record summaries, helping clinicians reduce administrative workload and speed time to treatment. AI-driven imaging follow-up also boosted early cancer detection at the Christ Hospital to 69%, far above the national 46% average. By delivering real improvements like these today, Epic is building confidence and familiarity that will accelerate adoption of tomorrow’s AI-enabled breakthroughs in precision medicine, drug discovery and the understanding of disease.\n\nTo create a consistent experience across its entire workforce, heritage brand [**Levi Strauss & Co.**](https://www.microsoft.com/en/customers/story/25730-levi-strauss-and-company-windows) standardized on Windows 11, Copilot+ PCs, Intune, Microsoft 365 Copilot and Microsoft Foundry to give every team — from designers to retail associates to distribution centers — a modern, AI-powered workplace. With Copilot and agents accelerating workflows and eliminating fragmentation across legacy systems, teams can model demand faster, bring products to market with greater precision and spend more time on creative and commercial work that strengthens the brand. They are also reducing operational noise, strengthening security and scaling insights across design, merchandising, retail and supply chain. With a unified, secure Microsoft platform, Levi’s is enriching the employee experience, driving sharper execution and building durable advantage in an increasingly dynamic market.\n\n[**London Stock Exchange Group (LSEG)**](https://www.microsoft.com/en/customers/story/25709-lseg-microsoft-fabric) is unifying the data foundation of global finance by modernizing its platform on Microsoft Fabric and bringing trusted financial intelligence directly into Microsoft 365 Copilot. The company has consolidated 30 legacy data systems, 1,200 datasets and more than 33 petabytes of financial content into a single, governed environment. This unified foundation is now delivering faster, cleaner insights to 44,000 customers in over 170 countries and cutting product development timelines from years to months. With Fabric and Copilot working together, financial professionals can access LSEG’s expansive data and analytics directly in the flow of work — helping them make decisions with greater speed and confidence while reducing friction across risk modeling, regulatory compliance and investment workflows. By simplifying the data estate first, LSEG is safely surfacing insights through Microsoft 365 Copilot and empowering teams across the organization to innovate with consistency, compliance and at global scale.\n\nThe [**University of Manchester**](https://ukstories.microsoft.com/features/university-of-manchester-first-university-in-the-world-to-provide-microsoft-365-copilot-access-and-training-to-all-students-and-staff/) **** is the first higher education institution in the world to provide Microsoft 365 Copilot access and training to all 65,000 students and staff. Learners and researchers will gain equitable access to Copilot-powered tools to strengthen teaching, accelerate interdisciplinary discovery and build future-ready skills. For students, this is an essential aid for revision, translation and academic success; while university leadership can ensure responsible use policies and training so every student can use AI ethically and confidently. Researchers can synthesize vast volumes of information across fields from photonic materials to biomedical science, enabling faster progress on challenges from cancer treatment to sustainable manufacturing; while operationally, Copilot helps administrative staff free their time for higher value work. **** The University of Manchester is defining a new model for modern higher education by pairing its decades of AI innovation with equitable access to cutting edge AI tools that prepare the next generation of citizens, innovators and creators.\n\n#### **Inspiring the maker in every one of us with ubiquitous innovation that amplifies creativity and accelerates impact**\n\n[**Adobe**](https://www.youtube.com/watch?v=zHHziUHK9Cs) is redefining creativity, productivity and customer experience by infusing AI deeply into its product ecosystem, powered by Azure, Copilot and Microsoft Foundry. By supporting third-party models directly inside Adobe Firefly, creators can choose the best model for the job while unlocking new agentic capabilities across Photoshop, Acrobat and Adobe’s Customer Experience Orchestration solutions; resulting in significant acceleration in workflows through AI-driven agents. With daily use of GitHub Copilot, its engineering organization is boosting developer productivity and speed to innovation. The company is also focused on enterprise-grade governance and data provenance to help customers trust and verify content as AI adoption grows — further reinforced by Adobe Marketing Agent for Microsoft 365 Copilot as part of the Agent 365 preview. By combining open model choice with responsible AI infrastructure, Adobe is giving customers creative choice and operational confidence, while unlocking faster innovation, without compromising security, trust or brand integrity.\n\nIn an industry facing unprecedented pressure — from rising costs to shrinking margins — [**Land O’Lakes**](https://news.microsoft.com/source/2025/11/12/land-olakes-and-microsoft-partner-to-accelerate-ai-innovation-in-agriculture/) is accelerating AI innovation across American agriculture by developing a new digital assistant called Oz. Built on models within Microsoft Foundry, the digital assistant turns an 800-page crop protection guide into instant, data-rich insights delivered through intuitive workflows. The Copilot solution provides agronomic expertise throughout the growing season tailored to each grower’s soil, crop and environmental conditions — with personalized recommendations that address unique farm-level challenges. This AI-enhanced solution streamlines access to critical information so experts can help growers make faster, more confident decisions that help control input costs, boost crop yields and drive long-term success. The work Land O’Lakes is doing shows how AI can democratize intelligence — empowering farmers to grow their businesses while feeding their communities and building a more resilient agricultural ecosystem.\n\n[**Mercedes Benz**](https://www.youtube.com/watch?v=zHHziUHK9Cs) is transforming every layer of its enterprise — from headquarters to the factory floor to the driving experience. Built on Azure and powered by Copilot, the company is moving toward making Copilot available broadly, with over 50 business areas already using Copilot Studio to build and automate their own workflows and agents. GitHub Copilot has driven a 70% increase in engagement with software developers, shifting teams from routine coding to higher value innovation. On the factory floor, Mercedes’ MO360 data platform connects 30 passenger plants, and its Digital Factory Chat multiagent system is cutting issue diagnosis time from days to minutes. With the next generation of Hey Mercedes — powered by Azure OpenAI, Bing, Microsoft Teams, Intune and Microsoft 365 Copilot — the vehicle becomes a “third workspace,” enabling productivity through natural voice. Investing in AI skills, tools and platform breadth is helping Mercedes Benz build enterprise capability and bend the curve on innovation; with efficiency gains that help teams innovate and drive operational impact internally and across customer experiences. We also recently announced our partnership with the [**Mercedes-AMG PETRONAS F1**](https://news.microsoft.com/source/2026/01/22/microsoft-and-mercedes-amg-petronas-f1-team-unite-to-drive-innovation-from-factory-to-circuit/) Team to drive innovation across its racing operations. With Microsoft’s cloud and enterprise AI stack — including Azure AI, Microsoft 365 and GitHub — it is turning data into real-time intelligence that powers faster decisions, smarter strategies and sustained competitive advantage on and off the track.\n\n[**Pantone**](https://news.microsoft.com/source/2025/11/05/pantone-and-microsoft-unite-to-enhance-creative-exploration-through-ai/?msockid=3f6c557fb1996fc213de43f1b0dd6e00) is transforming decades of color expertise into a next-generation AI offering with the launch of its Pantone Palette Generator, built entirely on Microsoft Foundry and Azure AI. By applying a multi-agent architecture powered by Azure AI Search, Azure Cosmos DB and Azure OpenAI, Pantone is bringing instant, trend-backed color guidance directly into creative workflows. What once required weeks of research across physical color books and expert archives can now be achieved in seconds, enabling designers, brands and product teams to move from inspiration to production with greater speed and accuracy. Using GitHub Copilot, its engineering team accelerated development of initial proof of concept by more than 200 hours, allowing the company to focus on enhancing agent orchestration and color science logic. As Pantone expands its AI-native platform, it is also helping creators build new skills — learning how to integrate agentic workflows, prompt engineering and trend-driven insights into the design process. The platform modernizes Pantone’s iconic color system and positions the company to scale new digital services as it evolves its multiagent capabilities and reshapes business processes.\n\n**Westpac** is bringing Copilot to more than 35,000 employees across its global workforce — the largest Microsoft 365 Copilot rollout to date in Australia and the largest deployment in financial services within Asia Pacific. This comes after a successful pilot with 15,000 employees that delivered strong business outcomes and freed up significant time for users each month. The company is now deploying AI to accelerate work, reduce friction and reinvent how employees engage with their customers. The bank is pairing its Copilot implementation with AI education programs and Microsoft Copilot Studio to build custom agents for HR and IT, while creating a new Azure-based innovation sandbox to enable teams to quickly experiment with AI-enabled workflows and solutions. Westpac’s move to embed AI at scale is a strategic investment in people and a catalyst for more efficient, higher value work—underscoring how responsible, enterprise grade AI can drive meaningful value for employees, customers and shareholders.\n\n#### **Bringing observability to every layer of the stack to ensure outcomes are reliable, safe and aligned with the business**\n\n[**ServiceNow**](https://www.youtube.com/watch?v=zHHziUHK9Cs) is helping its customers accelerate AI adoption safely by integrating with Microsoft Agent 365 — Microsoft’s control plane for securing and governing agents at scale. By enabling them to bring their agentic workflows into a unified governance environment, ServiceNow can help them gain visibility, access controls and ensure compliance across AI systems. Companies like AstraZeneca are already using ServiceNow AI Control Tower together with Agent 365 to manage lab and operational workflows, saving 90,000 hours that researchers can redirect toward discovering lifesaving drugs. The ability to see, trust and scale AI agents gives organizations confidence to move quickly without losing control. ServiceNow is demonstrating how advanced workflow AI delivers its greatest value when paired with enterprise-wide governance — giving organizations the speed and efficiency they want while maintaining the control required for mission critical operations.\n\nTo help organizations safely accelerate agentic AI adoption, [**Workday**](https://www.youtube.com/watch?v=zHHziUHK9Cs) is building solutions that work with Agent 365 for a unified way to govern its agents. The company is helping businesses address the shift from shadow IT to shadow AI as employees begin incorporating AI agents into the way they work. Workday’s Agent System of Record helps customers establish governance and oversight around the work AI agents are doing, allowing them to scale intelligent workflows with confidence. Workday highlights that responsible AI acceleration requires combining powerful automation with a shared control plan — making the secure, compliant path the easiest one, and enabling organizations to scale without losing oversight.\n\nAs organizations move to operationalize agentic AI at scale, [**Genspark**](https://news.microsoft.com/source/asia/features/with-microsoft-agent-365-one-startup-furthers-goal-of-making-ai-agents-more-intuitive/?msockid=07b0d8f956bd61d1198cce4457db60b3) is integrating with Agent 365 to provide a governed, enterprise grade path for deploying its rapidly growing ecosystem of Super Agents. As employees increasingly experiment with personal AI creation tools, companies are looking for ways to shift from unmanaged shadow AI to secure, outcome-driven agent workflows. Through Agent 365, the platform enables organizations to register its agents alongside those from Microsoft and other partners, apply unified governance policies, maintain consistent identity and permission controls, and ensure all agent generated outputs align with corporate, regulatory and data residency requirements. This governance layer extends the value of its own agent registry — where more than 80 specialized agents and millions of user generated prompts are already driving productivity — allowing customers to safely scale agentic creation across roles, teams and industries. Genspark demonstrates that responsible acceleration requires pairing powerful, outcome first agent experiences with a shared control plane like Agent 365, enabling AI to scale without losing oversight.\n\nAt Ignite, we also introduced Agent Factory — a new way for organizations to build and scale AI agents with confidence — bringing together Work IQ, Fabric IQ and Foundry IQ under a single, ROI-driven model. Agent Factory enables companies to take complex workflows — from claims processing to freight forwarding to supply chain management — and turn them into measurable, production-ready agentic systems supported by Microsoft’s forward deployed engineers, partner ecosystem and built-in governance. As agents move from experimentation to mission critical automation, companies need a standardized, governed path to build and scale them, and Agent Factory is the solution — tying innovation directly to measurable ROI.\n\nOur ambition with Frontier Transformation is to ensure that the maker in every one of us is empowered by everything we build and deliver. As we enter the second half of the fiscal year, one thing is clear: our customers and partners are redefining what can be achieved as Frontier Firms. Built on a foundation of Intelligence + Trust, and with the full breadth of Microsoft’s cloud and AI solutions, we are committed to helping every organization scale AI-first innovation. Our model diverse, open and heterogenous platform unifies your IQ assets — and the human ambition that lives inside of your company — to deliver outcomes that help you achieve your highest aspirations. Thank you for your continued partnership and trust as we continue shaping what is possible together.\n\nTags: [AI](https://blogs.microsoft.com/blog/tag/ai/), [AI Transformation](https://blogs.microsoft.com/blog/tag/ai-transformation/), [Frontier Transformation](https://blogs.microsoft.com/blog/tag/frontier-transformation/), [Intelligence + Trust](https://blogs.microsoft.com/blog/tag/intelligence-trust/)",
  "FeedUrl": "https://news.microsoft.com/source/feed/",
  "Tags": [
    "AI",
    "Company News"
  ],
  "FeedLevelAuthor": "Source",
  "FeedName": "Microsoft News",
  "OutputDir": "_news",
  "PubDate": "2026-01-28T00:53:40+00:00",
  "Link": "https://blogs.microsoft.com/blog/2026/01/27/how-microsoft-is-empowering-frontier-transformation-with-intelligence-trust/"
}
