{
  "EnhancedContent": "![A digital photo collage featuring a stylized, illuminated view of Earth at night, with bright data‑like points highlighting regions, framed by abstract geometric shapes in blue, pink, and navy tones.](https://blogs.microsoft.com/wp-content/uploads/sites/5/2026/01/FY26_OML-Q3–PA-Elevate-Elevate-Announcement-Header_04-1.png)\n\nEighty years ago, the first United Nations General Assembly convened in London, marking the start of a new era of global cooperation. Today, the context in which the UN operates has changed significantly. The UN system is being asked to deliver results with greater speed and precision, often amid tightening resources and growing demands. In response, the UN is advancing reforms to become more agile, accountable, and efficient.\n\nThe UN80 initiative, launched by UN Secretary-General Antonio Guterres, is about making the UN system fit for the future, strengthening its resilience, responsiveness, and capacity for innovation across humanitarian response, development, and international security.\n\n### Leaning in at a pivotal time\n\nWe are at a unique moment in history, the AI era, where digital and AI technologies can fundamentally reshape how large, complex institutions deliver for people around the world. For the UN, this is an opportunity not only to strengthen core systems such as procurement, service delivery, and supply chain management, but to reimagine how it meets the needs of constituents with greater speed, scale, and impact. Microsoft can support this moment by helping build the digital and AI foundations needed to modernize operations and unlock new solutions to global challenges at a scale not previously possible.\n\n### Our commitment to UN80\n\nIn December, all 193 Member States reached agreement on a package of measures to ensure financial stability and enhance efficiency across the UN system. Following that, and in the spirit of the US Government’s [recent $2 billion contribution to fund humanitarian aid,](https://news.un.org/en/story/2025/12/1166678) Microsoft is announcing a pledge designed to support the UN system holistically. We hope that our pledge will inspire further action and help catalyze broader private sector resources and expertise. Microsoft’s UN80 pledge is structured around four pillars.\n\n1. A UN80 innovation fund\n2. Affordable pricing tailored for the UN\n3. AI training and readiness for UN staff\n4. Mobilizing private sector partners\n\nTogether, these commitments are intended to support the organization’s efforts to become more agile, efficient, and transparent through concrete action and investment. We describe each pillar in more detail below.\n\n#### 1.A UN80 innovation fund\n\nMicrosoft is committing a multi-million-dollar investment to establish an innovation fund that will support priority UN80 initiatives, particularly where AI and digital technologies can accelerate outcomes. This fund is designed to be collective, open to other private sector partners’ contributions, and focused on practical projects that strengthen UN capabilities and delivery.\n\n#### 2.Affordable pricing tailored for the UN\n\nMicrosoft is making a pricing commitment designed to improve affordability for the UN system. As part of this commitment, Microsoft will provide a specialized UN80 offer through June 2027 to improve affordability and help address financial constraints. Access to secure, modern digital tools is foundational to the UN’s ability to operate effectively across geographies and mandates.\n\n#### 3.AI training and readiness for all UN staff\n\nWe will make available free digital and AI literacy training and credentials to all UN staff. This includes training on the capabilities needed to adopt and scale technology responsibly across UN agencies, missions, and offices.\n\n#### 4.Mobilizing private sector partners\n\nMicrosoft is committing to bring together partners to align resources, expertise, and innovation in support of UN80 priorities. EY is taking a leadership position in the industry as the first partner to join this coalition, making a similar pledge to contribute their expertise and capacity in support of UN80-aligned initiatives. EY brings deep experience across the UN system as well as across multiple industries—expertise that will be invaluable in shaping new initiatives and collaborations to strengthen the capabilities needed to meet the UN80 commitments. Together, Microsoft and EY are working to anchor this early private-sector coalition in shared purpose and equip the UN with the tools and capabilities to advance reform at scale.\n\n### Building on a foundation of impact\n\nThis commitment builds on years of concrete collaboration where technology and partnerships have strengthened core UN systems. Through our work with the United Nations Children’s Fund (UNICEF), we’ve helped advance digital learning platforms that have reached millions of children worldwide, ensuring equitable access to education even in the most challenging circumstances. Our engagement with the International Telecommunication Union (ITU) has supported global connectivity initiatives, helping bridge the digital divide and foster inclusive access to technology. In humanitarian settings, our work with the United Nations High Commissioner for Refugees (UNHCR) is advancing AI-powered transcription, translation, and summarization to make refugee onboarding faster and more accessible in some of the world’s toughest environments.\n\nTogether with Microsoft’s AI for Good Lab and GitHub, UNHCR has also modernized mapping for the Kakuma refugee camp, enabling humanitarian teams to deliver aid more efficiently, plan infrastructure with precision, and uphold safety and dignity for over 300,000 displaced individuals. We partnered with the International Labour Organization (ILO) and the International Training Centre of the ILO through the Women in Digital Business initiative to equip women entrepreneurs with digital and AI skills—opening doors to growth, reaching new markets, and strengthening economic impact. In remote communities like Kaswanga in Rusinga Island, these tools are breaking barriers and rewriting futures as women turn local crafts and produce into nationwide businesses*.*\n\nTogether, these efforts show how responsible innovation can strengthen the UN’s ability to deliver at scale.\n\n### How we will support delivery\n\nTo support effective execution of these commitments, Microsoft is standing up a dedicated UN80 engagement team to serve as a point of contact for UN counterparts. This team will engage with UN leadership to help align priorities, coordinate partner contributions, and support the effective deployment of resources as the UN80 initiative takes shape.\n\nUN80 provides an opportunity to build on this foundation and scale what works across the system.\n\nAs the UN enters its next 80 years, Microsoft stands with the organization as a committed partner, investing in the systems and capabilities needed to deliver in a changing world. Our hope is that UN80 is more than an aspiration, and that it promotes modernization, accountability, transparency, and efficiency for years to come.\n\n*UN does not endorse any company, brand, organization, product or service.*",
  "Title": "Microsoft supports UN’s move into the AI era",
  "Author": "stclarke",
  "FeedName": "Microsoft News",
  "FeedLevelAuthor": "Source",
  "Tags": [
    "Company News",
    "On the issues"
  ],
  "OutputDir": "_news",
  "Description": "The post [Microsoft supports UN’s move into the AI era](https://blogs.microsoft.com/on-the-issues/2026/01/20/a-renewed-commitment-to-strengthening-the-united-nations-for-its-next-era/) appeared first on [Source](https://news.microsoft.com/source).",
  "PubDate": "2026-01-20T18:01:38+00:00",
  "Link": "https://blogs.microsoft.com/on-the-issues/2026/01/20/a-renewed-commitment-to-strengthening-the-united-nations-for-its-next-era/",
  "ProcessedDate": "2026-01-20 19:18:31",
  "FeedUrl": "https://news.microsoft.com/source/feed/"
}
