{
  "Tags": [
    "Sustainability"
  ],
  "Author": "stclarke",
  "FeedUrl": "https://news.microsoft.com/source/feed/",
  "Link": "https://blogs.microsoft.com/blog/2026/02/18/a-milestone-achievement-in-our-journey-to-carbon-negative/",
  "ProcessedDate": "2026-02-18 17:22:35",
  "PubDate": "2026-02-18T16:24:22+00:00",
  "OutputDir": "_news",
  "EnhancedContent": "![Woman in hard hat amid energy towers.](https://blogs.microsoft.com/wp-content/uploads/2026/02/omb-hero-image.jpg)\n\nIn 2020, Microsoft announced a [moonshot commitment](https://blogs.microsoft.com/blog/2020/01/16/microsoft-will-be-carbon-negative-by-2030/) to become carbon negative by 2030 — accelerating work across our company to advance the partnerships and technologies needed to advance sustainability for our businesses, our customers and the world. A key milestone on this journey was our aim to match 100% of our annual global electricity consumption with renewable energy(1) by 2025. **Today, we are pleased to share that Microsoft has achieved this milestone**(2)**.** This progress helps drive investment into the power systems where we operate, expand clean energy supply and advance broader energy innovation.\n\n### **Over a decade of investment: 40 gigawatts of new renewable energy contracted**\n\nWhat began in 2013 with a single 110 megawatt (MW) power purchase agreement (PPA) in Texas — a small first step to demonstrate how corporate procurement could scale clean energy(3) — has evolved into one of the largest clean energy portfolios in the world. This first deal not only supported Microsoft’s early cloud services but also set in motion a decade of commercial partnerships and learning-by-doing that served to demonstrate how corporate demand for advanced energy solutions can help to achieve a more affordable and sustainable power system, while supporting reliability for customers.\n\nSince our carbon negative announcement in 2020, we have contracted 40 gigawatts (GW) of new renewable energy supply across 26 countries, working with more than 95 utilities and developers across 400+ contracts and counting. To put that amount in perspective — that’s enough energy to power about [10 million US homes](https://www.epa.gov/green-power-markets/green-power-equivalency-calculator-calculations-and-references). Of that contracted volume, 19 GW are now online, delivering new clean energy supply to the power grid, while the remainder are slated to come online over the next five years.\n\nOur new renewable energy procurement continues to deliver significant environmental benefits, including the reduction of Microsoft’s reported Scope 2 carbon dioxide emissions by an estimated 25 million tons(4) and the mobilization of billions of dollars’ worth of private investment in regions where we operate.\n\n### **Microsoft’s global renewable energy procurement footprint**\n\n[![This map illustrates Microsoft’s global renewable energy procurement footprint. Contracted and active volumes of renewable energy as of December 31, 2025. The base image is a world map, with markers placed across North America, South America, Europe, Asia‑Pacific, and other regions where Microsoft has contracted for renewable energy. The map is intended to show the global reach and regional diversity of Microsoft’s renewable energy procurement efforts.](https://blogs.microsoft.com/wp-content/uploads/2026/02/renewable-energy-map-miller-light-FINAL-1024x751.png)](https://blogs.microsoft.com/wp-content/uploads/2026/02/renewable-energy-map-miller-light-FINAL.png)Contracted and active volumes of renewable energy as of December 31, 2025.\n\n###\n\n###\n\n###\n\n###\n\n###\n\n###\n\n###\n\n###\n\n###\n\n###\n\n###\n\n###\n\n###\n\n###\n\n###\n\n### **Catalyzing market investment through bankable, repeatable models**\n\nMicrosoft is among the early pioneers in developing technical and commercial practices that help advance bankable, repeatable and scalable procurement tools suitable for each market. Our clean energy purchasing navigates a global patchwork of power market designs, requiring creativity in how we balance cost, time to market and project sizing in our portfolio across planning, contracting and management.\n\nOur work has benefited from a broad coalition of partners helping to build this market together. According to [Bloomberg New Energy Finance](https://about.bnef.com/insights/clean-energy/new-energy-outlook/#overview), more than 200 global corporations collectively purchased nearly 200 GW of clean energy around the world since 2008. Working alongside other [clean energy buyers](https://cebuyers.org/wp-content/uploads/2025/09/CEBA-Report-Corporate-Demand-Drives-Clean-Energy.pdf) — as well as hundreds of utilities, manufacturers, financiers, developers and engineers — we have helped reduce transaction costs, expand developer access to financing and streamline procurement approaches that other buyers can adopt.\n\nThis global flywheel of partnership, investment, technology and policy innovation is expected to continue to facilitate billions of dollars’ worth of investment into infrastructure and jobs. And as we’ve seen repeatedly, when Microsoft sends a clear market signal for world-class, first-of-a-kind technologies and infrastructure, the power sector rises to the challenge. Our procurement over the past decade has demonstrated that partnerships, communities and innovation are essential ingredients that help to accelerate first-of-a-kind technologies and infrastructure at scale.\n\n### **Scaling partnerships to scale infrastructure**\n\nCritical to Microsoft’s success in expanding digital infrastructure and supporting our local communities is our ability to [build trusted partnerships](https://aka.ms/AAzc8fr) with the over 95 global energy suppliers that support our clean energy portfolio. We have sourced clean energy through multiple requests for proposal or information, bilateral engagements and clean tariffs to evaluate over 5,000 unique carbon-free energy projects around the world.\n\nToday, Microsoft has six energy company partners with which we have over 1 GW of contracted renewable energy capacity, and more than 20 energy supplier partners where each partner has at least five separate renewable energy projects with Microsoft — evidence of the durable, repeatable relationships necessary to scale clean energy. Combining scale with speed, Microsoft’s landmark 10.5 GW framework agreement with [Brookfield](https://bep.brookfield.com/press-releases/bep/brookfield-and-microsoft-collaborating-deliver-over-105-gw-new-renewable-power) sends a long-term, 2030 demand signal to the market that enables developers to raise funding more efficiently, bolster supply chains, hire engineers and construct world-class energy infrastructure.\n\n### **Putting communities first**\n\nOur renewable energy procurement has mobilized billions of dollars in private investment, supported thousands of jobs across the communities where we operate and delivered meaningful co-benefits. Through partnerships with developers and nonprofit organizations, we’ve worked to embed community-driven benefits into our energy portfolio. These benefits include robust infrastructure, economic inclusion and support for community-focused organizations.\n\nOur support for communities shows up in projects like our 500 MW PPA with [Sol Systems](https://www.solsystems.com/news/sol-systems-announces-groundbreaking-agreement-with-microsoft/), or our 250 MW PPA with [Volt Energy Utility](https://www.voltenergyutility.com/press/volt-energy-utility-agreement-with-microsoft) that provided local training and jobs, as well as grants to community nonprofit organizations and habitat restoration. We’ve also signed over 1.5 GW of distributed solar, bringing clean energy directly into hundreds of communities around the world. Landmark agreements like our 500 MW offtake with Pivot Energy, or our 270 MW offtake with [PowerTrust](https://powertrust.com/microsoft-powertrust/) are expected to foster employment, energy cost savings and grid resilience in communities across the United States, Mexico and Brazil. More details on the above examples and our approach to community benefits in clean energy agreements can be found in a dedicated [Microsoft whitepaper](https://aka.ms/REcommunitybenefits).\n\n### **Innovation unlocks new markets and pathways**\n\nMicrosoft’s clean energy procurement continues to play an important role in catalyzing technical, commercial and regulatory innovation. Our commercial efforts have helped lower barriers to entry into new markets and expand access into multi-technology contracts that accelerate decarbonization.\n\nIn Japan, Microsoft signed one of the first corporate PPAs in the country’s restructured power market. Our 25 MW, 20-year agreement with [Shizen](https://www.shizenenergy.net/en/2025/10/03/seg_vppa_microsoft_100mw/) represents the first single-asset virtual PPA executed in the country, which helped pave the way to over 2GWs of corporate procurement since 2024, according to [Bloomberg New Energy Finance](https://about.bnef.com/insights/clean-energy/new-energy-outlook/#overview). Alongside opening new markets, we have structured several multi-technology offtakes in nascent markets for corporate procurement. In India, Microsoft purchased a combined 437 MW solar/wind hybrid offtake from [Renew](https://investor.renew.com/news-releases/news-release-details/renew-signs-4376-mw-green-attribute-contract-microsoft), where our projects will support energy access and rural electrification. In Microsoft’s home state of Washington, [our datacenters in Douglas County](https://powerex.com/sites/default/files/2023-06/Powerex%20Announces%20Agreement%20with%20Microsoft%20for%2024x7%20Carbon-Free%20Energy.pdf) are supplied by 100% carbon-free energy, as we leverage a creative blend of new wind power and hydropower storage to deliver around-the-clock clean energy.\n\n### **Looking forward to 2030 and beyond**\n\nIn 2025, the International Energy Agency (IEA) described a new [“Age of Electricity,”](https://www.iea.org/reports/electricity-2025) marked by accelerating electricity demand from electric vehicles, air conditioners, data centers and heat pumps. As the world electrifies more of the economy, the demand for affordable, reliable and clean electricity will continue to rise.\n\nOur experience building Microsoft’s clean energy portfolio both reflects and furthers global trends. According to IEA data, since 2000, renewable energy generation has [expanded nearly four-fold](https://www.iea.org/reports/electricity-2025). In many [power markets](https://www.iea.org/reports/electricity-2025) across the world, clean energy is one of the fast-growing sources of generation, and often the one with the fastest time-to-market. Corporate buyers like Microsoft continue to serve as an important catalyst in driving commercial demand for innovation and infrastructure across the power industry.\n\nAs we continue our journey toward becoming carbon negative by 2030, Microsoft will continue to push for an expansive focus on adding all forms of carbon-free electricity solutions, complementing and adding to our portfolio of renewable energy resources. We recognize that the world’s rising electricity needs require a balanced, all-of-the-above decarbonization strategy to meet global economic growth and environmental goals, and our sustainability goals will continue to support this approach moving forward. Such a strategy requires a broader set of carbon-free energy and grid-enabling technologies, including nuclear energy, next-generation grid infrastructure and carbon capture technology. Just as renewable energy was a relatively small part of global energy grids in 2013 when we signed our first PPA, today many advanced energy technologies remain early in their development but offer significant promise to accelerate progress towards an affordable, reliable and sustainable energy future.\n\nMicrosoft has already taken early steps to support the advancement of a broader set of carbon-free energy technologies as we partner with Helion and Constellation Energy on a [50 MW fusion project](https://www.helionenergy.com/articles/helion-announces-worlds-first-fusion-ppa-with-microsoft/) in Washington state and work with Constellation to restart the 835 MW [Crane Clean Energy Center](https://www.constellationenergy.com/newsroom/2024/Constellation-to-Launch-Crane-Clean-Energy-Center-Restoring-Jobs-and-Carbon-Free-Power-to-The-Grid.html) in Pennsylvania. Microsoft’s Climate Innovation Fund has allocated $806 million of capital to 67 investees, with 38% directed toward Energy Systems — advancing carbon-free power and fuels, energy storage and energy management solutions.\n\nWe welcome continued collaboration with our power sector partners to bring these innovations to market and incorporate new technology tools in the process to accelerate their development.\n\nWe will continue to build and leverage new AI-driven tools to design, permit and deploy new power technologies that help expand and more efficiently operate the electricity grid, bringing more clean energy online faster. This work is exemplified by our recently announced collaborations with [Idaho National Laboratory](https://inl.gov/news-release/idaho-national-laboratory-collaborates-with-microsoft-to-streamline-nuclear-licensing/) and the [Midcontinental System Operator](https://www.microsoft.com/en/customers/story/18851-midcontinent-independent-system-operator-microsoft-purview?msockid=106ba26386196a493e91b1ba82196cb9), among other [examples](https://www.microsoft.com/en-us/ai/energy-resources/power-utilities).\n\nAnd as we advance innovative energy technologies, we recognize that standards must evolve alongside innovation. That is why we will continue participating in industry forums that strengthen carbon accounting frameworks — so that our clean energy procurement is measured with greater accuracy and delivers real world emissions reductions, with a continued focus on maintaining the high level of integrity that the world has come to expect from Microsoft.\n\nOur carbon negative commitment remains a call to action — for Microsoft, our customers and the broader technology sector — to invest in an affordable, reliable and sustainable power system. As we look toward 2030, that call to action has never been clearer.\n\n### **Gratitude — and momentum for the work ahead**\n\nToday’s milestone represents a shared achievement among the utility professionals, clean energy developers, community leaders, technology innovators and forward-thinking policymakers who continue the deployment of renewable energy. Meeting today’s milestone shows what partnership can deliver in bringing big ideas to life. The future of carbon-free energy is one that we will create – together.\n\n*As Microsoft’s Chief Sustainability Officer, **Melanie Nakagawa** leads the company’s targets to be carbon negative, water positive, and zero waste by 2030. She brings deep experience at the intersection of policy, business, and technology to advance climate and sustainability solutions globally.*\n\n*As President of Cloud Operations + Innovation at Microsoft, **Noelle Walsh** leads the organization that powers the global Microsoft Cloud. She oversees the company’s physical cloud infrastructure and operations, with a charter focused on safety, security, availability, sustainability, and competitive infrastructure growth—bringing decades of global operational leadership.*\n\n**Footnotes**\n\n1. *Renewable energy is defined within Microsoft’s fact sheet [https://aka.ms/SustainabilityFactsheet2025](https://aka.ms/SustainabilityFactsheet2025), which represents FY24 data.*\n2. *To date, Microsoft’s renewable energy target includes two primary categories: renewable energy from contracted projects and grid mix. The first is renewable energy delivered under PPAs or similar long-term contracting mechanisms, generally for new projects where our financial involvement in the project’s development is critical for its success. This category represents more than 90% of the renewable energy applied to achieve our 2025 target.* *The second category is “grid mix” – renewable energy supported via our standard utility relationships and rates, inclusive of policy programs such as renewable portfolio standards and state and utility decarbonization goals.* *Our 2025 100% renewable target does not include purchases from [short-term, so-called “spot market” renewable energy credits (RECs](https://blogs.microsoft.com/on-the-issues/2025/02/13/progress-on-the-road-to-2030/)) sourced from operational clean energy projects.* *With the above in mind, Microsoft leverages a straightforward formula to determine our 100% renewable energy metric on a global, annual basis. We update and further detail the methodology and assumptions behind this formula in our [annual sustainability reports](https://www.microsoft.com/en-us/corporate-responsibility/reports-hub):*[![Formula for methodology on renewable energy metric.](https://blogs.microsoft.com/wp-content/uploads/2026/02/formula.jpg)](https://blogs.microsoft.com/wp-content/uploads/2026/02/formula.jpg)\n3. *Clean energy— also referred to in this blog as carbon free energy —is defined within Microsoft’s fact sheet [https://aka.ms/SustainabilityFactsheet2025](https://aka.ms/SustainabilityFactsheet2025), which represents FY24 data.*\n4. *Reduction of reported Scope 2 emissions are calculated between FY20-25, the cumulative difference between location based and market-based emissions, excluding the use of [short-term, so-called “spot market” RECs](https://blogs.microsoft.com/on-the-issues/2025/02/13/progress-on-the-road-to-2030/)*\n\nTags: [carbon reduction](https://blogs.microsoft.com/blog/tag/carbon-reduction/), [renewable energy](https://blogs.microsoft.com/blog/tag/renewable-energy/), [sustainability](https://blogs.microsoft.com/blog/tag/sustainability/), [zero-carbon energy](https://blogs.microsoft.com/blog/tag/zero-carbon-energy/)",
  "Title": "A milestone achievement in our journey to carbon negative",
  "Description": "The post [A milestone achievement in our journey to carbon negative](https://blogs.microsoft.com/blog/2026/02/18/a-milestone-achievement-in-our-journey-to-carbon-negative/) appeared first on [Source](https://news.microsoft.com/source).",
  "FeedName": "Microsoft News",
  "FeedLevelAuthor": "Source"
}
