{
  "PubDate": "2026-02-10T18:00:02+00:00",
  "Tags": [
    "Cloud",
    "Company News"
  ],
  "Link": "https://azure.microsoft.com/en-us/blog/can-high-temperature-superconductors-transform-the-power-infrastructure-of-datacenters/",
  "EnhancedContent": "As the demand for AI and data-intensive computing is on the rise, the need for efficient and reliable power delivery is critical.\n\nAs the demand for AI and data-intensive computing is on the rise, the need for efficient and reliable power delivery is critical. Enter high-temperature superconductors (HTS), a game-changing technology that can improve energy efficiency by reducing transmission losses. Microsoft is investigating HTS technology to understand [how our datacenters can meet the growing demand for power](https://datacenters.microsoft.com/) and how to improve our operational sustainability. Superconductors offer a ‘lossless’ advantage, making power transmission more efficient.\n\n[See here how Microsoft datacenters support cloud around the globe](https://datacenters.microsoft.com/)\n\nSuperconductors let electricity flow with no resistance. This means we can move power more efficiently and increase capacity more quickly. Microsoft is exploring how this technology could make electrical grids stronger and reduce the impact datacenters have on nearby communities. Because superconductors take up less space to move large amounts of power, they could help us build cleaner, more compact systems.\n\nUsing this technology could change how power moves through the cloud and support AI and other demanding workloads. To make this possible, we need to rethink traditional power designs and how datacenters move electricity today. By working with superconducting technology partners and system integrators, we aim to turn this advanced science into real solutions that help our customers and communities.\n\n![Judy Priest, corporate vice president and chief technical officer of Cloud Operations and Innovation at Microsoft, and Erhan Karaca, vice president of engineering at VEIR, during factory test of 3MW superconducting cable](https://azure.microsoft.com/en-us/blog/wp-content/uploads/2026/02/Judy-and-Erhan-1024x683.jpg)*Judy Priest, corporate vice president and chief technical officer of Cloud Operations and Innovation at Microsoft, and Erhan Karaca, vice president of engineering at VEIR, during factory test of 3MW superconducting cable*.\n\n## How superconductors boost datacenter performance and efficiency\n\n![Reduction of datacenter impact through HTS capabilities](https://azure.microsoft.com/en-us/blog/wp-content/uploads/2026/02/architecture-1024x393.webp)*Reduction of datacenter impact through HTS capabilities*.\n\nCopper and aluminum are good conductors and are used today in most cloud infrastructure wiring and power lines. But HTS cables can do even better because they carry electricity with zero resistance. They are also smaller and lighter, and they don’t produce heat or introduce voltage drops as electricity travels through them. At the center of the technology are scalable high-availability cooling systems, maintaining HTS cables at cryogenic temperatures required to support the operational excellence of Microsoft’s datacenters. In copper, electrical current encounters resistance at every step, losing efficiency, generating heat, and limiting how much current we can move. Superconducting materials behave differently: once cooled, they create a pathway for current to move with zero resistance, eliminating losses, heat buildup, and removing limitations on how far the power can travel.\n\n### Why does this matter for datacenters specifically?\n\nHTS is not new and has been researched for decades across energy, transportation, and advanced science. Only recently the economics and manufacturing aspects of this technology made it viable at Microsoft’s cloud scale. Datacenters can benefit from HTS because they concentrate massive electrical loads in compact footprints. Traditional conductors force operators to choose between expanding substations, adding more feeders, reducing deployment densities or curtailing growth. Superconductors break this tradeoff: they increase electrical density without expanding the physical footprint, allowing modern facilities to support AI-era power requirements within the same or even smaller physical constraints.\n\nInside the datacenters, more power delivered directly to the racks supports high-density, high-performance workloads with improved efficiency. HTS cables are lighter than copper and can carry current over longer distances, enabling further optimization of power distribution across racks and pods and reducing potential bottlenecks. [We shared our vision for these novel architectures](https://youtu.be/h-DU25m4eV4?t=2618) at OCP 2025 Summit.\n\nIn practice, HTS has already demonstrated the potential to reduce the size of the power cables by an order of magnitude when delivering power directly to a server rack—opening new possibilities for how power is distributed within a datacenter.\n\n![Ruslan Nagimov, principal infrastructure engineer for Cloud Operations and Innovation at Microsoft, near world’s first HTS-powered rack-prototype (superconducting line seen above the rack)](https://azure.microsoft.com/en-us/blog/wp-content/uploads/2026/02/HTS-rack-prototype-1024x640.jpg)*Ruslan Nagimov, principal infrastructure engineer for Cloud Operations and Innovation at Microsoft, near world’s first HTS-powered rack-prototype (superconducting line seen above the rack)*.\n\n## Increasing capacity with next‑gen power infrastructure\n\nHTS technology also supports Microsoft’s long-term cloud plans. As our AI systems grow, **power is still the biggest limit** we face. By updating out power systems with superconductors, we can build electrical infrastructure that grows more easily with the rising demand for cloud services. This could even allow us to design new kinds of datacenter facilities in the future.\n\nWe need modern power systems that allow electrical capacity to scale dynamically without requiring entirely new power infrastructure. Next-gen superconducting transmission lines deliver an order of magnitude higher capacity than conventional lines at the same voltage level. In turn, they can accelerate the expansion and interconnection of datacenter sites, speeding up compute deployment to meet the growing global demand for cloud services. Superconductors represent a foundational shift for datacenters and the electrical grid, but unlocking their full potential will require reexamining traditional power system assumptions and rethinking today’s approaches to power transmission and datacenter design.\n\n> >\n> Superconductors are a category defining technology poised to transform how power is moved across the electricity value chain, stretching from generation to datacenter chips. At [VEIR](https://veir.com/stardemonstration/), we build complete power delivery solutions that take advantage of these remarkable materials, enabling customers to overcome critical bottlenecks in energy infrastructure, unlock new datacenter capacity faster, and achieve higher power and compute density.\n> >\n> Tim Hendel, CEO at VEIR (a Microsoft Climate Innovation Fund portfolio company)\n\n## Reduced impact on the grid and local communities\n\nHTS systems reduce energy loss and require significantly less physical space for power delivery. From a grid perspective, they minimize voltage drop along transmission lines and can be used to introduce fault-current limiting capabilities, with the potential to enhance overall grid stability for high-demand facilities such as datacenters, but also for nearby homes, schools, hospitals and businesses.\n\n![Superconducting cables require smaller trenches and reduce the need for intrusive overhead power lines \\[Source: AMSC, LIPA Superconductor Project\\] ](https://azure.microsoft.com/en-us/blog/wp-content/uploads/2026/02/HTS-vs-overhead-comparison.jpg)*Superconducting cables require smaller trenches and reduce the need for intrusive overhead power lines [Source: AMSC, LIPA Superconductor Project]*.\n\nMore importantly, this technology reduces the physical and social footprint of the power infrastructure, reducing the impact on local communities. Furthermore, expanding the electricity supply typically requires a complex effort that includes increasing electrical generation capacity and improving transmission and substation systems. Unlike traditional power lines, which rely on wider corridors and heavier, more visible infrastructure (tall overhead lines and expansive substations), HTS supports smaller, quieter, and far less intrusive systems. HTS transmission lines can transfer the same amount of power as conventional systems at lower voltage, reducing the setbacks and required right-of-ways. This translates to a better use of space, which reduces construction impact, shortens build timelines, and lowers pressure on surrounding communities.\n\n> >\n> Superconductors enabled ComEd to interconnect electrical grid substations in Chicago without disrupting local businesses or communities. Our proprietary solution uniquely increases grid resilience.\n> >\n> Daniel McGahn, CEO at American Superconductor Corporation ([AMSC](https://www.amsc.com/gridtec/utility-industrial-resilience-and-modernization-solutions/#regloop))\n\nWe are striving to accelerate indoor and outdoor applications of advanced power technologies like superconductors for faster and effective deployments of real-world datacenter infrastructure systems. Alongside breakthroughs in networking and cooling technologies like [hollow-core fiber](https://techcommunity.microsoft.com/blog/azurenetworkingblog/microsoft-azure-scales-hollow-core-fiber-hcf-production-through-outsourced-manuf/4455953) and [microfluidics](https://news.microsoft.com/source/features/innovation/microfluidics-liquid-cooling-ai-chips/), high-temperature superconductors complete a strategic triad of power, network, and thermal innovation in our datacenters. You may never see the power lines, but HTS technology could be working behind the scenes to keep power, capacity, and AI infrastructure efficient, resilient, and future-ready, so our customers focus on what matters most: building and running their cloud infrastructure workloads.\n\n## Explore the future of datacenters\n\nHTS is just one of the new technologies shaping the future of datacenters. As the cloud continues to grow, many other innovations—from advanced cooling systems to cleaner power solutions—are helping us build faster, smarter, and more sustainable facilities. Learn more about some of the other projects driving the next generation of datacenter design.\n\n- Learn more about [Microfluidics cooling: Cooling at the micro level for Microsoft’s datacenters](https://news.microsoft.com/source/features/innovation/microfluidics-liquid-cooling-ai-chips/).\n- Learn more about how [Microsoft Azure scales Hollow Core Fiber (HCF) production through outsourced manufacturing](https://techcommunity.microsoft.com/blog/azurenetworkingblog/microsoft-azure-scales-hollow-core-fiber-hcf-production-through-outsourced-manuf/4455953).\n- Learn more about [building community-first AI infrastructure](https://blogs.microsoft.com/on-the-issues/2026/01/13/community-first-ai-infrastructure/).\n- Get started with Azure today with a [free account](https://azure.microsoft.com/en-us/pricing/purchase-options/azure-account).",
  "Author": "stclarke",
  "ProcessedDate": "2026-02-10 18:17:44",
  "Title": "Can high-temperature superconductors transform the power infrastructure of datacenters?",
  "FeedUrl": "https://news.microsoft.com/source/feed/",
  "FeedName": "Microsoft News",
  "FeedLevelAuthor": "Source",
  "Description": "The post [Can high-temperature superconductors transform the power infrastructure of datacenters?](https://azure.microsoft.com/en-us/blog/can-high-temperature-superconductors-transform-the-power-infrastructure-of-datacenters/) appeared first on [Source](https://news.microsoft.com/source).",
  "OutputDir": "_news"
}
