{
  "PubDate": "2026-02-04T17:01:56+00:00",
  "FeedUrl": "https://news.microsoft.com/source/feed/",
  "ProcessedDate": "2026-02-04 17:15:44",
  "Tags": [
    "Company News",
    "Leadership Team"
  ],
  "Description": "The post [Updates in two of Microsoft’s core priorities](https://blogs.microsoft.com/blog/2026/02/04/updates-in-two-of-our-core-priorities/) appeared first on [Source](https://news.microsoft.com/source).",
  "EnhancedContent": "*Satya Nadella, Chairman and CEO, posted the below message to employees on Viva Engage this morning.*\n\nI am excited to share a couple updates in two of our core priorities: security and quality. Hayete Gallot is rejoining Microsoft as Executive Vice President, Security, reporting to me. I’ve also asked Charlie Bell to take on a new role focused on engineering quality, reporting to me.\n\nCharlie and I have been planning this transition for some time, given his desire to move from being an org leader to being an IC engineer. And I love how energized he is to practice this craft here day in and day out!\n\nHayete joins us from Google where she was President, Customer Experience for Google Cloud. Before that, she spent more than 15 years at Microsoft with senior leadership roles across engineering and sales, playing multiple critical roles in building two of our biggest franchises – Windows and Office, leading our commercial solution areas’ go-to-market efforts. And she was instrumental in the design and implementation of our Security Solution Area. She brings an ethos that combines product building with value realization for customers, which is critical right now.\n\nAs we shared during our quarterly earnings last week, we have great momentum in security, including progress with Security Copilot agents, strong Purview adoption, and continued customer growth, and we will build on this.\n\nWe have a deep bench of talent and leaders across our security business, and this team will now report to Hayete. Additionally, Ales Holecek will take on a new role as Chief Architect for Security, reporting to Hayete. Ales has spent years leading architecture and development across some of our most important platforms and will help bring that same sensibility to security and its connections back to our existing scale businesses and the Agent Platform.\n\nAs we shared yesterday, we have a new operating rhythm with commercial cohorts, and Hayete and her team will now be accountable for our security product rhythms as part of this process.\n\nCharlie built our Security, Compliance, Identity, and Management organization and helped rally the company behind the Secure Future Initiative. And we’re fortunate to have his continued focus and leadership on another one of our top priorities. With our Quality Excellence Initiative, we have increased accountability and accelerated progress against our engineering objectives to ensure we always deliver durable, high quality-experiences at global scale. And Charlie will partner closely with Scott Guthrie and Mala Anand on this work.\n\nI’m excited to welcome Hayete back to Microsoft to advance this mission critical work, and grateful to Charlie for all he has done for our security business and what he will continue to do for the company.\n\nSatya",
  "Title": "Updates in two of Microsoft’s core priorities",
  "Author": "stclarke",
  "OutputDir": "_news",
  "FeedLevelAuthor": "Source",
  "Link": "https://blogs.microsoft.com/blog/2026/02/04/updates-in-two-of-our-core-priorities/",
  "FeedName": "Microsoft News"
}
