{
  "FeedUrl": "https://news.microsoft.com/source/feed/",
  "ProcessedDate": "2026-02-26 18:12:27",
  "Title": "Announcing new Cloud PC devices designed for Windows 365",
  "FeedLevelAuthor": "Source",
  "Description": "The post [Announcing new Cloud PC devices designed for Windows 365](https://blogs.windows.com/windowsexperience/2026/02/26/announcing-new-cloud-pc-devices-designed-for-windows-365/) appeared first on [Source](https://news.microsoft.com/source).",
  "OutputDir": "_news",
  "PubDate": "2026-02-26T17:24:30+00:00",
  "EnhancedContent": "Skip to main content\n\nSkip to main content\n\n[!\\[Site Icon\\](https://blogs.windows.com/wp-content/uploads/sites/2/2021/06/Windows11Icon.png)](https://windows.com/) / Windows Experience Blog\n\nWindows 365\n\nFebruary 26, 2026\n\n# Announcing new Cloud PC devices designed for Windows 365\n\nBy\n\n- [Stefan Kinnestrand\n– *Vice President, Windows Commercial Marketing*](https://blogs.windows.com/windowsexperience/author/stefankinnestrand/)\n\nWhen organizations move more workloads to the cloud, they can simplify their endpoint strategy—making it easier for IT to manage and scale. To help organizations on this journey, in 2024, Microsoft introduced [Windows 365 Link](https://www.microsoft.com/en-us/windows-365/link)—the first in a new class of devices purpose-built to connect users directly to their [Windows 365 Cloud PCs](https://www.microsoft.com/en-us/windows-365/windows-365-enterprise) in seconds. This class of Cloud PC devices significantly streamlines IT management and reduces the attack surface for organizations by requiring minimal configuration, having security features on by default that cannot be disabled, and allowing no local data, no local apps, as well as no local admin users.\n\nTo give organizations more choice in secure and simple-to-manage endpoints as they adopt Windows in the cloud, Microsoft is partnering with leading commercial PC OEMs to expand the Cloud PC device portfolio. **Today,** **we are excited to announce two upcoming Cloud PC devices from ASUS and Dell**:\n\n- **[ASUS NUC 16 for Windows 365](https://www.connect.asus.com/notify-me-ASUS-NUC-16-Windows-365)** is a powerful mini-PC with an ultra-compact 0.7L design that can be deployed across diverse environments or mounted behind displays, supporting up to three displays with HDMI and USB Type-C connectivity. This Cloud PC device is targeted for general availability starting in Europe and the United States in the third quarter of 2026.\n\n![An ASUS computer.](https://blogs.windows.com/wp-content/uploads/sites/2/2026/02/Asus-image-1024x333.png)“*We’re thrilled to collaborate with Microsoft to launch the NUC 16 for Windows 365, a powerful and compact Cloud PC device designed for the modern workplace. We provide a secure, responsive environment that eliminates the need for local data storage. With its ~0.7L form factor and Microsoft Intune integration, it is the ultimate solution for efficient hot-desking and simplified IT management.*” – KuoWei Chao, General Manager of NUC Business Unit, ASUS\n\n- [**Dell Pro Desktop for Windows 365**](https://www.dell.com/en-us/blog/coming-soon-dell-s-first-windows-365-cloud-pc-device/) is a compact, fanless desktop designed for durability and quiet operation, and supporting up to three displays with versatile connectivity and flexible mount options for a streamlined workspace. This Cloud PC device is targeted for general availability in 58 countries in the third quarter of 2026.\n\n![A Dell computer.](https://blogs.windows.com/wp-content/uploads/sites/2/2026/02/dell-pro-q9m1260-desktop-c-00000ff000-bk-1020-816x1024.jpg)“*We’re excited to see the Cloud PC category continue to evolve and give organizations new, streamlined ways to create productive and secure digital workspaces. Working closely with Microsoft, we look forward to sharing more about the Dell Pro Desktop for Windows 365 and how it can help organizations simplify endpoint management while delivering a reliable, high‑quality Windows experience.*” – Elavarasu Krishnan, Vice President, Dell Software Engineering.\n\nAll Cloud PC devices boot directly to Windows 365, enabling users to work securely on a familiar Windows desktop in the Microsoft Cloud with responsive, high-fidelity experiences. They are simple and familiar to manage using Microsoft Intune and come preinstalled with a small, locked-down operating system, Windows CPC, that receives automatic updates. **Key Windows CPC operating system updates targeted for release in the second quarter of 2026** include:\n\n- Support for pairing Bluetooth® devices during the out-of-box experience\n\n- Support for tenant branding including setting a custom wallpaper, logo and name on the sign-in screen\n\n![Sign-in screen for a fictitious company.](https://blogs.windows.com/wp-content/uploads/sites/2/2026/02/Device-frame-1024x683.jpg)\n\nThe first Cloud PC device, Windows 365 Link, is currently [available in 20 countries via Microsoft or authorized resellers](https://www.microsoft.com/en-us/windows-365/link#wheretobuy) and its availability will continue expanding to new markets. We have been energized to see [organizations adopting Windows 365 and Windows 365 Link](https://www.microsoft.com/en-us/windows-365/link#Customerstories) for critical workloads across industries such as manufacturing, retail, healthcare, professional services and telecommunications. As more Cloud PC devices become available later this year, we look forward to seeing how more organizations benefit from the power, simplicity and security of Windows 365.\n\nTo learn more about Windows 365 Link, visit  the [Windows 365 website](https://aka.ms/Windows365Link).\n\nTo learn more about ASUS NUC 16 for Windows 365, visit the [ASUS website](https://www.connect.asus.com/notify-me-ASUS-NUC-16-Windows-365).\n\nTo learn more about Dell Pro desktop for Windows 365, visit the [Dell blog](https://www.dell.com/en-us/blog/coming-soon-dell-s-first-windows-365-cloud-pc-device/).",
  "Link": "https://blogs.windows.com/windowsexperience/2026/02/26/announcing-new-cloud-pc-devices-designed-for-windows-365/",
  "Tags": [
    "Company News",
    "Technology"
  ],
  "Author": "stclarke",
  "FeedName": "Microsoft News"
}
