{
  "PubDate": "2026-01-27T18:27:11+00:00",
  "Link": "https://news.xbox.com/en-us/2026/01/27/grounded-2-update-the-toxic-tangle-available-now/",
  "FeedLevelAuthor": "Source",
  "FeedUrl": "https://news.microsoft.com/source/feed/",
  "ProcessedDate": "2026-01-27 19:08:27",
  "Description": "The post [Grounded 2 update – The Toxic Tangle – now available](https://news.xbox.com/en-us/2026/01/27/grounded-2-update-the-toxic-tangle-available-now/) appeared first on [Source](https://news.microsoft.com/source).",
  "OutputDir": "_news",
  "Title": "Grounded 2 update – The Toxic Tangle – now available",
  "FeedName": "Microsoft News",
  "EnhancedContent": "![]()\n\nSkip to main content\n\n[!\\[\\](https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RE1Mu3b?ver=5c31)](https://microsoft.com) [Xbox Wire](https://news.xbox.com/en-us/)\n\n- Visit:\n- https://x.com/xboxwire\n- https://whatsapp.com/channel/0029VakfW7e5K3ze30Dp1247\n\n- Share:\n- https://www.twitter.com/share?url=https://news.xbox.com/en-us/2026/01/27/grounded-2-update-the-toxic-tangle-available-now/\n- https://api.whatsapp.com/send?text=Grounded%202%20Update:%20The%20Toxic%20Tangle%20–%20Available%20Now%20https://news.xbox.com/en-us/2026/01/27/grounded-2-update-the-toxic-tangle-available-now/\n\n### Summary\n\n- The Toxic Tangle update is available now, expanding *Grounded 2* with a massive new Garden biome to explore, new creatures and gear, the mysterious Tang effect, and much more.\n- Ride into danger on the Ladybug Buggy, a heavy-duty mount with a water cannon, ramming charge, and serious tank energy.\n- The Founder’s Pack has been updated, with new decorative unlocks for players ready to show off their park style.\n\nThe garden is awake.\n\nOminent’s experiments have taken a sour turn, and a strange new corruption is spreading across Brookhollow Park. Tang now stains the soil, seeps into water, and clings to unsuspecting creatures—and it’s up to you to survive whatever’s brewing beneath the surface.\n\n![](https://xboxwire.thesourcemediaassets.com/sites/2/2026/01/G2_EARWIG_ARMOR-1c79006d08702b1fc708-1900x1080.jpg)\n\nWelcome to The Toxic Tangle, the first major content update for *Grounded 2*, available now for all players. This update expands the park with a new biome, new creatures, armor and weapons, trinkets, building sets, and a few threats that may be more than they appear.\n\n## **A Whole New Garden**\n\nOvergrown vines choke the greenhouse, creating twisting paths and hidden crawlspaces. These massive monstrosities and staggering structures all combine to produce that ‘*how did I get up there?*’ moment. The Garden biome is ripe for exploration, stacked with vertical climbs, secret stashes, and probably a bug or two you didn’t see coming.\n\n![](https://xboxwire.thesourcemediaassets.com/sites/2/2026/01/G2_PumpkinTrellis-f28becd44225c64fdf6a-1900x1080.jpg)\n\nFrom the pumpkin patch to the carrot jungle, every corner offers something to harvest, hoard, or accidentally aggro. It’s big, it’s messy, and it’s absolutely crawling with trouble. Bring your best gear—and maybe a backup plan.\n\n## **The Ladybug Buggy Rolls In**\n\nOne of *Grounded’s* most iconic bugs is finally rideable—and she’s not here to play nice.\n\n![](https://xboxwire.thesourcemediaassets.com/sites/2/2026/01/G2_Ladybug_Action-3c5da198aeb20afc2c0b-1900x1080.jpg)\n\nThe Ladybug Buggy is a heavy-duty, tank-style mount equipped with a pressurized water cannon. Use it to blast airborne pests out of the sky, rinse away sour Tang buildup, or just give your enemies a bad day. It can also ram headfirst into foes with a powerful charge and slowly regenerates health over time.\n\nIf you ever jumped on a ladybug in the first *Grounded* and wished you could stay there, this one’s for you.\n\n## **New Threats (and Familiar Faces)**\n\nThe Garden is full of life, but not all of it wants to share the space.\n\nNew creatures like the coordinated Earwigs, the bulky Potato Beetles, and the soon-to-be  fan-favorite, the Woolly Aphid, will challenge your reflexes, your timing, and your trust in anything with antennae.\n\nYou might also want to keep your eyes open. The Masked Stranger may have retreated after your first encounter, but she’s not gone—and she may not be alone.\n\nOh, and the Snake Colossus? You’ll know it when you see it. Probably right before it sees you.\n\n![](https://xboxwire.thesourcemediaassets.com/sites/2/2026/01/G2_WoollyAphid-d16b64ab3b22c3785a0a-1900x1080.jpg)\n\n## **Mutation Updates, BUILD.M Upgrades & More**\n\nMutations have leveled up. They’re now split into active and passive types—actives still work the way you know and love, but passives now apply automatically based on your weapon loadout. That means less menu juggling and more time doing cool stuff, like perfect blocking a Tang-covered Rust Beetle or showing off your hybrid build mid-fight.\n\nAnd for all the architects, decorators, and “I-just-need-one-more-wall-piece” players out there, this update’s for you. The builder toolkit gets a serious upgrade with new kits like the Pumpkin Set, a refreshed Mushroom Kit, Scale Roof Set, updated Acorn Stairs, and a community request for floor hatches. It’s all about more pieces, better parity between sets, and smoother snapping to bring your backyard blueprints to life.\n\nWhether you’re crafting a greenhouse hideout, a pumpkin fortress, or a garden party palace, we can’t wait to see what you build—and share. Tag us, drop it in Discord, or show it off wherever you hang out. We’ll be watching (with admiration, not binoculars).\n\nThe Garden MIX.R and O.R.C. wave challenges are also live, ready for anyone who thinks they’re tough enough to survive the swarm.\n\nLastly, the Founder’s Pack also grows with this update, adding new base-building items like the High Roller’s Dice Bag, Champion’s Banner, and more ways to personalize your park adventure.\n\n## **What’s Next?**\n\nAlongside this update, we’re preparing for the return of Playgrounds Mode, entering PTB (Public Test Beta) in February with all the core tools from the first *Grounded*. Whether you’re building mini-games, boss arenas, or custom gauntlets, Playgrounds will give creators the tools they need to thrive. To keep an eye on what’s coming to Brookhollow Park, be sure to check out our updated roadmap for a sneak peek at what’s in store for *Grounded 2*.\n\nThere’s never been a better time to shrink down, suit up, and explore the weirdest corners of Brookhollow Park. The Toxic Tangle update for *Grounded 2* is available now in Game Preview for Xbox Series X|S, Xbox on PC, and Xbox Cloud, and in early access on Steam —jump in today with Xbox Game Pass and untangle the chaos.\n\n[!\\[Grounded 2\\](https://store-images.s-microsoft.com/image/apps.54353.14609679373210979.beb28026-7f6b-4b1f-b526-43d0d04b269b.6dcfd9cd-f291-4121-b9d8-a09dd620a5c3?w=400&#038;h=600)](https://www.microsoft.com/en-us/store/apps/9P77PG7DK0W2)\n\n![Xbox Play Anywhere](https://assets.onestore.ms/cdnfiles/sfw-service-web-onestore-onerf-2017-11-8-12/store/common/images/xpalogo_black.png)\n\n## Grounded 2\n\nXbox Game Studios\n\n☆☆☆☆☆ 510\n\n★★★★★\n\n$29.99\n\n[Get it now](https://www.microsoft.com/en-us/store/apps/9P77PG7DK0W2)\n\nPC Game Pass\n\nXbox Game Pass\n\nShrunk again, but the world is much larger. Survive a sprawling open world alone or in co-op with friends. Craft weapons, forge armor, and build bases while exploring the park on your trusty Buggy mounts. Unravel hidden mysteries and face unexpected threats. But something else is out there—and it hasn’t forgotten you. Shrunk to the size of an ant, you’ll find once-familiar spaces turned into a sprawling, uncharted frontier. Survive alone or in co-op with friends, crafting weapons, forging armor, and building bases as you explore manmade playgrounds overgrown by nature. Traverse this new realm on trusty Buggy mounts—your capable allies—and uncover the mysteries lurking beneath bright colors and towering structures. But stay wary: something else is out there, and it hasn’t forgotten you.\n\nSurvive, Adapt, Overcome The world is relentless, but so are you. Shape your adventure with unique archetypes, each offering distinct abilities to match your playstyle. Whether you rely on precision, cunning, or sheer strength, you’ll need every advantage to survive against the threats lurking in the park.\n\nStronger Together The perils of the park are daunting alone, but with friends, every challenge becomes an adventure. Work together to build, fight, and uncover the secrets buried beneath the grass. Whether you’re facing danger side by side or continuing your journey in a shared world, survival is always better with allies.\n\nBecause Walking is Bogus They scurry, they fight, and now—they help you survive. Hatch, raise, and ride your own insect friends – Buggies! Saddle up and traverse through the park, fight on them or alongside them in battle, or use them to gather resources and build your base. The right partner could mean the difference between thriving and barely surviving.\n\nA Shadow That Follows You The threat is always there—watching, learning, waiting. You don’t know where it’s coming from, only that it never leaves. The deeper you dig, the closer it gets. Some mysteries should stay buried, but it’s too late now. It knows you’re looking. And it’s ready. Every answer drags you deeper, every step invites something closer. You were never alone. You thought you were in control. You were wrong.\n\n![]()\n\n![]()",
  "Tags": [
    "Company News",
    "Gaming"
  ],
  "Author": "stclarke"
}
