{
  "Description": "The post [ID@Xbox program celebrates games from across the African diaspora](https://news.xbox.com/en-us/2026/02/23/xbox-developer-acceleration-program-black-history-month-games/) appeared first on [Source](https://news.microsoft.com/source).",
  "Tags": [
    "Company News",
    "Gaming"
  ],
  "FeedName": "Microsoft News",
  "OutputDir": "_news",
  "ProcessedDate": "2026-02-23 18:17:35",
  "FeedUrl": "https://news.microsoft.com/source/feed/",
  "Title": "ID@Xbox program celebrates games from across the African diaspora",
  "EnhancedContent": "![]()\n\nSkip to main content\n\n[!\\[\\](https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RE1Mu3b?ver=5c31)](https://microsoft.com) [Xbox Wire](https://news.xbox.com/en-us/)\n\n- Visit:\n- https://x.com/xboxwire\n- https://whatsapp.com/channel/0029VakfW7e5K3ze30Dp1247\n\n- Share:\n- https://www.twitter.com/share?url=https://news.xbox.com/en-us/2026/02/23/xbox-developer-acceleration-program-black-history-month-games/\n- https://api.whatsapp.com/send?text=ID@Xbox%20Developer%20Acceleration%20Program%20Celebrates%20Games%20from%20Across%20the%20African%20Diaspora%20https://news.xbox.com/en-us/2026/02/23/xbox-developer-acceleration-program-black-history-month-games/\n\nBlack artists have had a tremendous impact in art forms such as film and music, with Black culture and stories reaching audiences around the world in record numbers. This interest in diverse content and perspectives is not exclusive to those industries, but the barriers faced in game development are very real. The good news is that Black developers, despite the challenges, are now finding more ways to create and share games that celebrate their culture, uplift their stories and are simply fun.\n\nThe impact of Black developers in gaming dates back to Gerald Lawson and his role in designing the Fairchild Channel F and pioneering the first video game cartridges. In many ways, Black developers today are part of Mr. Lawson’s legacy and represent an inclusive future for our industry, where more stories make more players feel seen and included.\n\nAs the Director of the ID@Xbox Developer Acceleration Program, I have been fortunate to visit, speak to and partner with developers from around the world in places like Nigeria, South Africa, Brazil and here in the United States, including cities such as Detroit, Oakland, Atlanta and Houston. The passion, stories, culture and gameplay experiences that are being created are the fresh perspectives and new voices that our industry needs to bring the joy and community of gaming to everyone on the planet.\n\nThe Developer Acceleration Program is dedicated to empowering developers across the globe, enabling them to share their unique stories and perspectives with a broader audience. Since its inception, the Developer Acceleration Program has provided support to more than 300 developers spanning six continents. This commitment has already resulted in the launch of over 100 games, each benefiting from the program’s guidance and resources.\n\nAs part of the celebration of Black History Month, the Developer Acceleration Program is proud to shine a spotlight on DAP Partners and their games from across the African diaspora.\n\n## [**Relooted**](https://www.xbox.com/en-us/games/store/relooted/9ppp5344b3ls)\n\n![Relooted Key Art](https://xboxwire.thesourcemediaassets.com/sites/2/2026/02/Relooted-a8cfb3dd6a10904e4ce1-1900x1080.jpg)\n\n**Please give us a brief description of your game.**\n\nReclaim real African artifacts from Western museums in this Africanfuturist heist game. Recruit crew members, plan escape routes, acquire the precious cargo, and bounce out of the joint as fast as you can.\n\n**What sets your game apart?**\n\n*Relooted* features very unique non-violent puzzle/action gameplay – the puzzle comes in figuring out the plan for your heist, and the action comes in executing it. Nyamakop is a South African team primarily but, working on *Relooted,* we’ve been lucky to have people from over a dozen African countries contribute to the project! That was important because the game’s core theme – African artifact repatriation – is one that affects all African countries. A final favorite fact about the game is that all the artifacts in the game are real! These artifacts have such great stories and history to them that it’s easy to think they were made up, but they are real objects that you can see in museums (maybe not the right museum though).\n\n**How has the Developer Acceleration Program impacted your game creation journey?**\n\nThe Xbox team has been so amazing to work with! The program has given us the space to enhance the game and make it better. I think without the support from the Developer Acceleration Program team it’s quite possible we wouldn’t have been able to even finish *Relooted* – so in some ways the impact of DAP was fundamental to us.\n\n**What’s ahead for your game?**\n\nThe game is out now! Stop reading and start reclaiming – it’s out on Xbox Game Pass & it’s Xbox Play Anywhere.\n\n## **Space Warlord Baby Trading Simulator**\n\n![Space Warlord Key Art](https://xboxwire.thesourcemediaassets.com/sites/2/2026/02/Space-Warlord-bd360d52bb95b9d9475e-1900x1080.jpg)\n\n**Please give us a brief description of your game.**\n\n*Space Warlord Baby Trading Simulator*is a sci-fi day trading sim where the stock market, deprived of other speculative goods, decides to go all-in on alien babies. Buy low and sell high as your trade interface simulates their adorable, dystopian lives in this arcade satire of real-life economics!\n\n**What sets your game apart?**\n\nWe are the only game in history to let you short a baby, and for that, I am sorry. You can also hire consultants from across the galaxy to help you deal with fluctuating market conditions like time randomly changing, the market flipping up-side down, and a spate of powerful births producing babies that live 150% longer.\n\n**How has the Developer Acceleration Program impacted your game creation journey?**\n\nWe make games that run the gamut from fast-paced revenge thrillers ([*I Am Your Beast*](https://www.xbox.com/en-us/games/store/i-am-your-beast/9pf9fqgh89wm)) to absurdist lo-fi sandbox comedy ([*An Airport for Aliens Currently Run by Dogs*](https://www.xbox.com/en-us/games/store/an-airport-for-aliens-currently-run-by-dogs/9n7647pbrxq6)). ID@Xbox – and the Developer Acceleration Program – has supported us in each part of that journey, and trusted us to bring worthwhile experiences to players, even when those projects were unusual, or didn’t follow a trend. That belief is why our studio is still here today, 6 years after our founding, and why we can feel confident making a game where you short a baby – because we trust that to be something unique and cool our players deserve to see.\n\n**What’s ahead for your game?**\n\nWe’re currently available on Steam, but you can expect a fully-featured Xbox Play Anywhere port in the very near future, including all the features and content we’ve been adding in the game’s post-launch cycle, including a daily challenge!\n\n## [**Aerial\\_Knight’s DropShot**](https://www.xbox.com/en-us/games/store/aerial_knights-dropshot/9p59j86ghdgl)\n\n![Dropshot Key Art](https://xboxwire.thesourcemediaassets.com/sites/2/2026/02/Dropshot-0ffa21b31929aeaffa21-1900x1080.jpg)\n\n**Please give us a brief description of your game.**\n\n*Aerial\\_Knight’s DropShot* is a high-speed, stylized FPS / Race where you play as Smoke Wallace. As a kid, he was bitten by a radioactive dragon, turning his skin purple and giving him the power to fire bullets from his fingertips. Thrown into deadly sky battles for revenge, you race rivals, fight dragons, move fast, shoot smart, and look cool when you land.\n\n**What sets your game apart?**\n\nUnmatched style, wild story, and unique gameplay that mixes racing, gunplay, and ducks.\n\n**How has the Developer Acceleration Program impacted your game creation journey?**\n\nWithout the Developer Acceleration Program, this game most likely doesn’t get made. I’m really grateful that funding like this exists for gamers to get a lot of different options in new games to play made by devs from many different backgrounds.\n\n**What’s ahead for your game?**\n\nMy game just launched with Xbox Game Pass and Xbox Play Anywhere. It’s something I’m really proud of, and all I want is to keep making games that people enjoy that highlight different types of characters and cultures that many games don’t offer.\n\n## **Beatdown City Survivors**\n\n![Beatdown City Survivors Key Art](https://xboxwire.thesourcemediaassets.com/sites/2/2026/02/Beatdown-city-survivors-ab96016b969e95c99c93-1900x1080.jpg)\n\n**Please give us a brief description of your game.**\n\n*Beatdown City Survivors* is ‘Escape from New York’ meets *Dead Rising* with “survivors-like” gameplay, filled with environmental destruction and over-the-top weapon crafting.\n\n**What sets your game apart?**\n\nIn *Beatdown City Survivors*,players explore a procedurally generated post-apocalyptic city where everything in your environment can be destroyed – which will help or hurt you. Hydrants, cars, streetlights, air conditioners, and more can be used to drench things in water, light things on fire, send electricity through everything, and freeze everything in its path. There’s also a lot of toxic waste. Stay away from that. Because it’s a city, players get weapons like knives, folding chairs, fireworks, chanclas, legally distinct construction boots, pigeons and more. But wait!\n\nHave you ever wondered what would happen if you gave a flock of bloodthirsty pigeons a set of knives? Or if you strapped a giant construction boot to a bunch of fireworks and just let it loose? Or, and I know this sounds out there, what if you shoved a giant pipe into a soda bottle, creating a makeshift fire extinguisher? You can get the answers to these questions, and more. And I want to emphasize the *more*part. Every weapon can combine with any other weapon to make a long list of more powerful (and funnier) weapons.\n\nPlus, *Beatdown City Survivors* has a banger of a soundtrack, harkening back to games like *NBA Street* and Tony Hawk, with a plethora of underground hip-hop tracks from some of the best rappers and producers on the planet.\n\n**How has the Developer Acceleration Program impacted your game creation journey?**\n\nIn the uncertainty of the industry today, I have the great honor of being supported by the Developer Acceleration Program. The funds are why we can make the game at the level of execution we’re able to.\n\n**What’s ahead for your game?**\n\n*Beatdown City Survivors* is looking to be out not too long from now, so keep a look out! You can follow shawndoublea on [Bluesky](https://bsky.app/profile/shawndoublea.bsky.social) and [Instagram](https://www.instagram.com/shawndoublea/) for more updates!\n\n## **Black Spades**\n\n![Black Spades Key Art](https://xboxwire.thesourcemediaassets.com/sites/2/2026/02/Black-Spades-e16bff91e4bf5f5d4a74-1900x1080.jpg)\n\n**Please give us a brief description of your game.**\n\n*Black Spades* is a card game rooted in the African American community’s heritage of classic card game, Spades. Yep, that’s right! Spades the way your friends and family play at home, college, reunions, and holiday get-togethers – with Jokers, Wild Deuces, Reneg calling, and more!\n\nFrom the beginner playing at home, to the expert playing across the nation, *Black Spades* was created to get you straight to the action with no gimmicks. Designed with authentic rules, realistic gameplay, and heavy social interaction, *Black Spades* has become a standout offering for Spades enthusiasts.\n\n**What sets your game apart?**\n\n*Black Spades* is the first and only game published on any platform that features Spades rules and terminology found in the African American culture. Our mission is to help preserve and extend the history of Spades within African American culture, and to become the only digital entity to house the most comprehensive collection of African American Spades rules.\n\n*Black Spades* is a cross-platform online multiplayer game. Xbox users can play against other players on various devices, such as mobile phones, computers, and handhelds.\n\nHere is a list of our key features:\n\n- Reneg Calling (Play the wrong suit and kiss those 3 books goodbye. If you get caught.)\n- Live Voice Chat (talk yo’ stuff in realtime!)\n- Partner Play (Choose or find a partner to play multiplayer matches with you)\n- Locations (Play in different locations to win exclusive tables, coin jackpots, and become the mayor!)\n- Leaderboards with bonus prizes! (Daily, Weekly and Monthly)\n- Goals (Flex your skill, and luck, to win the big jackpot)\n- Smack Talk!!! (Choose from over 20+ phrases.)\n- Custom soundtrack (Featuring an original track by “David Banner”)\n\n**How has the Developer Acceleration Program impacted your game creation journey?**\n\nAs an indie developer and publisher, the Developer Acceleration Program has been instrumental in helping us bring *Black Spades* to Xbox. Their belief in the game –combined with their extensive resources and financial support – made it possible to successfully transition *Black Spades* from mobile to console.\n\nKonsole Kingz took a nontraditional path to Xbox game publishing, and DAP ensured that path was not only viable but achievable. Through their monthly Green Room sessions, they consistently demystified the Xbox development and publishing process, clearly outlining the tools, requirements, and best practices needed to launch successfully on the platform. It’s a ton of information to take in, but they deliver it in bite-size chunks.\n\n**What’s ahead for your game?**\n\n*Black Spades* has joined the Xbox Insider Program to help us test, refine, and polish the game before we launch in the summer. Please reach out to us via Black Spades’ social media handles to request access to the demo and give us your feedback on [X](https://nam06.safelinks.protection.outlook.com/?url=https%3A%2F%2Fx.com%2Fblackspadesgame&amp;data=05%7C02%7CAnnette.Gonzalez%40microsoft.com%7Cbf6f8ec92b5f433a4bc708de6f36e445%7C72f988bf86f141af91ab2d7cd011db47%7C1%7C0%7C639070478719009505%7CUnknown%7CTWFpbGZsb3d8eyJFbXB0eU1hcGkiOnRydWUsIlYiOiIwLjAuMDAwMCIsIlAiOiJXaW4zMiIsIkFOIjoiTWFpbCIsIldUIjoyfQ%3D%3D%7C0%7C%7C%7C&amp;sdata=euN36Utd5OrgBxrYAbXOPlVh81BW7mLKt341mIZccag%3D&amp;reserved=0), [Instagram](https://nam06.safelinks.protection.outlook.com/?url=https%3A%2F%2Fwww.instagram.com%2Fblackspadesgame&amp;data=05%7C02%7CAnnette.Gonzalez%40microsoft.com%7Cbf6f8ec92b5f433a4bc708de6f36e445%7C72f988bf86f141af91ab2d7cd011db47%7C1%7C0%7C639070478719035485%7CUnknown%7CTWFpbGZsb3d8eyJFbXB0eU1hcGkiOnRydWUsIlYiOiIwLjAuMDAwMCIsIlAiOiJXaW4zMiIsIkFOIjoiTWFpbCIsIldUIjoyfQ%3D%3D%7C0%7C%7C%7C&amp;sdata=qlsuHznhN4Q4tBfXs9U7d0RWNLcegzDi6o7joROcBRA%3D&amp;reserved=0), or [Facebook](https://nam06.safelinks.protection.outlook.com/?url=https%3A%2F%2Fwww.facebook.com%2Fblackspadesgame&amp;data=05%7C02%7CAnnette.Gonzalez%40microsoft.com%7Cbf6f8ec92b5f433a4bc708de6f36e445%7C72f988bf86f141af91ab2d7cd011db47%7C1%7C0%7C639070478719046493%7CUnknown%7CTWFpbGZsb3d8eyJFbXB0eU1hcGkiOnRydWUsIlYiOiIwLjAuMDAwMCIsIlAiOiJXaW4zMiIsIkFOIjoiTWFpbCIsIldUIjoyfQ%3D%3D%7C0%7C%7C%7C&amp;sdata=V5v5PqQlI%2BcVT1zoqpiKR6nOazz8fSYjtxiT4S8L3%2BU%3D&amp;reserved=0).\n\nWishlist *Black Spades* on all Xbox platforms. Lastly, download *Black Spades* on your mobile device now, create an account, and play a few games. You’ll be ahead of the game and launch day ready!\n\n## **Blind Frontiers**\n\n![Blind Frontiers Key Art](https://xboxwire.thesourcemediaassets.com/sites/2/2026/02/BlindFrontiers-c9139a67da0e9c3ad2f6-1900x1080.jpg)\n\n**Please give us a brief description of your game.**\n\n*Blind Frontiers* is a premium, single-player RPG blending survival mechanics with a road-trip structure. Players follow Niuma, a gifted mechanic, pursuing the elusive Golden City to escape increasingly harsh living conditions in a post-conflict world shaped by scarcity and shifting social norms.\n\n**What sets your game apart?**\n\nIn *Blind Frontiers*, survival is not about combat, but about how the world chooses to see you. The game features two interdependent gameplay phases: road survival and city interactions. Each city has its own social norms, traditions, and expectations. Navigating them is key to progression, while choices made on the road shape the resources, opportunities, and constraints players carry into those cities.\n\nMeet the griots, who transmit knowledge through oral storytelling, uniquely revealing the mysteries of the *Blind Frontiers* universe.\n\n**How has the Developer Acceleration Program impacted your game creation journey?**\n\nJoining the Developer Acceleration Program has been a game-changer for *Blind Frontiers*. The program provides us with unparalleled support, from funding to hands-on guidance, as well as access to dedicated conferences that help us fully understand and leverage the resources and opportunities offered by DAP.\n\nAs a Black woman in game development, being taken seriously can be a challenge, and DAP’s backing has made a tangible difference. From our first meetings to pitching the game, we truly felt heard, which has given us the confidence to navigate the industry and advance *Blind Frontiers* toward release.\n\n**What’s ahead for your game?**\n\n*Blind Frontiers* is in active development! We’ll be updating our content across social media soon. In the meantime, you can follow us on Instagram [@BlindFrontiers](https://www.instagram.com/blindfrontiers) and join our Discord community [here](https://nam06.safelinks.protection.outlook.com/?url=https%3A%2F%2Fdiscord.com%2Finvite%2FBBp5t8mUWn&amp;data=05%7C02%7CAnnette.Gonzalez%40microsoft.com%7C5ff293a814074c070c0408de6228cb80%7C72f988bf86f141af91ab2d7cd011db47%7C1%7C0%7C639056125106485654%7CUnknown%7CTWFpbGZsb3d8eyJFbXB0eU1hcGkiOnRydWUsIlYiOiIwLjAuMDAwMCIsIlAiOiJXaW4zMiIsIkFOIjoiTWFpbCIsIldUIjoyfQ%3D%3D%7C0%7C%7C%7C&amp;sdata=RV4utUOmFb%2FekaFjJqWYZJJIorVGNkV6Au4OGFyz9dw%3D&amp;reserved=0) to stay up to date on our next big announcement and events.\n\n## **High Elo Girls**\n\n![High Elo Girls Key Art](https://xboxwire.thesourcemediaassets.com/sites/2/2026/02/High-Elo-Girls-5fe43907c06ea2e9fbd7-1900x1080.jpg)\n\n**Please give us a brief description of your game.**\n\n*High Elo Girls* is an esports-themed visual novel where you play as the latest recruit for an all-women’s MOBA (multiplayer online battle arena) team.  Your instincts as a recruit will be tested though through multiple choice matches, and your sensitivity as a teammate and friend through dialogue options with your team.  Both will define what type of player you become, and whether or not you’ll reach your esports ambitions.\n\n**What sets your game apart?**\n\n*High Elo Girls* is an approachable, story-focused introduction to the world of esports for newcomers, but with an attention to detail for those who are already longtime fans of the scene!  We let players take part in a narrative-heavy game inspired by both slice-of-life and sports dramas, meet distinct and charming characters, take part in low-stakes hangouts and high-stakes rivalries, all with a breezy, nostalgic summer vibe.\n\n**How has the Developer Acceleration Program impacted your game creation journey?**\n\nWe’re a very small team who started this project with limited resources. The program gave us the opportunity to make *High Elo Girls* much closer to our vision and bring on additional talented creatives to help us bring our game over the finish line. We’re so excited to be able to bring our game to a wider audience than we could have imagined!\n\n**What’s ahead for your game?**\n\nWe’re looking to release *High Elo Girls* on Xbox and PC in the first half of 2026. You can learn more about the game and keep up to date with the release date on our Bluesky [here](https://bsky.app/profile/split-fate.bsky.social).\n\n## **One Beat Min**\n\n![One Beat Min Key Art](https://xboxwire.thesourcemediaassets.com/sites/2/2026/02/OneBeatMin-47db38cc8856037bb077-1900x1080.jpg)\n\n**Please give us a brief description of your game.**\n\n*One Beat Min*is an explosive 2D rhythm-fighting game about beatbox battles. Players step into the shoes of an up-and-coming musical master in a hip-hop world moved by the beat, fighting stylish rivals while managing Cred and Hype. Mechanically, the game unites the strategy of versus combat with the energy of rhythm: players create attack sequences where the beat boosts the impact of the sounds. It is a dynamic system where the opponent must read the movement and counterattack with style to dominate the battle.\n\n**What sets your game apart?**\n\nThe innovative fusion between two beloved genres excites us, but the soul of the project lies in the characters and their identities. The universe is vibrant and culturally rich, offering a fresh Afro-diasporic perspective where music and beats drive the combat. Each character brings a unique sound and visual style to the arena, showing that everyone has their own way to shine.\n\n**How has the Developer Acceleration Program impacted your game creation journey?**\n\nThe Developer Acceleration Program has helped us understand the best strategy for our game and allowed us to break down barriers that often prevent our stories from reaching a wider audience. Programs like DAP are essential to support more and more developers in telling narratives that, due to a lack of support, would end up forgotten. We feel proud to be part of this and are immensely grateful!\n\n**What’s ahead for your game?**\n\nWe are currently fine-tuning the beat! As we refine our game, we invite everyone to Wishlist One Beat Min on the Xbox Store to be the first to know when the battle begins. You can also follow [Sue The Real Studios](https://x.com/suethereal) on social media for behind-the-scenes updates and character reveals. Get ready to drop the beat!\n\n## **Hit-Em-Up Highrise**\n\n![Hit-Em-Up Highrise Key Art](https://xboxwire.thesourcemediaassets.com/sites/2/2026/02/Hit-Em-Up-Highrise-703836b36df33700b996-1900x1080.jpg)\n\n**Please give us a brief description of your game.**\n\nA brutal neo-retro brawler, set in a futuristic prison with a dystopian ’90s game show theme that incorporates slick combos, drip customization, and roguelike randomized paths, weapons, enemies, and rewards so every run is a new experience.\n\n**What sets your game apart?**\n\n*Hit-Em-Up Highrise* is a run-based experience where the player must start at the bottom of a high-rise prison as a newly admitted inmate and fight their way to the top, floor by floor, to earn their freedom. To progress, the player must perform in action-based physical challenges to unlock randomized gear, defeat bosses, and manage their cash winnings to upgrade their drip (sneakers and hats) to define a build that will help them progress, as well as customize their cell and save money to purchase new items each run.\n\n**How has the Developer Acceleration Program impacted your game creation journey?**\n\nThe Developer Acceleration Program helped us push from prototype to development rapidly, and provided morale boosting inspiration to push past barriers in production to get us closer to completing the game.\n\n**What’s ahead for your game?**\n\nThe game is close to complete, we will have a solid, polished build soon, and hope to announce the release date, features and have more gameplay locked in to share with the people.\n\n![]()\n\n![]()",
  "PubDate": "2026-02-23T17:27:19+00:00",
  "Link": "https://news.xbox.com/en-us/2026/02/23/xbox-developer-acceleration-program-black-history-month-games/",
  "Author": "stclarke",
  "FeedLevelAuthor": "Source"
}
