{
  "PubDate": "2026-01-08T17:47:49+00:00",
  "FeedName": "Microsoft News",
  "FeedUrl": "https://news.microsoft.com/source/feed/",
  "Tags": [
    "Company News",
    "Gaming"
  ],
  "EnhancedContent": "![]()\n\nSkip to main content\n\n[!\\[\\](https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RE1Mu3b?ver=5c31)](https://microsoft.com) [Xbox Wire](https://news.xbox.com/en-us/)\n\n- Visit:\n- https://x.com/xboxwire\n- https://whatsapp.com/channel/0029VakfW7e5K3ze30Dp1247\n\n- Share:\n- https://www.twitter.com/share?url=https://news.xbox.com/en-us/2026/01/08/xbox-developer-direct-2026/\n- https://api.whatsapp.com/send?text=Developer_Direct%20Returns%20January%2022:%20Watch%20Fable,%20Forza%20Horizon%206,%20and%20Beast%20of%20Reincarnation%20Gameplay,%20Direct%20from%20the%20Studios%20https://news.xbox.com/en-us/2026/01/08/xbox-developer-direct-2026/\n\n2026 is going to be an incredible year for Xbox players – you might even call it a… fabled year. To celebrate, we’re kicking it off with the fourth installment of our Developer\\_Direct broadcast on January 22, bringing you news, new gameplay, and insights directly from the incredible teams working on titles coming this year.\n\nPresented by the game creators themselves, Developer\\_Direct will once again give you an inside look at not just the games, but the studios working to bring them to life. Fittingly for Xbox’s 25th anniversary year, that includes the return of some of our most legendary franchises, which rub shoulders with a brand new title from one of Japan’s most beloved studios.\n\nThe show includes not one but *two* titles from Playground Games, with the UK studio bringing us a first extended look at ***Fable***, as well as the debut of gameplay for ***Forza Horizon 6***. We’ll also be taking a trip to Tokyo to visit the legendary Game Freak, offering a first in-depth look at ***Beast of Reincarnation***, which we [revealed at Xbox Games Showcase last year](https://news.xbox.com/en-us/2025/06/08/xbox-games-showcase-2025-recap-everything-announced/).\n\nYou can tune in at **10am Pacific / 1pm Eastern / 6pm UK on January 22** to see all the latest on:\n\n***Fable*** *–* Playground Games welcomes players back to the fairytale land of Albion, with the first in-depth look at *Fable* – one of 2026’s most anticipated titles. Devs from the Playground team will unveil the magic and mischief that awaits players in this fresh new beginning for the franchise, including a first look at some stunning new gameplay. Of course, the core themes of Fable will all be there – choice, consequence, drama, action, British humor and (of course) chickens, all reimagined for existing fans and new players alike.\n\n***Forza Horizon 6*** *–* The Forza team from Playground Games will share a deep-dive on the much-anticipated *Forza Horizon 6* as the open world racer takes players to the beautiful and contrasting landscapes of Japan. The segment will deep-dive into a very first look at gameplay, including reveals of new features – and how Japan comes to life in this stunning new installment.\n\n***Beast of Reincarnation*** *–* Join us as we delve into Game Freak’s intense one-person, one-dog action RPG. For the first time, Game Freak will reveal details of our protagonist Emma’s innovative plant manipulation actions and gameplay with her canine companion, Koo. In *Beast of Reincarnation*, a profound and dangerous world unfolds in post-apocalyptic Japan. Discover the development secrets behind its creation in Developer\\_Direct.\n\nStay tuned to our official social channels for more from Developer\\_Direct, airing on Thursday, January 22 at 10am Pacific / 1pm Eastern / 6pm UK.",
  "FeedLevelAuthor": "Source",
  "Description": "The post [Xbox Developer_Direct broadcast returns Jan. 22](https://news.xbox.com/en-us/2026/01/08/xbox-developer-direct-2026/) appeared first on [Source](https://news.microsoft.com/source).",
  "Author": "stclarke",
  "OutputDir": "_news",
  "Title": "Xbox Developer_Direct broadcast returns Jan. 22",
  "ProcessedDate": "2026-01-08 18:03:17",
  "Link": "https://news.xbox.com/en-us/2026/01/08/xbox-developer-direct-2026/"
}
