{
  "FeedName": "Microsoft News",
  "Link": "https://news.microsoft.com/source/2026/01/22/microsoft-and-mercedes-amg-petronas-f1-team-unite-to-drive-innovation-from-factory-to-circuit/",
  "Tags": [
    "Company News",
    "Press releases"
  ],
  "FeedLevelAuthor": "Source",
  "OutputDir": "_news",
  "ProcessedDate": "2026-01-22 09:07:01",
  "Description": "The post [Microsoft and Mercedes-AMG PETRONAS F1 Team unite to drive innovation from factory to circuit](https://news.microsoft.com/source/2026/01/22/microsoft-and-mercedes-amg-petronas-f1-team-unite-to-drive-innovation-from-factory-to-circuit/) appeared first on [Source](https://news.microsoft.com/source).",
  "Author": "stclarke",
  "Title": "Microsoft and Mercedes-AMG PETRONAS F1 Team unite to drive innovation from factory to circuit",
  "EnhancedContent": "**REDMOND, Wash., and BRACKLEY, U.K. — Jan. 22, 2026** **—** Microsoft Corp. and the Mercedes-AMG PETRONAS F1 Team on Thursday announced a multiyear partnership that puts Microsoft’s technologies at the heart of race team operations. Through this new collaboration, the companies aim to drive efficiencies and innovations that will help drive performance and amplify the excitement for the more than 800 million Formula 1 fans worldwide.\n\nThe 2026 Formula 1 regulation changes usher in a new era of racing for the sport, with increased electrification, efficiency and sustainability, representing one of the most significant technical evolutions in modern Formula 1 history. As the Mercedes-AMG PETRONAS F1 Team prepares for this transformation, it is partnering with Microsoft to harness the power of its trusted cloud and enterprise AI technologies across the business, from the factory to the racetrack.\n\n![](https://news.microsoft.com/source/wp-content/uploads/2026/01/car-logo-1024x576.jpg)Microsoft Logo on Mercedes-AMG PETRONAS Formula 1 Car\n\n“Our sport is driven by those who lead through innovation,” said Toto Wolff, CEO and Team Principal, Mercedes-AMG PETRONAS F1 Team. “We are delighted to partner with Microsoft, one of the world’s foremost technology leaders, whose name is synonymous with groundbreaking innovation. This partnership also reflects our commitment to staying at the forefront of performance and progress. By putting Microsoft’s technology at the center of how we operate as a team, we will create faster insights, smarter collaboration and new ways of working as we look ahead to the next generation in F1.”\n\nIn a sport where races are decided by tenths of a second and every decision is data driven, Formula 1 represents the ultimate stress test for modern enterprise systems: extreme data volumes, real-time decision making, global operations and zero margin for error. United by the belief that technology is a competitive advantage, Microsoft and the Mercedes-AMG PETRONAS F1 Team will look to set a new standard for how enterprise technology drives performance at the highest levels of competition.\n\n“This partnership puts Microsoft’s cloud and enterprise AI technologies at the heart of racing performance, where milliseconds matter and data determines outcomes,” said Judson Althoff, CEO, Microsoft commercial business. “Together with the Mercedes-AMG PETRONAS F1 Team, we are harnessing data and turning it into real-time intelligence that powers faster decisions, smarter strategies and sustained competitive advantage — both on and off the track.”\n\n### **Racing at the speed of data**\n\nModern Formula 1 cars are defined by precision and pace. Each Mercedes-AMG PETRONAS F1 Team car carries more than 400 sensors, generating over 1.1 million data points per second. From tire degradation and aerodynamic behavior to Energy Recovery System deployment and evolving track conditions, every variable must be interpreted in real time.\n\nMicrosoft Azure and its AI capabilities will expand the Team’s existing high-performance computing and data capabilities, both the factory and trackside, with scalable cloud and AI resources supporting simulation workloads, performance analysis, race strategy modeling and cross-team analytics. The flexibility and agility of this platform will help ensure engineers and strategists have real-time insights available at the moments that matter most.\n\n“It is a privilege to welcome Microsoft into the Mercedes-AMG PETRONAS F1 Team partner ecosystem,” said Richard Sanders, Chief Commercial Officer, Mercedes-AMG PETRONAS F1 Team. “Microsoft’s technology already plays a central role in how we operate as a business, and this partnership opens new opportunities to innovate as we look toward the next era of technological development. I look forward to seeing how our teams collaborate to unlock new ways of working across the organization.”\n\n### **Fueling human ambition**\n\nMicrosoft 365 and GitHub already underpin many of the Mercedes-AMG PETRONAS F1 Team’s engineering and operational workflows across its headquarters in Brackley and Brixworth, as well as trackside in the paddock. Building on this foundation, the team will expand its use of Microsoft 365 to unlock new levels of agility, accelerate innovation and enhance operational efficiency across the business.\n\nMicrosoft’s GitHub development tools and platforms help engineers innovate faster, optimize performance and push the boundaries of design, modeling and simulation. Going forward, the team’s engineering, simulation and software development groups will deepen their integration of GitHub to modernize and accelerate development workflows enabling greater consistency, speed and efficiency.\n\n![](https://news.microsoft.com/source/wp-content/uploads/2026/01/drivers_PR-911x683.jpg)Kimi Antonelli and George Russell in Driver Kits with Microsoft Logo\n\n### **Scaling for performance**\n\nWorking with Microsoft Azure to accelerate AI technology experimentation and scale, the Mercedes-AMG PETRONAS F1 Team used real-time sensor data and Azure cloud tools to pilot intelligent virtual sensors, enabling rapid testing without waiting for new on-premises infrastructure.\n\nWith Azure Kubernetes Service (AKS), they were able to easily adjust computing power, scaling up when demand is high and down when it’s not, delivering meaningful technological advancements while meeting strict financial and regulatory requirements.\n\n### **From road to track**\n\nFor more than 30 years, Microsoft and Mercedes-Benz have collaborated across the automotive value chain, from AI-powered smart factories and electric vehicle telemetry to onboard vehicle intelligence and cloud-enabled engineering systems. From the factory floor to Formula 1, this new partnership builds on that foundation, bringing the same innovative mindset and digital capabilities into the world’s premier motorsport.                                       ****\n\n**About the Mercedes-AMG PETRONAS F1 Team**\n\nMercedes was born to race — and we’ve been doing it since 1901. Today, the Mercedes-AMG PETRONAS F1 Team competes at the pinnacle of motorsport: the FIA Formula One World Championship.\n\nThe pioneering spirit of our company founders lives on in our commitment to innovation and performance. As the world’s original automobile manufacturer, Mercedes-Benz has defined the cutting edge of technology for over a century. Today, our F1 team exists to demonstrate the best of the brand’s performance on the global stage.\n\nBased in Brackley and Brixworth, UK, over 2,000 committed team members work with a singular mission: to win the world championship. From 2014 to 2021, we secured a record eight consecutive Constructors’ Championships, and we are hungry for more.\n\nOur journey is not just about performance on the track; we also strive to make a positive impact on the world and inspire future generations. We are proud signatories of the Climate Pledge, and we are leading the way in building a more sustainable and inclusive sport.\n\nFor more information, please visit [www.mercedesamgf1.com](http://www.mercedesamgf1.com).\n\n**About Microsoft**\n\nMicrosoft (Nasdaq “MSFT” @microsoft) creates platforms and tools powered by AI to deliver innovative solutions that meet the evolving needs of our customers. The technology company is committed to making AI available broadly and doing so responsibly, with a mission to empower every person and every organization on the planet to achieve more.\n\n**For more information, press only:**\n\nMicrosoft Media Relations, **We. Communications** for Microsoft, (425) 638-7777, [\\[email protected\\]](/cdn-cgi/l/email-protection#275546574e4355425457484954426750420a5048554b43504e43420944484a)\n\nAdam McDaid, Head of Media Relations & Editorial, [\\[email protected\\]](/cdn-cgi/l/email-protection#fa9b97999e9b939eba979f88999f9e9f899b979d9ccbd4999597), +44 (0) 7918 335 332\n\n*Note to editors:* For more information, news and perspectives from Microsoft, please visit Microsoft Source at [https://news.microsoft.com/source](https://news.microsoft.com/source). Web links, telephone numbers and titles were correct at time of publication but may have changed. For additional assistance, journalists and analysts may contact Microsoft’s Rapid Response Team or other appropriate contacts listed at [https://news.microsoft.com/microsoft-public-relations-contacts](https://news.microsoft.com/microsoft-public-relations-contacts).",
  "FeedUrl": "https://news.microsoft.com/source/feed/",
  "PubDate": "2026-01-22T08:25:28+00:00"
}
