{
  "Tags": [
    "Company News",
    "Security"
  ],
  "PubDate": "2026-03-19T15:10:37+00:00",
  "FeedLevelAuthor": "Source",
  "OutputDir": "_news",
  "FeedUrl": "https://news.microsoft.com/source/feed/",
  "ProcessedDate": "2026-03-19 15:20:02",
  "Author": "stclarke",
  "Title": "When tax season becomes cyberattack season: beware these lures",
  "Link": "https://www.microsoft.com/en-us/security/blog/2026/03/19/when-tax-season-becomes-cyberattack-season-phishing-and-malware-campaigns-using-tax-related-lures/",
  "EnhancedContent": "During tax season, threat actors reliably take advantage of the urgency and familiarity of time-sensitive emails, including refund notices, payroll forms, filing reminders, and requests from tax professionals, to trick targets into opening malicious attachments, scanning QR codes, or following multi-step link chains. Every year, there is an observable uptick in tax-themed campaigns as Tax Day (April 15) approaches in the United States, and this year is no different.\n\nIn recent months, Microsoft Threat Intelligence identified email campaigns using lures around W-2, tax forms, or similar themes, or posing as government tax agencies, tax services firms, and relevant financial institutions. Many campaigns target individuals for personal and financial data theft, but others specifically target accountants and other professionals who handle sensitive documents, have access to financial data, and are accustomed to receiving tax-related emails during this period.\n\nIdentified campaigns were designed to harvest credentials or deliver malware. [Phishing-as-a-service (PhaaS) platforms](https://www.microsoft.com/en-us/security/blog/2026/03/04/inside-tycoon2fa-how-a-leading-aitm-phishing-kit-operated-at-scale/) continue to be prevalent, enabling highly convincing credential theft and multifactor authentication (MFA) bypass campaigns through tailored tax-themed social engineering lures, attachments, and phishing pages. In cases of malware delivery, we noted a continued trend of abusing legitimate remote monitoring and management tools (RMMs), which allow threat actors to maintain persistence on a compromised device or network, enable an alternative command-and-control method, or, in the case of hands-on-keyboard attacks, use as an interactive remote desktop session.\n\n## INSIDE TYCOON 2FA\n\n[How a leading AiTM phishing kit operated at scale ›](https://www.microsoft.com/en-us/security/blog/2026/03/04/inside-tycoon2fa-how-a-leading-aitm-phishing-kit-operated-at-scale/)\n\nThis blog details several of the campaigns observed by Microsoft Threat Intelligence in the past few months that leveraged the tax season for social engineering. By educating users about phishing lures, configuring essential email security settings, and defending against credential theft, individuals and organizations can defend against both this seasonal surge in phishing attacks and more broadly against many types of phishing attacks that we observe.\n\n## A wide range of tax-themed campaigns\n\n### CPA lures leading to Energy365 phishing kit\n\nIn early February 2026, we observed a campaign that was delivering the Energy365 PhaaS phishing kit and used tax and Certified Public Accountant (CPA) lures throughout the attack chain. This campaign stood out due to its highly specific lure customization, in contrast to other threat actors who use this popular phishing kit but employ generic lures. Other notable characteristics of this campaign include the involvement of multiple file formats such as Excel and OneNote, use of legitimate infrastructure such as OneDrive, and multiple rounds of user interaction, all attempts to complicate automated and reputation-based detection. While this specific campaign was not large, it represents the capabilities of Energy365, one of the leading phishing kits that enables hundreds of thousands of malicious emails observed by Microsoft daily.\n\nBetween February 5 and 6, several hundred emails with the subject ”See Tax file” targeted multiple industries including financial services, education, information technology (IT), insurance, and healthcare, primarily in the United States. The Excel attachment had the file name *[Accountant’s name] CPA.xlsx*, using the name of a real accountant (likely impersonated in this campaign without their knowledge). The attachment contained a clickable “REVIEW DOCUMENTS” button that linked to a OneNote file hosted on OneDrive.\n\nThe OneNote file, which continued the ruse by using the same CPA’s name and logo, contained a link leading to a malicious landing page that hosted the Energy365 phishing kit and attempted to harvest credentials such as email and password.\n\n![](https://www.microsoft.com/en-us/security/blog/wp-content/uploads/2026/03/Fig1.webp)*Figure 1. The OneNote file contained the Microsoft logo, a link, and a specific accountant’s name and logo (redacted)*\n\n### QR code and W2 lure leading to SneakyLog phishing kit\n\nOn February 10, 2026, Microsoft Threat Intelligence observed tax-themed phishing emails sent to approximately 100 organizations, in the manufacturing, retail, and healthcare industries primarily in the United States. The emails used the subject “2025 Employee Tax Docs” and contained an attachment named *2025\\_Employee\\_W-2  .docx*. The attachment had content that mentioned various tax-related terms like Form W-2 and had a QR code pointing to a phishing page.\n\nEach document was customized to contain the recipient’s name, and the URL hidden behind the QR code also contained the recipient’s email address. This means that each recipient received a unique attachment. The phishing page was built with the SneakyLog PhaaS platform and mimicked the Microsoft 365 sign-in page to steal credentials. SneakyLog, which is also known as Kratos, has been around since at least the beginning of 2025. This phishing kit is sold as a part of phishing-as-a-service and is capable of harvesting credentials and 2FA. While not as popular as other platforms like Energy365, SneakyLog has been consistently present in the threat landscape.\n\n![](https://www.microsoft.com/en-us/security/blog/wp-content/uploads/2026/03/Fig2-1.webp)*Figure 2. Document attachment containing tax lure, user personalization, and a QR code linking to phishing page*\n\n### Form 1099-themed phishing delivering ScreenConnect\n\nIn January and February 2026, Microsoft Threat Intelligence observed sets of tax-themed domains registered, likely to be used in tax-themed phishing campaigns. These domains used keywords such as “tax” and “1099form” and also impersonated specific legitimate companies involved in tax filing, accounting, investing sectors. Brand abuse of legitimate accounting, tax preparation, finance, bookkeeping, and related companies continues to proliferate during tax season.\n\nWe observed one of these domains being used in a campaign between February 8 and February 10. Several hundred emails were sent to recipients in a wide range of industries primarily in the United States. The emails used subject lines like “Your Account Now Includes Updated Tax Forms [RF] 1234” or “Your Form 1099-R is ready – [RF] 12123123”. The email body said “2025 Tax Forms is ready” and contained a clickable “View Tax Forms” button that linked to the URL *taxationstatments2025[.]com*. If clicked, this domain redirected to *tax-statments2025[.]com,* which in turn served a malware executable named *1099-FR2025.exe*.\n\nThe payload delivered in this campaign is the remote management and monitoring (RMM) tool ScreenConnect, signed by ConnectWise. The specific code signing certificate has since been revoked by the issuer due to high abuse. ScreenConnect is a legitimate tool, but threat actors have learned to abuse RMM functionality and essentially turn legitimate tools into remote access trojans (RATs), helping them take control of compromised devices.\n\n![](https://www.microsoft.com/en-us/security/blog/wp-content/uploads/2026/03/Fig3.jpg)*Figure 3. Email impersonating Fidelity and enticing users to click the button to view tax forms* ![](https://www.microsoft.com/en-us/security/blog/wp-content/uploads/2026/03/Fig4-1.webp)*Figure 4. The final landing page leading to download of 1099-FR2025.exe*\n\n### IRS and cryptocurrency-themed phishing delivering SimpleHelp\n\nAnother notable campaign combined the impersonation of the US Internal Revenue Service (IRS) with a cryptocurrency lure. Notably, this campaign attempted to evade detection by not including a clickable link, but instead asked recipients to copy and paste a URL, which was in the email body, into the browser.\n\nThis campaign was sent on February 23 and 27, and it consisted of several thousands of emails sent to recipients exclusively in the United States. The emails targeted many industries, with the bulk of email sent to higher education. The emails used the subject “IR-2026-216” and abused online platform Eventbrite to masquerade as coming from the IRS:\n\n- “IRS US”&lt;noreply@campaign[.]eventbrite[.]com&gt;\n- “IRS GOV”&lt;noreply@campaign[.]eventbrite[.]com&gt;\n- “Service”&lt;noreply@campaign[.]eventbrite[.]com&gt;\n- “IRS TAX”&lt;noreply@campaign[.]eventbrite[.]com&gt;\n- “.IRS.GOV”&lt;noreply@campaign[.]eventbrite[.]com&gt;\n\nThe email body said “Cryptocurrency Tax Form 1099 is Ready” and contained a non-clickable URL with the domain *irs-doc[.]com* or *gov-irs216[.]net*. If pasted in the browser, the URL led to the download of *IRS-doc.msi*, which was either the RMM tool ScreenConnect or SimpleHelp, depending on the day of the campaign. SimpleHelp is another legitimate remote monitoring and management tool abused by threat actors. While not as popular as ScreenConnect, threat actors have been increasingly adopting SimpleHelp due to the recent crackdown on abuse of ScreenConnect by ConnectWise.\n\n![](https://www.microsoft.com/en-us/security/blog/wp-content/uploads/2026/03/Fig5-1.webp)*Figure 5. Email impersonating IRS and additionally using a “Cryptocurrency Tax Form 1099” lure*\n\n### Campaign targeting CPAs and delivering Datto\n\nLike in previous tax seasons, Microsoft Threat Intelligence observed email campaigns specifically targeting accountants and related organizations. A variant of this campaign is a well-known and documented technique that uses benign conversation starters. The threat actor reaches out asking for assistance in filing taxes, asking for a quote, and typically providing a backstory. If the actor receives a reply, they send a malicious link that leads to the installation of various RATs. However, Microsoft Threat Intelligence also observed campaigns targeting CPAs that contain a similar backstory but include the malicious link in the first email.\n\nOne such campaign was sent on March 9 and consisted of approximately 1,000 emails sent to users exclusively in the United States. The emails targeted multiple accounting companies but also included a few related industries such as financial services, legal, and insurance. The emails used the subject “REQUEST FOR PROFESSIONAL TAX FILLING”.\n\nThe email provided a backstory that included a description of a complex tax return situation involving tax audit, university tuition, loan interest, and real estate income. The sender also attempted to explain their inability to physically visit the office due to travel. Finally, the sender asked for a price quote. We observed variations of the backstory on different days, including switching CPAs due to fee increases.\n\nThe link in email used the free site hosting service *carrd[.]co*. The site contained a simple “VIEW DOCUMENTS” button that linked to a URL shortener service, which redirected users to *private-adobe-client[.]im*. This uncomplicated redirection chain served to hinder automated detection by using legitimate sites with good reputation and involving user interaction. The final landing page served an executable related to the Datto. Datto is yet another legitimate remote monitoring and management tool, abused by threat actors.\n\n![](https://www.microsoft.com/en-us/security/blog/wp-content/uploads/2026/03/Fig6-1.webp)*Figure 6. Email sent to a CPA requesting tax filing assistance*\n\n### IRS-themed campaign targeting accounting professionals and dropping ScreenConnect\n\nOn February 10, 2026, Microsoft Threat Intelligence observed a large-scale phishing campaign sent to more than 29,000 users across 10,000 organizations, almost exclusively focused on targets in the United States (95% of targets). The campaign did not concentrate on any single sector but instead included a wide set of industries, with financial services (19%), technology and software (18%), and retail and consumer goods (15%) being the most commonly targeted.\n\nWhile the campaign did not seem to have been targeting a specific industry, an analysis of intended recipients indicated that the campaign was targeting specific roles, particularly accountants and tax preparers. Messages in the campaign were sent in two waves over a nine‑hour window between 10:35 UTC and 19:51 UTC.\n\nThe emails impersonated the IRS, claiming that potentially irregular tax returns had been filed under the recipient’s Electronic Filing Identification Number (EFIN). Recipients were instructed to review these returns by downloading a purportedly legitimate “IRS Transcript Viewer.”\n\n![](https://www.microsoft.com/en-us/security/blog/wp-content/uploads/2026/03/Fig7-1.webp)*Figure 7. Sample campaign phishing email*\n\nThe emails were sent through Amazon Simple Email Service (SES) from one of two sender addresses on *edud[.]site*, a domain registered in August 2025. To enhance credibility, the sender display name rotated among the following 14 IRS‑themed identities:\n\n- IRS e-File Services\n- IRS EFIN Team\n- IRS EFIN Compliance\n- IRS e-Services\n- IRS E-File Operations\n- IRS Filing Review\n- IRS Filing Support\n- IRS EFIN Support\n- IRS e-Services Team\n- IRS e-File Support\n- IRS EFIN Review\n- IRS e-File Compliance\n- IRS e-Services Support\n- IRS Practitioner e-Services\n\nSimilarly, the subject lines used in the campaign also rotated, presumably to try and circumvent detection systems that rely on static text signatures. The most common among the 49 email subjects we observed in this campaign include:\n\n- IRS Request Transcript Review\n- IRS Notice Firm Return Review\n- CPA Compliance Review\n- IRS Support Firm Filing Review\n- Review Requested Compliance\n\nThe emails contained a “Download IRS Transcript View 5.1” button, which purported to lead to a legitimate IRS application that could be used to review the transcript referenced in the email. Instead, the link pointed to an Amazon SES click‑tracking URL (*awstrack[.]me*), which then redirected to *smartvault[.]im*, a malicious look‑alike domain mimicking SmartVault, a well‑known tax and document‑management service used by accounting professionals. To evade automated analysis, the phishing site used Cloudflare for bot detection and blocking. Only visitors who resembled human users would be able to reach the final phishing payload, while traffic from crawlers and sandboxes would result in a block page.\n\nUsers who passed the bot check would be shown a fake “verification” animation that indicated the IRS website was conducting an automated check to verify the connection with IRS provider services. After this animation, a user would be shown a page indicating that the supposed transcript viewer application would start downloading automatically before being redirected to the legitimate IRS provider services webpage. The downloaded file, named *TranscriptViewer5.1.exe*, was not a legitimate IRS tool but a maliciously repackaged ScreenConnect remote access tool (RAT). Upon execution, this payload could grant attackers remote control of the victim system, enabling data theft, credential harvesting, and further post‑exploitation activity.\n\n![](https://www.microsoft.com/en-us/security/blog/wp-content/uploads/2026/03/Fig8a.webp) ![](https://www.microsoft.com/en-us/security/blog/wp-content/uploads/2026/03/Fig8b-1.webp)*Figure 8. Example campaign verification and download “success” pages.*\n\n## How to protect users and organization against tax-themed campaigns\n\nTo defend against social engineering campaigns that leverage the surge in email activity during Tax Season, Microsoft recommends the following mitigation measures:\n\n- Configure [automatic attack disruption](https://learn.microsoft.com/en-us/defender-xdr/configure-attack-disruption) in Microsoft Defender XDR. Automatic attack disruption is designed to contain attacks in progress, limit the impact on an organization’s assets, and provide more time for security teams to remediate the attack fully.\n- Enforce multifactor authentication (MFA) on all accounts, remove users excluded from MFA, and strictly [require MFA](https://learn.microsoft.com/azure/active-directory/identity-protection/howto-identity-protection-configure-mfa-policy) from all devices in all locations at all times.\n- Use the [Microsoft Authenticator app for passkeys and MFA](https://learn.microsoft.com/en-us/entra/identity/authentication/how-to-enable-authenticator-passkey), and complement MFA with conditional access policies, where sign-in requests are evaluated using additional identity-driven signals.\n- Conditional access policies can also be scoped to [strengthen privileged accounts with phishing resistant MFA](https://learn.microsoft.com/en-us/entra/identity/conditional-access/policy-admin-phish-resistant-mfa#create-a-conditional-access-policy).\n- Enable [Zero-hour auto purge (ZAP)](https://learn.microsoft.com/en-us/defender-office-365/zero-hour-auto-purge) in Office 365 to quarantine sent mail in response to newly acquired threat intelligence and retroactively neutralize malicious phishing, spam, or malware messages that have already been delivered to mailboxes.\n- Configure Microsoft Defender for Office 365 Safe Links to [recheck links on click](https://learn.microsoft.com/microsoft-365/security/office-365-security/safe-links-about). Safe Links provides URL scanning and rewriting of inbound email messages in mail flow and time-of-click verification of URLs and links in email messages, other Microsoft Office applications such as Teams, and other locations such as SharePoint Online. Safe Links scanning occurs in addition to the regular [anti-spam](https://learn.microsoft.com/microsoft-365/security/office-365-security/anti-spam-protection-about) and [anti-malware](https://learn.microsoft.com/microsoft-365/security/office-365-security/anti-malware-protection-about) protection in inbound email messages in Microsoft Exchange Online Protection (EOP). Safe Links scanning can help protect your organization from malicious links that are used in phishing and other attacks.\n- Invest in advanced anti-phishing solutions that monitor and scan incoming emails and visited websites. For example, organizations can leverage web browsers like Microsoft Edge that automatically [identify and block malicious websites](https://learn.microsoft.com/en-us/deployedge/microsoft-edge-security-smartscreen?ocid=magicti_ta_learndoc), including those used in this phishing campaign, and solutions that [detect and block malicious emails, links, and files](https://www.microsoft.com/en-us/security/business/siem-and-xdr/microsoft-defender-office-365?ocid=magicti_ta_abbreviatedmktgpage).\n- Encourage users to use Microsoft Edge and other web browsers that support [Microsoft Defender SmartScreen](https://learn.microsoft.com/deployedge/microsoft-edge-security-smartscreen?ocid=magicti_ta_learndoc), which identifies and blocks malicious websites, including phishing sites, scam sites, and sites that host malware.\n- Enable [network protection](https://learn.microsoft.com/defender-endpoint/enable-network-protection) to prevent applications or users from accessing malicious domains and other malicious content on the internet.\n\n## Microsoft Defender detection and hunting guidance\n\n[Microsoft Defender](https://www.microsoft.com/security/business/microsoft-defender) customers can refer to the list of applicable detections below. Microsoft Defender XDR coordinates detection, prevention, investigation, and response across endpoints, identities, email, apps to provide integrated protection against attacks like the threat discussed in this blog.\n\n| **Tactic** | **Observed activity** | **Microsoft Defender coverage** | | --- | --- | --- | | Initial access | Phishing emails | **[Microsoft Defender for Office 365](https://www.microsoft.com/security/business/siem-and-xdr/microsoft-defender-office-365)** <br>– A potentially malicious URL click was detected <br>– Email messages containing malicious URL removed after delivery <br>– Email messages removed after delivery <br>– A user clicked through to a potentially malicious URL<br>– Suspicious email sending patterns detected Email reported by user as malware or phish | | Execution | Delivery of RMM tools for post-compromise activity | **[Microsoft Defender for Endpoint](https://www.microsoft.com/security/business/endpoint-security/microsoft-defender-endpoint)**<br>– Suspicious installation of remote management software<br>– Remote monitoring and management software suspicious activity<br>– Suspicious location of remote management software<br>– Suspicious usage of remote management software<br>– Suspicious command execution via ScreenConnect |\n\n### Microsoft Security Copilot\n\n[Microsoft Security Copilot is embedded in Microsoft Defender](https://learn.microsoft.com/defender-xdr/security-copilot-in-microsoft-365-defender) and provides security teams with AI-powered capabilities to summarize incidents, analyze files and scripts, summarize identities, use guided responses, and generate device summaries, hunting queries, and incident reports.\n\nCustomers can also [deploy AI agents](https://learn.microsoft.com/defender-xdr/security-copilot-agents-defender), including the following [Microsoft Security Copilot agents](https://learn.microsoft.com/copilot/security/agents-overview), to perform security tasks efficiently:\n\n- [Threat Intelligence Briefing agent](https://learn.microsoft.com/defender-xdr/threat-intel-briefing-agent-defender)\n- [Phishing Triage agent](https://learn.microsoft.com/defender-xdr/phishing-triage-agent)\n- [Threat Hunting agent](https://learn.microsoft.com/defender-xdr/advanced-hunting-security-copilot-threat-hunting-agent)\n- [Dynamic Threat Detection agent](https://learn.microsoft.com/defender-xdr/dynamic-threat-detection-agent)\n\nSecurity Copilot is also available as a [standalone experience](https://learn.microsoft.com/en-us/copilot/security/experiences-security-copilot) where customers can perform specific security-related tasks, such as incident investigation, user analysis, and vulnerability impact assessment. In addition, Security Copilot offers [developer scenarios](https://learn.microsoft.com/copilot/security/developer/custom-agent-overview) that allow customers to build, test, publish, and integrate AI agents and plugins to meet unique security needs.\n\n### Threat intelligence reports\n\nMicrosoft Defender XDR customers can use the following threat analytics reports in the Defender portal (requires license for at least one Defender XDR product) to get the most up-to-date information about the threat actor, malicious activity, and techniques discussed in this blog. These reports provide the intelligence, protection information, and recommended actions to prevent, mitigate, or respond to associated threats found in customer environments:\n\n- [Threat Overview Profile: On-premises credential theft](https://security.microsoft.com/threatanalytics3/9382203e-5155-4b5e-af74-21562b1004d5/overview)\n- [Technique Profile: Abuse of remote monitoring and management tools](https://security.microsoft.com/threatanalytics3/44b8f927-5ab5-46bb-bb79-7ca2d4e30156/overview)\n\nMicrosoft Security Copilot customers can also use the [Microsoft Security Copilot integration](https://learn.microsoft.com/defender/threat-intelligence/security-copilot-and-defender-threat-intelligence?bc=%2Fsecurity-copilot%2Fbreadcrumb%2Ftoc.json&amp;toc=%2Fsecurity-copilot%2Ftoc.json#turn-on-the-security-copilot-integration-in-defender-ti) in Microsoft Defender Threat Intelligence, either in the Security Copilot standalone portal or in the [embedded experience](https://learn.microsoft.com/defender/threat-intelligence/using-copilot-threat-intelligence-defender-xdr) in the Microsoft Defender portal to get more information about this threat actor.\n\n### Hunting queries\n\n#### Microsoft Defender XDR\n\nMicrosoft Defender XDR customers can run the following [advanced hunting](https://learn.microsoft.com/defender-xdr/advanced-hunting-overview) queries to find related activity in their networks:\n\n**Find email messages related to known domains**\n\nThe following query checks domains in Defender XDR email data:\n\n```\n\nEmailUrlInfo | where UrlDomain has_any (\"taxationstatments2025.com\", \"irs-doc.com\", \"gov-irs216.net\", \"private-adobe-client.im\", \"edud.site\", \"smartvault.im\") ```\n\n**Detect file hash indicators in email data**\n\nThe following query checks hashes related to identified phishing activity in Defender XDR data:\n\n```\n\nlet File_Hashes_SHA256 = dynamic([ \"45b6b4db1be6698c29ffde9daeb8ffaa344b687d3badded2f8c68c922cdce6e0\", \"d422f6f5310af1e72f6113a2a592916f58e3871c58d0e46f058d4b669a3a0fd8\"]); DeviceFileEvents | where SHA256 has_any (File_Hashes_SHA256) ```\n\n#### Microsoft Sentinel\n\nMicrosoft Sentinel customers can use the TI Mapping analytics (a series of analytics all prefixed with ‘TI map’) to automatically match the indicators mentioned in this blog post with data in their workspace. If the TI Map analytics are not currently deployed, customers can install the Threat Intelligence solution from the [Microsoft Sentinel Content Hub](https://learn.microsoft.com/azure/sentinel/sentinel-solutions-deploy) to have the analytics rule deployed in their Sentinel workspace.\n\nThe following queries use [Sentinel Advanced Security Information Model (ASIM) functions](https://learn.microsoft.com/azure/sentinel/normalization) to hunt threats across both Microsoft first-party and third-party data sources. ASIM also supports deploying parsers to specific workspaces [from GitHub](https://aka.ms/DeployASIM), using an ARM template or manually.\n\n**Detect network IP and domain indicators of compromise using ASIM**\n\nThe following query checks IP addresses and domain IOCs across data sources supported by ASIM network session parser:\n\n```\n\n//IP list and domain list- _Im_NetworkSession let lookback = 30d; let ioc_ip_addr = dynamic([]); let ioc_domains = dynamic([\"taxationstatments2025.com\", \"irs-doc.com\", \"gov-irs216.net\", \"private-adobe-client.im\"]); _Im_NetworkSession(starttime=todatetime(ago(lookback)), endtime=now()) | where DstIpAddr in (ioc_ip_addr) or DstDomain has_any (ioc_domains) | summarize imNWS_mintime=min(TimeGenerated), imNWS_maxtime=max(TimeGenerated), EventCount=count() by SrcIpAddr, DstIpAddr, DstDomain, Dvc, EventProduct, EventVendor ```\n\n**Detect Web Sessions IP and file hash indicators of compromise using ASIM**\n\nThe following query checks IP addresses, domains, and file hash IOCs across data sources supported by ASIM web session parser:\n\n```\n\n//IP list - _Im_WebSession let lookback = 30d; let ioc_ip_addr = dynamic([]); let ioc_sha_hashes =dynamic([\"45b6b4db1be6698c29ffde9daeb8ffaa344b687d3badded2f8c68c922cdce6e0\"]); _Im_WebSession(starttime=todatetime(ago(lookback)), endtime=now()) | where DstIpAddr in (ioc_ip_addr) or FileSHA256 in (ioc_sha_hashes) | summarize imWS_mintime=min(TimeGenerated), imWS_maxtime=max(TimeGenerated), EventCount=count() by SrcIpAddr, DstIpAddr, Url, Dvc, EventProduct, EventVendor ```\n\n**Detect domain and URL indicators of compromise using ASIM**\n\nThe following query checks domain and URL IOCs across data sources supported by ASIM web session parser:\n\n```\n\n// file hash list - imFileEvent // Domain list - _Im_WebSession let ioc_domains = dynamic([\"taxationstatments2025.com\", \"irs-doc.com\", \"gov-irs216.net\", \"private-adobe-client.im\"]); _Im_WebSession (url_has_any = ioc_domains) ```\n\n**Detect files hashes indicators of compromise using ASIM**\n\nThe following query checks IP addresses and file hash IOCs across data sources supported by ASIM file event parser:\n\n```\n\n// file hash list - imFileEvent let ioc_sha_hashes = dynamic([\"45b6b4db1be6698c29ffde9daeb8ffaa344b687d3badded2f8c68c922cdce6e0\"]); imFileEvent | where SrcFileSHA256 in (ioc_sha_hashes) or TargetFileSHA256 in (ioc_sha_hashes) | extend AccountName = tostring(split(User, @'')[1]), AccountNTDomain = tostring(split(User, @'')[0]) | extend AlgorithmType = \"SHA256\" ```\n\n## Indicators of compromise\n\n| **Indicator** | **Type** | **Description** | **First seen** | **Last seen** | | --- | --- | --- | --- | --- | | 45b6b4db1be6698c29ffde9daeb8ffaa344b687d3badded2f8c68c922cdce6e0 | SHA-256 | Excel attachment in Energy365 PhaaS campaign | 2026-02-05 | 2026-02-06 | | taxationstatments2025[.]com | Domain | Fidelity-themed ScreenConnect campaign | 2026-02-08 | 2026-02-10 | | irs-doc[.]com | Domain | IRS / Cryptocurrency-themed SimpleHelp campaign | 2026-02-23 | 2026-02-27 | | gov-irs216[.]net | Domain | IRS / Cryptocurrency-themed SimpleHelp campaign | 2026-02-23 | 2026-02-27 | | private-adobe-client[.]im | Domain | CPA-targeted campaign delivering Datto | 2026-03-05 | 2026-03-09 | | d422f6f5310af1e72f6113a2a592916f58e3871c58d0e46f058d4b669a3a0fd8 | SHA-256 | EXE dropped in IRS ScreenConnect campaign | 2026-02-10 | 2026-10 | | edud[.]site | Domain | Domain hosting email addresses used to send phishing emails in IRS ScreenConnect campaign | 2026-02-10 | 2026-02-10 | | smartvault[.]im | Domain | Domain hosting malicious content in IRS ScreenConnect campaign | 2026-02-10 | 2026-02-10 |\n\n### Learn more\n\nFor the latest security research from the Microsoft Threat Intelligence community, check out the [Microsoft Threat Intelligence Blog](https://aka.ms/threatintelblog).\n\nTo get notified about new publications and to join discussions on social media, follow us on [LinkedIn](https://www.linkedin.com/showcase/microsoft-threat-intelligence), [X (formerly Twitter)](https://x.com/MsftSecIntel), and [Bluesky](https://bsky.app/profile/threatintel.microsoft.com).\n\nTo hear stories and insights from the Microsoft Threat Intelligence community about the ever-evolving threat landscape, listen to the [Microsoft Threuat Intelligence podcast](https://thecyberwire.com/podcasts/microsoft-threat-intelligence).",
  "FeedName": "Microsoft News",
  "Description": "The post [When tax season becomes cyberattack season: beware these lures](https://www.microsoft.com/en-us/security/blog/2026/03/19/when-tax-season-becomes-cyberattack-season-phishing-and-malware-campaigns-using-tax-related-lures/) appeared first on [Source](https://news.microsoft.com/source)."
}
