{
  "FeedName": "Microsoft News",
  "Title": "Update to shared commitment to safer gaming",
  "PubDate": "2026-01-14T17:11:34+00:00",
  "Link": "https://news.xbox.com/en-us/2026/01/14/online-safety-principles-xbox-nintendo-sony/",
  "FeedUrl": "https://news.microsoft.com/source/feed/",
  "Description": "The post [Update to shared commitment to safer gaming](https://news.xbox.com/en-us/2026/01/14/online-safety-principles-xbox-nintendo-sony/) appeared first on [Source](https://news.microsoft.com/source).",
  "OutputDir": "_news",
  "Author": "stclarke",
  "ProcessedDate": "2026-01-14 18:02:53",
  "Tags": [
    "Company News",
    "Gaming"
  ],
  "EnhancedContent": "![]()\n\nSkip to main content\n\n[!\\[\\](https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RE1Mu3b?ver=5c31)](https://microsoft.com) [Xbox Wire](https://news.xbox.com/en-us/)\n\n- Visit:\n- https://x.com/xboxwire\n- https://whatsapp.com/channel/0029VakfW7e5K3ze30Dp1247\n\n- Share:\n- https://www.twitter.com/share?url=https://news.xbox.com/en-us/2026/01/14/online-safety-principles-xbox-nintendo-sony/\n- https://api.whatsapp.com/send?text=An%20Update%20to%20Our%20Shared%20Commitment%20to%20Safer%20Gaming%20https://news.xbox.com/en-us/2026/01/14/online-safety-principles-xbox-nintendo-sony/\n\nNintendo, Sony Interactive Entertainment, and Microsoft continue to collaborate to improve player safety across our platforms. We believe gaming is for everyone and strive to provide experiences that are positive and enjoyable for all, especially for our youngest players. We work to accomplish this by pursuing a multidisciplinary approach, integrating advanced technology, research-driven insights, supportive community efforts, and skilled human oversight.\n\n[Since first announcing our shared commitment in 2020](https://news.xbox.com/en-us/2020/12/14/shared-safety-principles/), we’ve partnered behind the scenes with Nintendo and Sony Interactive Entertainment on these efforts because we can accomplish more when we work toward the same goal. As we continue to invest in, adapt, and amplify our approaches to player safety, we have also evolved our shared principles to ensure they represent our constant efforts to keep our communities safe. Our latest shared principles reflect new innovations in player safety that have evolved with technological advancements, and new ways in which we collaborate through key industry initiatives and with trade associations.\n\n**Prevention: Empower players and parents to understand and control gaming experiences**\n\n- We provide controls that let players customize their gaming experience. We support parents with the tools and information necessary to help them customize appropriate gaming experiences for their children.\n- We recognize that for safety features to be useful, they must be easy to use and understand. We promote the availability of our safety tools and provide guidance on how to use them through our platforms, support channels, services, on our websites, and in retail stores to reach more players and parents.\n- We inform our parents and players about our codes of conduct and terms of use to support positive gaming experiences for everyone. We enforce these policies through a variety of preventive and remedial measures. We design our products with transparency and player empowerment at their core, aiming to make experiences that are intuitive and respect players’ choices.\n\n**Partnership: We partner with industry peers, publishers, regulators, law enforcement, and our communities to advance player safety**\n\n- Our commitment to safety is central, and we believe collaboration benefits the video game industry and all players by fostering safe gaming experiences.\n- We partner and engage with global and regional industry trade organizations, industry members, regulators, law enforcement, non-profit organizations, and experts to develop and/or advance online safety initiatives. These include [**Thriving in Games Group,**](https://thrivingingames.org/) the [**Family Online Safety Institute**](https://fosi.org/), and others.\n- We conduct shared research to inform policy decisions and to drive industry innovation. Individually, we have engaged with external research centers that study play and wellbeing.\n- We partner with our community to promote safe gaming behavior and encourage the use of reporting tools to call out bad actors, and we have tools and processes in place to support rapid response to emerging incidents.\n- We collaborate with ratings agencies such as the [**ESRB**](https://www.esrb.org/) and [**PEGI**](https://pegi.info/), among others, to ensure that our games are rated for the appropriate audience, and work closely with the Entertainment Software Association and other trade associations to share [**trust & safety information**](https://www.theesa.com/trust-safety/) designed to educate and promote positive play experiences.\n- We invest in leading technology and proactive collaboration to help thwart improper conduct and content. We participate in key industry initiatives, including the [**Tech Coalition**](https://technologycoalition.org/) and its [**Lantern**](https://technologycoalition.org/programs/lantern/) program, that are dedicated to enhancing child safety through technology, knowledge-sharing, and transparency.\n\n**Responsibility: We hold ourselves accountable for making our platforms as safe as possible for all players**\n\n- We make it easy for players to report violations of our codes of conduct and community guidelines, which we work to refine and evolve to support our player communities.\n- In addition to removing content not suitable for our services, we take appropriate enforcement actions for violations, including restricting players from using our services for misconduct, with escalating restrictions for egregious or repeat violations. We engage in responsible and transparent practices, including the ethical use of all data, and deploy process enhancement technologies with skilled human oversight.\n- We comply with all applicable laws in the places we do business and respond to legitimate requests from law enforcement. We promptly notify law enforcement if we observe unlawful conduct or where we believe a player is at risk of imminent harm.\n- We publish our rules and requirements, and we ensure that players who have been reported understand the requirements for continued engagement with our platforms.\n\nThis partnership reflects our dedication to collaborating on solutions that enhance player safety and ensure our games are welcoming for everyone. The video game industry has a strong legacy of prioritizing player safety, especially for children. At the same time, we recognize that these challenges require collaboration and shared values, and so we welcome others to commit to the safety and well-being of players everywhere.",
  "FeedLevelAuthor": "Source"
}
