{
  "Description": "The post [Play more: Xbox app is now available on Arm-based Windows 11 PCs](https://blogs.windows.com/windowsexperience/2026/01/21/play-more-xbox-app-is-now-available-on-arm-based-windows-11-pcs/) appeared first on [Source](https://news.microsoft.com/source).",
  "Link": "https://blogs.windows.com/windowsexperience/2026/01/21/play-more-xbox-app-is-now-available-on-arm-based-windows-11-pcs/",
  "Tags": [
    "Company News",
    "Gaming"
  ],
  "Title": "Play more: Xbox app is now available on Arm-based Windows 11 PCs",
  "FeedName": "Microsoft News",
  "Author": "stclarke",
  "ProcessedDate": "2026-01-21 17:21:36",
  "PubDate": "2026-01-21T16:28:55+00:00",
  "FeedUrl": "https://news.microsoft.com/source/feed/",
  "OutputDir": "_news",
  "EnhancedContent": "Skip to main content\n\nSkip to main content\n\n[!\\[Site Icon\\](https://blogs.windows.com/wp-content/uploads/sites/2/2021/06/Windows11Icon.png)](https://windows.com/) / Windows Experience Blog\n\nPC Gaming\n\nJanuary 21, 2026\n\n# Play more: Xbox app is now available on Arm-based Windows 11 PCs\n\nBy\n\n- [Brynnan Fink\n– *Principal Program Manager, Windows Silicon and System Integration*](https://blogs.windows.com/windowsexperience/author/brynnanfink/)\n- [Nicole Allen\n– *Senior Director, Xbox Next Generation*](https://blogs.windows.com/windowsexperience/author/nicoleallen/)\n\nWindows has long been an open, flexible platform for gaming—built in partnership with developers, OEMs and silicon providers to deliver great experiences across devices. That [momentum continued in 2025](https://blogs.windows.com/windowsexperience/2025/12/09/windows-pc-gaming-in-2025-handheld-innovation-arm-progress-and-directx-advances/) as Windows 11 handhelds became more capable, Arm-based devices gained significant gaming improvements, and DirectX advances made modern graphics faster and more immersive.\n\n**Today marks another milestone for players everywhere.** The Xbox app is now available on all Arm-based Windows 11 PCs, **** bringing you the experience you know and love—ready for you to download, play and enjoy.\n\n**Your library and benefits come with you.**\n\nPlayers can now download and enjoy a wide range of titles from the Xbox PC app game catalog on Arm-based Windows 11 PCs. Today, more than 85% of the Game Pass catalog is compatible with these PCs, and we’re actively working with partners to expand support even further. For titles not yet supported running locally, Xbox Cloud Gaming remains an easy way to jump in while we work with partners to broaden compatibility.\n\n**Unlock more of what you love.**\n\nSince releasing the [Xbox app to Windows and Xbox Insiders](https://blogs.windows.com/windows-insider/2025/08/13/xbox-pc-app-experience-expanding-on-arm-based-windows-11-pcs/) and listening to the gaming community, platform updates were implemented to expand compatibility. Prism, the emulator that runs x86/x64 software on Arm, now supports AVX and AVX2, which helps expand compatibility for many modern games.\n\nEpic Anti-Cheat (EAC) support also enables fan favorites for games on Arm-based Windows 11 PCs, including popular titles such as Gears of War: Reloaded, Fortnite and more. And with Windows Performance Fit offering guidance on which titles should play well on a given device based on its hardware capabilities, players can feel confident choosing what to download.\n\nTogether with Xbox and our partners, we’ll keep working to bring even more titles to Arm-based Windows 11 PCs over time.\n\n**And we’re building it together.**\n\nWindows and Xbox continue to collaborate across the gaming community, OEMs, silicon innovators and game studios to expand catalog compatibility and deliver a consistently great Windows gaming experience—whether you’re on a powerful desktop, a purpose‑built handheld, or an Arm‑based Windows 11 laptop. Our focus remains on improving compatibility, enhancing performance and delivering experiences that make it easy to jump in and play.\n\nWe’re grateful to be building this with you. Every update we deliver and every title we bring to Arm-based Windows 11 PCs is shaped by what we hear from players. We’re excited about what’s ahead and look forward to bringing even more improvements, features and games to players everywhere in the coming year.",
  "FeedLevelAuthor": "Source"
}
