{
  "Title": "AI in action: Meet the 2026 Imagine Cup semifinalists",
  "Author": "stclarke",
  "FeedName": "Microsoft News",
  "PubDate": "2026-02-18T18:33:10+00:00",
  "OutputDir": "_news",
  "FeedLevelAuthor": "Source",
  "FeedUrl": "https://news.microsoft.com/source/feed/",
  "ProcessedDate": "2026-02-18 19:19:26",
  "EnhancedContent": "## This year, Imagine Cup is structured to meet student founders where they are: whether you’re validating early momentum or scaling real traction.\n\nSemifinalist teams across both the Launch and Scale paths will receive personalized mentorship, technical guidance, and direct exposure to Microsoft and industry experts. With support from AI leaders, startup operators, and venture professionals, teams will refine product-market fit, strengthen enterprise readiness, and prepare for the next stage of competition.\n\nA panel of judges will select the top teams to advance to the Imagine Cup World Championship, where they’ll compete on a global stage.\n\n##### **Scale Path: World Champion**\n\nOne team from the Scale path will receive:\n\n\\* $100,000 USD\n\n\\* A mentorship session with Microsoft Chairman and CEO, Satya Nadella\n\n\\* Opportunities for deeper partnership within Microsoft’s global ecosystem\n\n\\* The two runner-up teams will each receive $25,000 USD\n\n##### **Launch Path: Launch Award**\n\nOne team from the Launch path will receive:\n\n\\* $50,000 USD\n\n\\* Continued visibility and support from Microsoft\n\n#### **Congratulations to the semifinalists! (listed in alphabetical order):**\n\n##### **Clear for All** – **Universitas Sumatera Utara** *(Indonesia)*\n\nClear for All is reimagining access to books for blind and visually impaired students by replacing costly Braille production with an inclusive, voice-command reading platform. Co-designed with blind learners, Literaku empowers academic institutions to help students read independently and equitably — no sighted assistance required.\n\n##### **[CodeHers](https://imaginecup.microsoft.com/en-us/Team/d6137b72-0bd8-40d1-8647-f21d0d7d59c0) – Nanyang Technological University** *(Singapore)*\n\nCodeHers is closing learning gaps in H2 Organic Chemistry with MolecuLab, an AI-powered platform designed for adoption in secondary schools that helps GCE A-Level students visualize molecules, understand reaction mechanisms, and correct misconceptions in real time. Designed mobile-first and affordably, the team built an inclusive, multimodal experience with supportive AI guidance to make advanced chemistry accessible for every type of learner.\n\n##### **Copyflag – Oxbridge AI X** *(United Kingdom)*\n\nCopyflag is protecting independent creators in the generative AI era with an Azure AI-powered platform that detects AI-modified copyright infringement at scale and automatically issues takedowns. By making intellectual property defense affordable and autonomous, the team is helping business owners and creators recover revenue and protect what they build.\n\n##### **HaptE – Northwestern University***(United States)*\n\nHaptE brings real-time AI visibility to warehouse operations by mounting edge cameras on forklifts to catch errors before they leave the dock. By preventing costly mistakes and mapping live inventory movement, HaptE helps supply chains run smarter, faster, and more efficiently.\n\n##### **HiLily Team – Massey University** *(New Zealand)*\n\nHiLily Team is addressing loneliness and fragmented care for seniors living alone with a $20 voice companion that offers long-term memory and quiet health monitoring. Designed using “Solve for One, Extend to Many,” the team built an inclusive solution that removes voice, cognitive, and economic barriers—supporting seniors, families, and care providing institutions alike.\n\n##### **Interlinked – University of California, Berkeley** *(United States)*\n\nInterlinked uses real-time AI to predict wildfire ignition and spread, giving firefighters, communities, and local governments faster, smarter tools to respond. Built in collaboration with local leaders and Indigenous communities, the platform reflects real-world needs and equitable access.\n\n##### **Ionmonks – AMC College of Engineering** *(India)*\n\nIonmonks helps retail investors cut through emotional bias with explainable, AI-driven decision guidance in plain language. By replacing overwhelming charts with clear insights, the team empowers investors of every experience level to act with confidence.\n\n##### **[L-Guard LTD](https://imaginecup.microsoft.com/en-us/Team/a657394b-1c80-419b-af0f-62cf2704223e) – African Leadership University** *(Rwanda)*\n\nL-Guard LTD is improving road safety with automatic crash detection, driving behavior monitoring, and real-time alerts for riders, families, fleets, insurers, and emergency services. Built as a hardware-first, phone-independent system that works offline, L-Guard ensures protection for users of any age, literacy level, or connectivity access — with an Azure AI agent powering intelligent dashboard support.\n\n##### **Nyck.AI – Northwestern University** *(United States)*\n\nNyck.AI is an AI procurement agent that automates up to 90% of manual purchasing workflows for manufacturers and distributors. By layering intelligence on top of existing ERPs, Nyck saves teams time, reduces costly errors, and makes advanced procurement accessible to businesses of all sizes.\n\n##### **[$wap (PSU Panthers)](https://imaginecup.microsoft.com/en-us/Team/968c36a8-616f-418f-b065-af6295d85b8d) – Philander Smith University** *(United States)*\n\n$wap is building a skills-for-skills marketplace where small businesses and community members can exchange services without relying on money or formal credentials. Designed with inclusive principles from day one, the platform opens opportunity for those often excluded from traditional systems.\n\n##### **[Retribution](https://imaginecup.microsoft.com/en-us/Team/8fb2a46a-c672-485e-ba93-ea18519423ea) – National Institute of Technology, Durgapur** *(India)*\n\nRetribution has built CareOrbit, a multi-agent AI platform that unifies medications, appointments, and specialist care to instantly surface drug interactions and detect gaps in treatment. By bringing fragmented healthcare information into one intelligent system, the team is helping patients and providers make safer, more coordinated decisions in real time.\n\n##### **Revora Health (ClaraAI) – Carnegie Mellon University** *(United States)*\n\nRevora Health is reinventing physical therapy with Clara, an Azure-powered AI agent that delivers instant triage, personalized recovery plans, and real-time form feedback. By bridging the gap between clinic visits, the team is helping patients recover faster, more affordably, and with greater confidence.\n\n##### **SIER Technologies – University of Southern California** *(United States)*\n\nSIER Technologies created Sidekick, an AI-powered wearable that evolved from supporting blind users to enhancing safety on complex construction sites. By combining real-time guidance with automated compliance reporting, the team is redefining workplace visibility and protection.\n\n##### **Sentinel Rhino – Rajiv Academy for Technology and Management, Mathura AND Dr Bhimrao Ambedkar University, Agra** *(India)*\n\nSentinal Rhino is tackling undetected health and safety risks in mining and construction with SafeMine, an AI platform that delivers automated worker triage and real-time risk analytics for contractors. Designed with voice and icon-based UI, offline functionality, and support for regional dialects, the team is ensuring even low-literacy and migrant workers can report hazards and stay protected.\n\n##### **Silicosafe – Rajiv Gandhi University of Knowledge Technologies, IIIT RK Valley** *(India)*\n\nSilicosafe enables early, non-invasive silicosis screening through AI-driven breath analysis for industrial workers at construction and manufacturing sites. Focused on migrant and informal labor communities, the team is delivering life-saving detection where access has historically been limited.\n\n##### **[SIRUIS](https://imaginecup.microsoft.com/en-us/Team/501a30e3-86ed-4475-9d63-5fcaef333cc1) – ESPRIT: Private Higher School of Engineering and Technology** *(Tunisia)*\n\nSIRUIS is empowering children with Down syndrome through StepWise, a platform designed to support developmental growth, independence, and daily skill-building. Built with cognitive and motor needs in mind — and featuring a simple interface with OpenDyslexic fonts — the team gives children, parents, and health providers clearer guidance and stronger support from the start.\n\n##### **[Snailly Labs](https://imaginecup.microsoft.com/en-us/Team/f3115c09-2f31-4579-a986-3f3bc8c48fe1) – Universitas Komputer Indonesia** *(Indonesia)*\n\nSnailly Labs is protecting children ages 5–14 from harmful online content with adaptive cybersecurity that goes beyond one-size-fits-all parental controls. Using inclusive design, human-in-the-loop insights, and multilingual support, the team empowers families and academic institutions to define what “safe” means for them — with transparent, context-aware protection built around real-world needs.\n\n##### **SpoilSafe – Carnegie Mellon University** *(United States)*\n\nSpoilSafe uses AI to detect early spoilage signals in the cold chain, helping grocery and logistics operators prevent costly food waste. By making predictive tools accessible to operators of all sizes, the team is strengthening supply chains and supporting food security.\n\n##### **Team Recall – Vishwakarma Institute of Technology, Pune** *(India)*\n\nTeam Recall is bringing 400 million micro-retailers out of “data darkness” with a visual-first, zero-typing AI inventory copilot designed for non-technical shop owners. Built with inclusive design, vernacular language support, and low-literacy interfaces powered by Azure AI, Recall is helping the “Invisible Economy” digitize, grow revenue, and compete with confidence.\n\n##### **[Virtuoso Labs](https://imaginecup.microsoft.com/en-us/Team/5edc97d3-dcce-41cb-9e70-9482e7f6702a) – Georgia Tech University** *(United States)*\n\nVirtuoso Labs uses Azure AI to transform existing sheet music into custom arrangements tailored to any instrument combination or skill level. By removing cost, language, and skill barriers, the team is making music more accessible for hobbyists and lifelong musicians alike.\n\n##### **[WalkTDY](https://imaginecup.microsoft.com/en-us/Team/fb98e38b-4cac-4f3a-a4b6-37725f204271) – Nanyang Technological University** *(Singapore)*\n\nWalkTDY supports stroke survivors rebuilding mobility at home by increasing safety, confidence, and daily walking practice beyond the clinic. With a simple, accessible interface designed for varying vision and attention needs, the team is reducing barriers to rehabilitation while strengthening both physical and mental recovery.\n\n##### **[World37](https://imaginecup.microsoft.com/en-us/Team/25b985ae-2f71-4ae7-9b9d-bb6e46a9c82a) – Stanford University** *(United States)*\n\nWorld37 is an AI-powered platform where creators build interactive story worlds without complex coding and players shape narratives through meaningful choices. By combining Azure OpenAI with persistent character memory, the team is redefining how stories are created, played, and scaled.\n\nUpdated Feb 18, 2026\n\nVersion 5.0\n\n[!\\[StudentDeveloperTeam&#x27;s avatar\\](https://techcommunity.microsoft.com/t5/s/gxcuf89792/images/dS0yNjA2MDMtNDM1ODIxaUI5ODNCM0QyMURDNjIyOTE?image-dimensions=50x50)](/users/studentdeveloperteam/260603) [StudentDeveloperTeam](/users/studentdeveloperteam/260603) Bronze Contributor\n\nJoined January 04, 2019\n\n[View Profile](/users/studentdeveloperteam/260603)\n\n/category/educationsector/blog/studentdeveloperblog [Student Developer Blog](/category/educationsector/blog/studentdeveloperblog) Connecting aspiring student developers with tools, resources and experiences to turn innovative ideas into reality.",
  "Description": "The post [AI in action: Meet the 2026 Imagine Cup semifinalists](https://techcommunity.microsoft.com/blog/studentdeveloperblog/ai-in-action-meet-the-2026-imagine-cup-semifinalists/4495567) appeared first on [Source](https://news.microsoft.com/source).",
  "Tags": [
    "Company News",
    "Education"
  ],
  "Link": "https://techcommunity.microsoft.com/blog/studentdeveloperblog/ai-in-action-meet-the-2026-imagine-cup-semifinalists/4495567"
}
