{
  "Link": "https://news.xbox.com/en-us/2025/12/18/xbox-bethesda-blizzard-activision-king-2025-games-thank-you/",
  "Title": "Xbox looks back on a memorable year for players",
  "FeedUrl": "https://news.microsoft.com/source/feed/",
  "Author": "stclarke",
  "EnhancedContent": "![]()\n\nSkip to main content\n\n[!\\[\\](https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RE1Mu3b?ver=5c31)](https://microsoft.com) [Xbox Wire](https://news.xbox.com/en-us/)\n\n- Visit:\n- https://x.com/xboxwire\n- https://whatsapp.com/channel/0029VakfW7e5K3ze30Dp1247\n\n- Share:\n- https://www.twitter.com/share?url=https://news.xbox.com/en-us/2025/12/18/xbox-bethesda-blizzard-activision-king-2025-games-thank-you/\n- https://api.whatsapp.com/send?text=From%20Our%20Worlds%20to%20Yours:%20Thank%20You%20for%20an%20Incredible%202025%20https://news.xbox.com/en-us/2025/12/18/xbox-bethesda-blizzard-activision-king-2025-games-thank-you/\n\nAs the year winds down, we’re afforded the opportunity to take a beat and look back at a truly memorable year for players. Across Team Xbox we’ve been creating new worlds, telling fresh stories and bringing legendary franchises back to our screens – and ensuring you can enjoy these experiences on more devices than ever before. For all of us, it truly is [more than a game](https://www.youtube.com/watch?v=dENlVw9CE70).\n\nIt’s been one of the most game-packed, award-winning years in our history – and none of it would have been possible without you.\n\nWith 2025 coming to a close, we want to take this opportunity to reflect, relive our favorite moments, and say thank you for joining us to play together this year.\n\nWe’re looking forward to 2026 – Xbox’s 25th anniversary year – as it’s set to be another memorable one for players, with more to come from many of the studios we’ve seen this year, and many more at Xbox.\n\nFinally, to celebrate the year – we invited the teams to look back at their 2025 and tease a little of what’s coming next:\n\n*If you want to skip right to a specific title, click the buttons below:*\n\nAge of Empires & Age of Mythology: Retold\n\nAvowed\n\nCall of Duty: Black Ops 7\n\nCandy Crush Solitaire\n\nDiablo IV\n\nDiablo Immortal\n\nDoom: The Dark Ages\n\nThe Elder Scrolls IV: Oblivion Remastered\n\nThe Elder Scrolls Online\n\nFallout 76\n\nGears of War: Reloaded\n\nGrounded 2\n\nHeretic + Hexen\n\nIndiana Jones and the Great Circle\n\nKeeper\n\nMinecraft\n\nNinja Gaiden 4\n\nThe Outer Worlds 2\n\nOverwatch 2\n\nRetro Classics\n\nSea of Thieves\n\nSouth of Midnight\n\nTony Hawk’s Pro Skater 3 + 4\n\nTowerborne\n\nWorld of Warcraft\n\n# **Age of Empires & Age of Mythology: Retold**\n\n**What would you like to say to players after your updates and expansions to the Age games this year?**\n\nThe main message would be a resounding “*thank you!*” We are so honored that, 28 years after this franchise began, we can continue to expand it with new content, and we continue to welcome new players, reaching 70 million this year. This year has been our most content-rich year yet! We’ve brought three of our titles to PS5 and welcomed new players, as well as launching record-breaking expansions. We’re continuing to listen to what our players want to see as we work to grow our games and we’re so grateful to have them on this journey with us. Thank you for a wonderful 2025 to every one of you!\n\n**Are there any stories about how players have engaged with your games that you’d like to reflect on?**\n\nWe’re constantly enjoying seeing how players play Age of Empires and Age of Mythology. Everything from surprising new strategies to the mods that are created. Some ones we’ve enjoyed this year include the [Vassal game mode](https://www.ageofempires.com/mods/details/397717/) by Firesstones and Hosein81’s [custom Korean civilization](https://www.ageofempires.com/mods/details/422990/), both for *Age of Empires IV*.\n\nOne real highlight this year was the partnership we did with the Louvre, their first ever gaming partnership. We created a brand new scenario in *Age of Empires II: Definitive Edition* to allow players to live the history that their exhibition was built around, the Mamluk Dynasty. The scenario was also the focus of workshops people could attend at the Louvre to play through our game, with a historian teaching the context of the battle they were controlling.\n\nIt’s also worth noting that the way our developers play our games often has me tickled too. There’s definitely a lot of internal competition to complete in-game challenges, e.g. the monthly Pantheon Pin-Up event in *Age of Mythology: Retold*.\n\n**What is the studio most looking forward to in 2026?**\n\nWe’ve [released a blog](https://www.ageofempires.com/news/whats-coming-in-2026-for-age-of-empires-and-age-of-mythology/) to give our players some insight into what’s coming in the first half of 2026 and there’s so much good stuff coming! One thing we’re super excited about is the next installment of the Red Bull Wololo tournament series. This 8th edition is taking us to London, where we’ll have the biggest gathering of Age fans from around the world yet. The Grand Final is taking place at the iconic Royal Albert Hall and we can’t wait to have it as the venue for dramatic gameplay – we even have an orchestra playing tracks from the soundtracks. These events are such a great opportunity for our developers to meet our players in person and hear from them face to face. It’ll be a great celebration of all things Age of Empires!\n\n[**Back to Top]**\n\n[!\\[Age of Empires IV: Anniversary Edition\\](https://store-images.s-microsoft.com/image/apps.63959.14235977975261210.106699ff-5046-4540-ac72-e248ae2c3818.f61be535-d1e6-46c7-a0b3-338fd9384f08?w=400&#038;h=600)](https://www.microsoft.com/en-us/store/apps/9PHH1ZWRSZ41)\n\n## Age of Empires IV: Anniversary Edition\n\nXbox Game Studios\n\n☆☆☆☆☆ 288\n\n★★★★★\n\n$39.99\n\n$31.99\n\n[Get it now](https://www.microsoft.com/en-us/store/apps/9PHH1ZWRSZ41)\n\nXbox Game Pass\n\nFor years you’ve battled armies and made history your story. Now it’s time to make history once more with a new breakthrough in strategy gaming – introducing Age of Empires IV: Anniversary Edition now available on Xbox consoles.\\*\n\nEnjoy innovative ways to play one of the most beloved strategy games ever with native inputs for Xbox controller, console-specific user interface, and a new tutorial designed for first time players to help achieve easy setup and success. Additionally, if you prefer playing with a keyboard and mouse you can easily plug directly into your console.\n\nReturn to History – The past is prologue as you are immersed in a rich historical setting of 10 diverse civilizations across the world from the English to the Chinese to the Delhi Sultanate in your quest for victory. Build cities, manage resources, and lead your troops to battle on land and at sea in 4 distinct campaigns with 35 missions that span across 500 years of history from the Dark Ages up to the Renaissance.\n\nChoose Your Path to Greatness with Historical Figures – Live the adventures of Joan of Arc in her quest to defeat the English, or command mighty Mongol troops as Genghis Khan in his conquest across Asia. The choice is yours – and every decision you make will determine the outcome of history.\n\nChallenge the World – Jump online to compete, cooperate or spectate with up to 7 of your friends in PVP and PVE multiplayer modes on Xbox One Series X I S and up to 3 friends on Xbox One. (Online console multiplayer requires Xbox Game Pass Ultimate or Xbox Live Gold, subscriptions sold separately.)\n\nPlay Custom Games with Mods (Beta) – Play custom skirmish and multiplayer maps, unique mission scenarios, data driven tuning packs and new modes of play for Age of Empires IV.\n\nAn Age for All Players – Age of Empires IV is an inviting experience for new players with a console-specific tutorial that teaches the essence of real-time strategy and a Campaign Story Mode designed for first time players to help achieve easy setup and success, yet is challenging enough for veteran players with new game mechanics, evolved strategies, and combat techniques.\n\n\\*This content is available on Xbox consoles as a free download for current Xbox Game Pass subscribers and owners of Age of Empires IV on PC, excluding Steam purchasers.\n\n[!\\[Age of Mythology: Retold\\](https://store-images.s-microsoft.com/image/apps.11603.13792255792507479.e5089564-b472-427d-a39f-9e97ae74bf23.022933e1-6a30-4a52-8c02-0b9400857d8e?w=400&#038;h=600)](https://www.microsoft.com/en-us/store/apps/9NPKGVXPFRSX)\n\n![Xbox Play Anywhere](https://assets.onestore.ms/cdnfiles/sfw-service-web-onestore-onerf-2017-11-8-12/store/common/images/xpalogo_black.png)\n\n## Age of Mythology: Retold\n\nXbox Game Studios\n\n☆☆☆☆☆ 249\n\n★★★★★\n\n$29.99\n\n$14.99\n\n[Get it now](https://www.microsoft.com/en-us/store/apps/9NPKGVXPFRSX)\n\nPC Game Pass\n\nXbox Game Pass\n\nFrom the creators of the award-winning Age of Empires franchise, Age of Mythology: Retold goes beyond history to a mythical age where gods, monsters, and humans collide. Combining the best elements of the beloved Age of Mythology with modern real-time strategy design and visuals, Retold is an epic and innovative experience for old and new players alike. Secure your domain, command legendary monsters, and call upon the power of the gods to crush your enemies.\n\nWill you become Mythic?\n\nCall Upon the Gods Choose your gods from the Greek, Norse, Egyptian, and Atlantean pantheons. Devastate your enemies by summoning powerful lightning storms, earth-shattering quakes, and even the famed Nidhogg dragon. Or call upon nourishing rains and protective Dryads to help your people grow & prosper.\n\nUnleash the Monsters Unleash Centaurs, Trolls, Mummies, and more. From bejeweled crocodiles who harness the power of the sun to the mighty one-eyed Cyclops, you will command diverse units inspired by the world’s great mythologies.\n\nLimitless Adventure, Solo or with Friends Experience Age of Mythology: Retold like never before. In the main game, go head-to-head with friends or challenge the advanced AI across countless, randomly generated maps for endless strategic battles.\n\nFor a fresh twist, step into Arena of the Gods—an all-new mode where you take on the role of a legendary hero, facing 35 mythic skirmishes filled with divine challenges. Play solo or join forces in co-op\\*, battling through epic trials from the frozen Tundra to the heights of Mount Olympus. Face world-changing twists and unlock godly blessings as you fight solo or with friends.\n\nBuilt for controller RTS on console? We’ve got you covered. Streamlined controls make it easy to build, battle, and conquer—all without a keyboard.\n\n\\*Requires Age of Mythology: Retold or Xbox Game Pass membership (Ultimate and PC only)\n\n\\*\\*Online console multiplayer requires Game Pass Ultimate or Core, sold separately.\n\n# **Avowed**\n\n**What would you like to say to your players after releasing *Avowed* this year?**\n\nFirst and foremost, thank you for playing *Avowed*. It’s been a thrill to watch your playthroughs – seeing the choices you make, the kind of envoy you want to be, and the playstyles you gravitate toward. We love seeing your screenshots, your art, and especially the feedback you share about how we can keep improving. Every post, every comment, and every story helps us learn, grow, and make the world of *Avowed* even better.\n\n**How does it feel to have your game out there after development?**\n\nIt’s both surreal and deeply rewarding. After years of internal playtesting and iteration, watching players finally experience the game on their own terms with their own characters and choices they’ve made is the best payoff we could ask for. It reminds us why we make RPGs.\n\n**Are there any stories about how players have engaged with your game that you’d like to reflect on?**\n\nWe’ve loved seeing players approach quests and challenges in ways we never predicted. The speedrunning community, in particular, has been a joy – watching them push our systems to achieve unbelievable times has been fascinating. I especially loved seeing runners use Crackling Bolt to launch themselves into the air and skip entire sections. As developers, we always want to fix every issue, but moments like these remind us that games are ultimately about giving players the freedom to engage with them however they want.\n\n**What is the studio most looking forward to in 2026?**\n\nWe’re excited to continue supporting the game and listening to the community. We’ve [recently announced](https://x.com/AvowedtheGame/status/1995917924708876634?s=20) that we are moving our next update closer to the game’s anniversary, which will include New Game Plus, Photo Mode, a new Quarterstaff weapon, additional Character Presets, and much more, including some surprises. So stay tuned!\n\n[**Back to Top]**\n\n[!\\[Avowed\\](https://store-images.s-microsoft.com/image/apps.63195.13624715126573049.35e3abd5-bd41-4efb-bc2a-0bfbdd50b02a.d3291934-3236-4279-91eb-792123046d1d?w=400&#038;h=600)](https://www.microsoft.com/en-us/store/apps/9nhrdqvfpq34)\n\n![Xbox Play Anywhere](https://assets.onestore.ms/cdnfiles/sfw-service-web-onestore-onerf-2017-11-8-12/store/common/images/xpalogo_black.png)\n\n## Avowed\n\nXbox Game Studios\n\n☆☆☆☆☆ 677\n\n★★★★★\n\n[Get it now](https://www.microsoft.com/en-us/store/apps/9nhrdqvfpq34)\n\nPC Game Pass\n\nXbox Game Pass\n\nWelcome to the Living Lands, a mysterious island filled with adventure and danger. Set in the fictional world of Eora that was first introduced to players in the Pillars of Eternity franchise, Avowed is a first-person fantasy action RPG from the award-winning team at Obsidian Entertainment. You are the envoy of Aedyr, a distant land, sent to investigate rumors of a spreading plague throughout the Living Lands – an island full of mysteries and secrets, danger and adventure, and choices and consequences, and untamed wilderness. You discover a personal connection to the Living Lands and an ancient secret that threatens to destroy everything. Can you save this unknown frontier and your soul from the forces threatening to tear them asunder?\n\nThe Weird and Wonderful Living Lands The Living Lands is a place that feels foreign yet somewhat intrinsic to you as it feels the island itself is calling out to you for help. Explore an island home to many different environments and landscapes, each with their own unique ecosystem.\n\nVisceral Combat to Play Your Way Mix and match swords, spells, guns, and shields to fight your way. Dig into your grimoire for spells to trap, freeze or burn enemies, bash them with your shield, or use range bows to attack from a distance.\n\nCompanions as part of your journey Companions from a spread of species will fight alongside you, with their own unique set of abilities. From a former mercenary to an eccentric wizard, they will be part of your journey with your choices shaping them as you help them with their quests.\n\n© Microsoft 2025. All Rights Reserved. Microsoft, Obsidian Entertainment, the Obsidian Entertainment logo and Avowed are trademarks of the Microsoft group of companies. All other trademarks are property of their respective owners. Acceptance of Microsoft Services Agreement and Privacy Statement required to play. Microsoft account registration required for cross-platform play. Internet connection required. Features, online services, and system requirements may vary by country and are subject to change or retirement over time.\n\n# **Call of Duty: Black Ops 7**\n\n**What would you like to say to your players after releasing *Call of Duty: Black Ops 7* this year?**\n\nThank you so much for jumping into *Call of Duty: Black Ops 7*! The team at Treyarch is so incredibly proud of this game and we’ve been having a blast ourselves out there with you, whether it’s been a friendly revive in Endgame, a new Nemesis in Multiplayer, or riding shotgun in Ol’ Tessie in Zombies.\n\n**How does it feel to have your game out there after development?**\n\nThere’s always a sense of relief once a game launches. With *Black Ops 7*, that has also come with an incredible amount of excitement knowing that Season 01 is the biggest in Black Ops history, and we have so much more fun content coming throughout the year and into next year!\n\n**Are there any stories about how players have engaged with your game that you’d like to reflect on?**\n\nWe built *Black Ops 7* as a fully cooperative and social experience with the goal of offering something for everyone. It’s been truly amazing to see friends and strangers coming together across the entire game. We’ve hopefully provided a platform for people to create some new friends for life or simply reinforce the friendships they already had.\n\n**What is your studio most looking forward to in 2026?**\n\nMore content! More maps, more weapons, more zombies, even a Blackout-inspired mode in *Warzone* with our friends at Raven. The party doesn’t stop, so hop on board!\n\n[**Back to Top]**\n\n[!\\[Call of Duty®: Black Ops 7 - Vault Edition\\](https://store-images.s-microsoft.com/image/apps.42345.14125077842244720.2018ef97-1b64-4b7c-8b52-f1a15806abee.1202e9c9-f2e2-4f8d-8f59-d3e0c2ce00b9?w=400&#038;h=600)](https://www.microsoft.com/en-us/store/apps/9pbds7dppxm5)\n\n![Xbox Play Anywhere](https://assets.onestore.ms/cdnfiles/sfw-service-web-onestore-onerf-2017-11-8-12/store/common/images/xpalogo_black.png)\n\n## Call of Duty®: Black Ops 7 – Vault Edition\n\nActivision Publishing Inc.\n\n☆☆☆☆☆ 108\n\n★★★★★\n\n$99.99\n\n$79.99\n\n[Get it now](https://www.microsoft.com/en-us/store/apps/9pbds7dppxm5)\n\nThe Vault Edition includes:\n\n– Cross-Gen Bundle of Call of Duty®: Black Ops 7 — Includes Xbox Series X|S, Xbox One and Xbox on PC versions of the game – BlackCell (1 Season)\\* — Includes: Battle Pass, 20 Tier Skips, 1,100 CP and more – Operator Collection — 4 Operator Skins: Harper, Karma, T.E.D.D. and Reaper EWR-3 – Mastercraft Collection — 5 Mastercraft Weapons – Ultra GobbleGum Pack for Zombies — 8 GobbleGums of Ultra rarity for Black Ops 7 – Permanent Unlock Token for Black Ops 7 – Guild Override Weapon Camo\n\nIn Call of Duty®: Black Ops 7, Treyarch and Raven Software are bringing players the biggest Black Ops ever.\n\nSquad up or go solo in an innovative Co-Op Campaign that redefines the Black Ops experience.\n\nMultiplayer explodes out of the gate with 16 electrifying 6v6 maps and two 20v20 maps at launch. Master a cutting-edge arsenal and outmaneuver your enemies with a next level Omnimovement system.\n\nIn Treyarch’s legendary Round-Based Zombies mode, the nightmare begins where reality ends. Trapped in the heart of the Dark Aether, the crew is thrust into a vast, ever-shifting hellscape in the biggest Round-Based Zombies map in Black Ops history. Game requires a Game Pass Essential subscription (sold separately).\n\nTPM 2.0 and Secure Boot required for PC, other security measures may be enforced. Learn more at https://support.activision.com/tpm.\n\n\\*Battle Pass / BlackCell redemption applies to one Season of Black Ops 7 Battle Pass only.\n\nContent, features, services, online play, and support not available in all regions, and may vary, change, or terminate.\n\nRequires an Activision account and acceptance of the Activision Software License and Services Agreement. A mobile phone number linked to your Activision account may be required to play Black Ops 7.\n\nAdditional storage space may be required for mandatory game updates.\n\nFor more information, please visit www.callofduty.com.\n\n©/TM/® 2025 Activision Publishing, Inc. This product contains software technology licensed from Id Software ('Id Technology'). Id Technology © 1999-2025 Id Software, Inc.\n\n# **Candy Crush Solitaire**\n\n**What would you like to say to your players after releasing *Candy Crush Solitaire* this year?**\n\nLaunching *Candy Crush Solitaire* in February 2025 as the first non-match 3 game within the Candy Crush universe was a major milestone for us at King. We’re so grateful to everyone who embraced this new twist on Candy Crush.\n\nWhether you started playing it out of curiosity or have made it part of your daily routine, your support means the world to our team. We’re incredibly proud of what we’ve created, and truly appreciative of every single player who’s joined us on this journey so far – thank you! We hope you’ll keep playing, exploring, and sharing your feedback with us as it helps us shape the future of the game.\n\n**How does it feel to have your game out there after development?**\n\nLaunching a game is a muscle, one that strengthens with every project, every challenge and every release. It isn’t something we do all that often at King, so when we do, it’s a big moment. *Candy Crush Solitaire* challenged us in new ways, taught us new things, and ultimately made us proud. Seeing the team come together and bring the game to life has been one of the most rewarding parts of the journey, and having it now in players’ hands is a moment we truly cherish.\n\nIt has been equally fantastic to see the game recognised by the industry with awards and praises, most recently, in November, receiving the Google Play ‘Best Pick Up and Play’ award 2025.\n\n**Are there any stories about how players have engaged with your game that you’d like to reflect on?**\n\nOne moment that really stands out is our recent partnership with Care Bears, which brought a whole new layer of warmth and nostalgia into *Candy Crush Solitaire*. For a limited-time, we transformed the game into a vibrant celebration of love, kindness, and color.\n\nThe collaboration came to life in-game through Care Bears–themed card decks, colorful makeovers, and a brand-new Care-o-Meter event, where acts of kindness unlocked rewards. Players also had the chance to meet Cheer Bear, Bedtime Bear, and the whole gang, collecting exclusive cards in the Care Bears Album to keep as a memento once completed. What’s been particularly rewarding is seeing just how joyfully players engaged with all these features.\n\nBringing such a beloved, iconic brand into the game reminded us why we love making games in the first place: moments where players feel surprised, delighted, and connected.\n\n**What is the studio most looking forward to in 2026?**\n\nAs we look ahead to 2026, the team is most excited about continuing to learn, evolve, and build on everything we’ve accomplished so far for *Candy Crush Solitaire*. We have plenty of new ideas, fresh features, and creative opportunities we’re exploring, from the excitement of Solitaire Grand Cup to new seasonal collections. We are excited to make the game even more engaging and delightful for our players.\n\n[**Back to Top]**\n\n# **Diablo IV**\n\n**What would you like to say to players after the updates to *Diablo IV* this year?**\n\nThis has been a transformative year for *Diablo IV* and speaking on behalf of the entire team I want to say thank you to every player who has journeyed with us. Your passion, feedback and love of slaying demons pushed us to deliver some of our most ambitious updates yet, from class reworks to quality-of-life improvements and new collaborations. We know Diablo is at its best when it feels alive, evolving, and shaped by the community that plays it, and your trust has meant everything to us. I also want to thank the incredible producers, artists, writers,  engineers, QA and everyone across Blizzard who pour their talent into this franchise every day.\n\n**Are there any stories you heard or saw about *Diablo IV* players this year that you’d like to reflect on?**\n\nOne story that really moved us came from a son sharing that his 73-year-old father, who’s spent thousands of hours in *Diablo IV*, was suddenly facing a serious medical battle. The community rallied around him with messages of support, and we were able to send a care package during his recovery. It was a powerful reminder that even in the darkest moments, this community carries its own light. Diablo isn’t just a game people play; it’s a world they share, and strengthen, together.\n\n**What is the team most looking forward to in 2026?**\n\n2026 is shaping up to be one of the most exciting years in Diablo’s history. We’re gearing up for the launch of our next expansion, Lord of Hatred, the final fight with Mephisto that will challenge players in new ways and reveal a part of Sanctuary they’ve never seen before. It also marks the 30th Anniversary of Diablo, a milestone that means so much to everyone at Blizzard.  We’re planning to celebrate this legacy all year long with our players across the world, including BlizzCon where we’ll gather with players and look toward the next era of Diablo. Most of all, we’re looking forward to forging new adventures, legendary gear and unforgettable moments alongside Diablo players. A vast road lies ahead, and we can’t wait to walk it with you!\n\n[**Back to Top]**\n\n[!\\[Diablo® IV\\](https://store-images.s-microsoft.com/image/apps.27418.13768370188591668.302c14c1-c563-4b96-9413-8dcd386e8806.35943a0f-ac2d-4952-b31a-6c3aad7db3aa?w=400&#038;h=600)](https://www.microsoft.com/en-us/store/apps/9nqrcd3w41l3)\n\n## Diablo® IV\n\nBlizzard Entertainment\n\n☆☆☆☆☆ 988\n\n★★★★★\n\n[Get it now](https://www.microsoft.com/en-us/store/apps/9nqrcd3w41l3)\n\nXbox Game Pass\n\nDiablo® IV is the next-gen action RPG experience with endless evil to slaughter, countless abilities to master, nightmarish Dungeons and legendary loot. Embark on the campaign solo or with friends, meeting memorable characters throughout a beautifully dark open world and a gripping story. Dive into an expansive End Game where players can meet in towns to trade, team up to battle larger-than-life World Bosses, unlock robust character and loot customization, and uncover tons more action-packed activities to explore with cross-play and cross-progression on all available platforms.\n\nThis is only the beginning for Diablo® IV, with new events, stories, Seasons, rewards, and more looming on the horizon. Battle.net® account required. Internet connection required.\n\nFor more information, please visit Diablo.com.\n\n© 2024 Blizzard Entertainment, Inc. Diablo and Blizzard Entertainment are trademarks or registered trademarks of Blizzard Entertainment, Inc. in the U.S and/or other countries.\n\n# **Diablo Immortal**\n\n**What would you like to say to players after the updates to *Diablo Immortal* this year?**\n\nThis year’s updates to *Diablo Immortal* were shaped by your passion, your feedback, and the incredible energy you bring to Sanctuary every day. We’re deeply grateful for the dedication and creativity of this community, from the players who theorycraft every patch to those who simply enjoy adventuring with friends. Each update is a reflection of your commitment to the world of *Immortal*, and we’re honored to be building it alongside you. Thank you for being such an essential part of this journey.\n\n**Are there any stories you heard or saw about *Diablo Immortal* players this year that you’d like to reflect on?**\n\nThis year, we were inspired by how *Diablo Immortal* continues to bring players together. From long-time friends who meet in Sanctuary each week to the players creating guides, challenge runs, and community events, the passion and creativity of the community really stood out. Seeing players connect, support one another, and shape the experience in their own ways has been one of the team’s favorite parts of the year.\n\n**What is the team most looking forward to in 2026?**\n\nIn 2026, the team is excited to bring some of our most ambitious updates yet — from new ways to experience Sanctuary to deeper systems players have been asking for. We’re equally thrilled about the launch of our [official *Diablo Immortal* Discord channel](https://discord.com/invite/DiabloImmortal), which is already becoming an amazing space for players to connect and share their passion. With big content and even bigger community moments ahead, next year is shaping up to be something special.\n\n[**Back to Top]**\n\n# **DOOM: The Dark Ages**\n\n**What would you like to say to your players after releasing *DOOM: The Dark Ages* this year?**\n\nOn behalf of the entire team at id, we’d like to thank everyone for their incredible enthusiasm and support for the game. DOOM fans are some of the best and most passionate players in games, so we’re always trying to give you something uniquely engaging and memorable.  It has been incredibly rewarding to watch the community play and enjoy the game the way they have.\n\n**How does it feel to have your game out there after development?**\n\nAfter years of development, releasing a game is always such a mix of emotions from excitement and anticipation to curiosity, pride and even a little exhaustion.  Ultimately, we do it all to create an experience that is unique, fun, engaging, smart, and rewarding enough that players want to give us their valuable time.  We want them to enjoy it, talk about it, come back to it, feel challenged by it and then experience their own reward for mastering it.  It’s most rewarding for us to see and hear that players enjoy that journey.\n\n**Are there any stories about how players have engaged with the game that you’d like to reflect on?**\n\nWe put a lot of effort into the difficulty sliders – which was a very new feature for a DOOM game. Our goal was that the sliders could be used by the widest range of players possible – not just to make the game more approachable for newer players, but also much more challenging for our players with elite skills. It has been very rewarding to see the response. We’ve seen some of the best players in our community turning everything up to the absolute maximum speed and difficulty to demonstrate an extreme level of mastery of the game. We’ve also seen the sliders used in combination with our robust accessibility settings to give players who have never been able to experience a DOOM game before the opportunity to play and enjoy *DOOM: The Dark Ages*.\n\n**What is the team most looking forward to in 2026?**\n\nWe can’t wait to release our *DOOM: The Dark Ages* expansion that we’ve been hard at work on and we have some additional updates we plan to make to The Ripatorium feature we added after launch. We also have some amazing anniversaries coming up in 2026! id Software turns 35 years old in February and we will celebrate the 10-year anniversary of *DOOM (2016)* in May. Our fans should look for information on streams and other activities where they can celebrate along with us – hint, we love giving away swag on our streams.\n\n[**Back to Top]**\n\n[!\\[DOOM: The Dark Ages\\](https://store-images.s-microsoft.com/image/apps.47432.14239344665439398.f72b7e9e-0a95-4e76-b1e3-8989c4d70e2e.c8545c7d-a8d3-4853-b09f-25a680a145ad?w=400&#038;h=600)](https://www.microsoft.com/en-us/store/apps/9ph9x0760b0t)\n\n![Xbox Play Anywhere](https://assets.onestore.ms/cdnfiles/sfw-service-web-onestore-onerf-2017-11-8-12/store/common/images/xpalogo_black.png)\n\n## DOOM: The Dark Ages\n\nBethesda Softworks\n\n☆☆☆☆☆ 631\n\n★★★★★\n\n$69.99\n\n$34.99\n\n[Get it now](https://www.microsoft.com/en-us/store/apps/9ph9x0760b0t)\n\nPC Game Pass\n\nXbox Game Pass\n\nBECOME THE SLAYER IN A MEDIEVAL WAR AGAINST HELL DOOM: The Dark Ages is the prequel to the critically acclaimed DOOM (2016) and DOOM Eternal that tells an epic cinematic story worthy of the DOOM Slayer’s legend. In this third installment of the modern DOOM series, players will step into the blood-stained boots of the DOOM Slayer, in this never-before-seen dark and sinister medieval war against Hell.\n\nDOOM: The Dark Ages is a dark fantasy/sci-fi single-player experience that delivers the searing combat and over-the-top visuals of the incomparable DOOM franchise, powered by the latest idTech engine.\n\nSTAND AND FIGHT As the super weapon of gods and kings, shred enemies with devastating favorites like the Super Shotgun while also wielding a variety of new bone-chewing weapons, including the versatile Shield Saw. Players will stand and fight on the demon-infested battlefields in the vicious, grounded combat the original DOOM is famous for. Take flight atop the new fierce Mecha Dragon, stand tall in a massive Atlan mech, and beat demons to a pulp with the newly enhanced glory kill system. Only the Slayer has the power to wield these devastating tools of mayhem.\n\nREIGN IN HELL Bound to serve as the super weapon of gods and kings, the DOOM Slayer fends off demon hordes as their leader seeks to destroy the Slayer and become the only one that is feared. Witness the creation of a legend as the Slayer takes on all of Hell and turns the tide of the war.\n\nDISCOVER UNKNOWN REALMS In his quest to crush the legions of Hell, the Slayer must take the fight to never-before-seen realms. Mystery, challenges, and rewards lurk in every shadow of ruined castles, epic battlefields, dark forests, ancient hellscapes, and worlds beyond. Armed with the viciously powerful Shield Saw, cut through a dark world of menace and secrets in id's largest and most expansive levels to date.\n\nhttps://eulas.bethesda.net/doom-the-dark-ages\n\n# **The Elder Scrolls IV: Oblivion Remastered**\n\n**What would you like to say to your players after releasing *Oblivion Remastered* this year?**\n\nWe want to thank everyone for joining us in Cyrodiil this year! Bringing *Oblivion Remastered* to life has been a dream come true and seeing new players experience it for the first time, or watching diehard fans dive back into the boots of the Hero of Kvatch 20 years later, it means everything to us!\n\n**How does it feel to have your game out there after development?**\n\nIt’s been incredible to unleash *Oblivion Remastered* to the world and see how much people are enjoying it. After years of super top-secret development, seeing your screenshots, hearing your stories, and feeling that energy has been just amazing!\n\nWe set out to preserve the heart of the original while ensuring new players experience that first breath of freedom as they step out of the Imperial Sewers and see the world open before them. Whether they’re closing their Oblivion Gate, kicking ass in the Arena, or wandering the streets of the Imperial City, watching people experience those moments are why we do this.\n\n**Are there any stories about how players have engaged with your game that you’d like to reflect on?**\n\nI’ve loved watching streamers say ‘I’ll just check it out,’ and then three hours later they’re chasing a rumor into an obscure side quest. The best part is seeing the same channels return week after week with new personal quests. Things like clearing every dungeon, finishing every side quest, and hitting all the DLCs! That “get hooked, come back, go deeper loop” is exactly what I personally love about Bethesda games and it’s exciting to see players have that same experience.\n\n[**Back to Top]**\n\n[!\\[The Elder Scrolls IV: Oblivion Remastered\\](https://store-images.s-microsoft.com/image/apps.54508.13768907753672648.dcd706bb-ce91-4b3f-9525-10b1d4af8423.ad8946cd-a4cb-4ea2-bbf7-a05b1a4f4126?w=400&#038;h=600)](https://www.microsoft.com/en-us/store/apps/9nqr437k7pqh)\n\n![Xbox Play Anywhere](https://assets.onestore.ms/cdnfiles/sfw-service-web-onestore-onerf-2017-11-8-12/store/common/images/xpalogo_black.png)\n\n## The Elder Scrolls IV: Oblivion Remastered\n\nBethesda Softworks\n\n☆☆☆☆☆ 949\n\n★★★★★\n\n$49.99\n\n$33.49\n\n[Get it now](https://www.microsoft.com/en-us/store/apps/9nqr437k7pqh)\n\nPC Game Pass\n\nXbox Game Pass\n\nThe Elder Scrolls IV: Oblivion™ Remastered modernizes the 2006 Game of the Year with all new stunning visuals and refined gameplay. Explore the vast landscape of Cyrodiil like never before and stop the forces of Oblivion from overtaking the land in one of the greatest RPGs ever from the award-winning Bethesda Game Studios.\n\nRediscover Cyrodiil Journey through the rich world of Tamriel and battle across the planes of Oblivion where handcrafted details have been meticulously recreated to ensure each moment of exploration is awe-inspiring.\n\nNavigate Your Own Story From the noble warrior to the sinister assassin, wizened sorcerer, or scrappy blacksmith, forge your path and play the way you want.\n\nExperience an Epic Adventure Step inside a universe bursting with captivating stories and encounter an unforgettable cast of characters. Master swordcraft and wield powerful magic as you fight to save Tamriel from the Daedric invasion.\n\nThe Complete Story Experience everything Oblivion has to offer with previously released story expansions Shivering Isles, Knights of the Nine, and additional downloadable content included in The Elder Scrolls IV: Oblivion Remastered.\n\n\\*\\*\\*\n\nThe Elder Scrolls IV: Oblivion Remastered Standard Edition includes:\n\n• Digital base game • Shivering Isles and Knights of the Nine story expansions • Additional downloadable content: Fighter’s Stronghold, Spell Tomes, Vile Lair, Mehrune’s Razor, The Thieves Den, Wizard’s Tower, The Orrery, and Horse Armor Pack\n\nhttps://eulas.bethesda.net/oblivion-remaster\n\n# **The Elder Scrolls Online**\n\n**What would you like to say to players after the updates to *ESO* this year?**\n\nFirst and foremost, thank you. *The Elder Scrolls Online* is nothing without our community. Your passion and commitment inspire all of us on the development team, every single day. As a team, this past year was defined by ambition and transition, as we worked to deepen your experience in Tamriel. We delivered a beautiful new zone, new group content, significant updates like subclassing, and many needed quality-of-life improvements.\n\nI understand firsthand that ambitious change and transition can sometimes come with mixed reactions. When we push boundaries or try new things, we’re always watching and listening closely. We hear you on where we succeeded and where we fell short. And we deeply appreciate the players who stuck with us through those moments of growing pains.\n\n**What is the team most looking forward to in 2026?**\n\nOur goal is to build upon *ESO*’s incredible legacy by focusing on meaningful improvements and evolution. We’re taking the lessons we learned this year to define our path forward. We believe the time you invest in Tamriel should always feel valuable and rewarding, and we’re focused on delivering that promise.\n\nThe launch of Seasons in 2026 will be an exciting new era for all of us, and I cannot wait for you all to experience it and tell us what you think. Let’s build our Tamriel together.\n\n[**Back to Top]**\n\n[!\\[The Elder Scrolls® Online\\](https://store-images.s-microsoft.com/image/apps.44920.69742768075920623.8d7d46c9-b023-4700-bdd5-c2dc4ad18d46.f7786132-070f-45ba-91b9-6c9f2a93fba9?w=400&#038;h=600)](https://www.microsoft.com/en-us/store/apps/brkx5crmrtc2)\n\n## The Elder Scrolls® Online\n\nBethesda Softworks\n\n☆☆☆☆☆ 1837\n\n★★★★★\n\n$19.99\n\n$4.99\n\n[Get it now](https://www.microsoft.com/en-us/store/apps/brkx5crmrtc2)\n\nXbox One X Enhanced\n\nXbox Game Pass\n\nIncludes The Elder Scrolls Online Base game and the Morrowind Chapter.\n\nEvery legend starts somewhere and in The Elder Scrolls Online, it starts with you. Write your story into a vibrant chapter of Tamriel’s distant past that takes place nearly 1,000 years before the iconic TES V: Skyrim, and discover a world steeped in adventure and possibility.\n\nA DIVERSE FANTASY WORLD – Travel the vast land of Tamriel and discover a world of adventure. Explore the mushroom forests of Morrowind, battle Daedric foes in the realms of Oblivion, or face off against other players in PvP combat.\n\nRICH STORIES ON A SHARED CANVAS – Immerse yourself in award-winning storytelling that's crafted with the same spirit as your favorite Elder Scrolls games. Discover an ever-growing world with friends or solo.\n\nPURPOSE IN EVERY PATH – Choose from an array of quests and challenges that fit your desires and ambitions. Grab a fishing rod and relax at the shore, seek lost treasures, conquer group dungeons, or craft new armor. Make this Elder Scrolls world your own – you belong here.\n\n# **Fallout 76**\n\n**What would you like to say to players after the updates to *Fallout 76* this year?**\n\nIt really does seem like yesterday that we released Gleaming Depths, and here we are another year later with an even bigger drop of content with Burning Springs! Over the past 12 months we’ve made some pivotal changes to the game, several of them inspired by your feedback over the years. We are truly thankful for the incredible support from this amazing community. Your feedback on Discord, Reddit, and social media has certainly inspired us and played a major role in shaping *Fallout 76*. Thank you for being such an essential part of our journey—your passion and ideas continue to drive us forward!\n\n**Are there any stories about how players have engaged with *Fallout 76* that you’d like to reflect on?**\n\nAfter Season 1 of the Fallout TV show dropped, we saw an amazing number of players, both new and old, come in and play. Our community responded in a way that I had never seen before. They build CAMPs right out in front of Vault 76 with signs saying, “Welcome New Players!”. Then they dropped weapons, armor, and plans in the donation box and on the ground for players to pick up and give them a good headstart into Appalachia. It says a lot about our community and just how much they enjoy playing together in *Fallout 76*.\n\n**What is the team most looking forward to in 2026?**\n\nI don’t know if there’s a single release we’re *most* looking forward to, but we do have a lot of things planned for next year. We have the native versions for Xbox Series X/S and PlayStation 5 coming, a bunch of changes to events and rewards, and my favorite hint at content so far from Jon Rush (Creative Director for Fallout 76) is… *“The Barndoors in Graninger Farmstead open once twilight has drawn nigh.”*\n\nStay Tuned…\n\n[**Back to Top]**\n\n[!\\[Fallout 76\\](https://store-images.s-microsoft.com/image/apps.52422.70143269474194625.39cdcba3-72ed-4d19-8905-12c623cabf84.1fcb29f5-446b-444d-b598-ead055d4ab17?w=400&#038;h=600)](https://www.microsoft.com/en-us/store/apps/bs6wj2l56b10)\n\n## Fallout 76\n\nBethesda Softworks\n\n☆☆☆☆☆ 1318\n\n★★★★★\n\n$39.99\n\n$31.99\n\n[Get it now](https://www.microsoft.com/en-us/store/apps/bs6wj2l56b10)\n\nXbox One X Enhanced\n\nXbox Game Pass\n\nBethesda Game Studios, the award-winning creators of Skyrim and Fallout 4, welcome you to Fallout 76. Twenty-five years after the bombs fell, you and your fellow Vault Dwellers—chosen from the nation’s best and brightest – emerge into post-nuclear America on Reclamation Day, 2102. Play solo or join together as you explore, quest, build, and triumph against the wasteland’s greatest threats. Explore a vast wasteland, devastated by nuclear war, in this open-world multiplayer addition to the Fallout story. Experience the largest, most dynamic world ever created in the legendary Fallout universe.\n\nDiscover a new desert biome called Burning Springs, located in post-nuclear Ohio, where an intelligent Super Mutant called The Rust King rules over Deathclaws and raiders. Head to the local watering hole and meet a well-known gunslinger looking to give out Bounty Hunts – The Ghoul from the Fallout TV series. The Ghoul from the Fallout TV series is open for business in Burning Springs – take on low level Bounty Hunting events to earn more daring challenges and earn caps and legendary items. More dangerous bounties also give a chance to earn one of dozens unique mods benefitting both human and ghouls. Team up to complete two new public events: Aid the Rust King’s Beastmaster with their menagerie of Deathclaws used in the arena in “Gearing Up” and protect the citizens of Highwaytown from a volatile swarm of Radscorpions and Stingwings in “Sinkhole Solutions!”.\n\nImmersive Questlines and Engaging Characters Uncover the secrets of West Virginia by playing through an immersive main quest, starting from the moment you leave Vault 76. Befriend or betray new neighbors who have come to rebuild, and experience Appalachia through the eyes of its residents.\n\nSeasons Progress through each season and unlock free rewards like consumables, C.A.M.P. items and more, by completing limited-time challenges.\n\nMultiplayer Roleplaying Create your character with the S.P.E.C.I.A.L system and forge your own path and reputation in a new and untamed wasteland with hundreds of locations. Whether you journey alone or with friends, a new and unique Fallout adventure awaits.\n\nMountain Splendorland The story lives and breathes through the world of Fallout 76, which brings to life six distinct West Virginia regions. From the forests of Appalachia to the noxious crimson expanses of the Cranberry Bog, each area offers its own risks and rewards.\n\nA New American Dream Use the all-new Construction and Assembly Mobile Platform (C.A.M.P.) to build and craft anywhere in the world. Your C.A.M.P. will provide much-needed shelter, supplies, and safety. You can even set up shop to trade goods with other survivors.\n\nFallout Worlds Play unique adventures in Appalachia with Fallout Worlds, which is an evolving set of features that give players the capability to play Fallout 76 in unique ways with customizable settings.\n\n# **Gears of War: Reloaded**\n\n**What would you like to say to your players after releasing *Gears of War: Reloaded* this year?**\n\nOn behalf of the team at The Coalition and our partner studios Sumo & Disbelief, we’d like to say thanks for playing! Whether you’ve been with us since 2006 or you picked up a Lancer for the first time this year on a new platform, you’re a part of the Gears family and we salute you for spending time with us.\n\n**How does it feel to have your game out there after development?**\n\nIt’s been so cool to see players come together without barriers for the first time in Gears’ almost 20-year history. Seeing our community fight side by side whether through the campaign story or in Versus reaffirms and reminds us why we make Gears: because gaming brings us together.\n\n**What is the studio most looking forward to in 2026?**\n\nNext year marks the 20th anniversary of Gears of War, and we can’t think of a bigger way to celebrate than with the release of *Gears of War: E-Day*. This is our most ambitious game yet, entirely built from scratch in Unreal Engine 5 to feel like Gears and play like new. This is a return to our roots as Marcus & Dom face the Locust for the first time ever. It’s the best place to jump into the Gears universe and we can’t wait to share more next year.\n\n[**Back to Top]**\n\n[!\\[Gears of War: Reloaded\\](https://store-images.s-microsoft.com/image/apps.55549.14083498106527717.baf556ff-4380-4b5b-9e66-afb4977d6535.ed9482e8-90c6-4198-952b-9a084078cb92?w=400&#038;h=600)](https://www.microsoft.com/en-us/store/apps/9p8ps6993lsl)\n\n![Xbox Play Anywhere](https://assets.onestore.ms/cdnfiles/sfw-service-web-onestore-onerf-2017-11-8-12/store/common/images/xpalogo_black.png)\n\n## Gears of War: Reloaded\n\nXbox Game Studios\n\n☆☆☆☆☆ 316\n\n★★★★★\n\n$39.99\n\n$19.99\n\n[Get it now](https://www.microsoft.com/en-us/store/apps/9p8ps6993lsl)\n\nPC Game Pass\n\nXbox Game Pass\n\nTHE DEFINITIVE RELEASE\n\nThe Original, Remastered: Powered by Unreal Engine, Gears of War: Reloaded is a remaster of the blockbuster first Gears of War, now fully optimized for the latest generation of gaming platforms.\n\nAll Included: Gears of War: Reloaded delivers all post-launch content for the original title, including a bonus campaign act, multiplayer maps, plus characters and cosmetics, at no additional cost.\n\nRefined Controls: Newcomers can choose a modern, streamlined control layout, while veterans can relive the classic feel they love.\n\nBUILT FOR BROTHERHOOD\n\nCampaign Co-Op: Crush the Locust threat together through campaign split-screen or online co-op. Fight on with your squad in Versus multiplayer running at up to 120fps with unmatched clarity and visual fidelity.\\*\n\nCross Play: Gears of War: Reloaded supports cross-play across all platforms, allowing you and your friends to squad-up, regardless of where you play.\\*\n\nCross Progression: Jump from one platform to another and your campaign saves as well as multiplayer progression will come with you. Signing in with your Microsoft Account required is for cross progression.\\*\n\nOPTIMIZED FOR XBOX & PC:\n\nNatively Optimized for Xbox Series X|S: The iconic original now looks and plays better than ever with lightning-fast load times, 4K assets plus remastered textures, lighting, shadows and reflections, HDR and Dolby Vision, Dolby Atmos, as well as up to 120 FPS in multiplayer.\\*\n\nOptimized for PC & Handhelds: In addition to stunning remastered visuals, Gears of War: Reloaded also delivers PC-first features such as ultrawide support, a benchmark mode, variable refresh rate, mouse and keyboard support, FSR3.1 and DLSS3.5 Super Resolution support as well as controller remapping.\n\n\\*4K, HDR & 144FPS: requires capable display. Co-Op: campaign split-screen not available on PC or handhelds.\n\n# **Grounded 2 (Game Preview)**\n\n**What would you like to say to your players after releasing *Grounded 2* this year?**\n\nThe *Grounded 2* team at Obsidian and our partners at Eidos-Montréal were so excited to get our game into the hands of players in Early Access/Game Preview in July this year.  Grounded has the greatest community and finally getting them into and playing the sequel and letting us learn from their experiences and thoughts is taking us into a stage where we are truly developing the game with our fans. The most exciting aspect is that so many folks were willing to jump into and start playing *Grounded 2* even on day one. It’s been inspiring and makes us excited about the things we have coming in the next year and beyond for the park. Basically, we’re totally geeked up and ready to go!\n\n**How does it feel to have your game out there?**\n\nSince *Grounded 2* is in Early Access/Game Preview, we’re still in the midst of development, but that’s what makes it so cool. Developing with the community is unlike trying to make everything perfect and releasing all at once. Instead, we can put some things out there, warts and all, and let the fans tell us what’s working and what isn’t.\n\nWhat I will say is that the reception for the game has been so very encouraging. Both here at Obsidian and our partners up at Eidos-Montréal were invigorated by the reception when we went live. And that has helped us push ourselves down the paths that are working and loved by the community.\n\nAnd I just gotta say, working on a game is great, but shipping a game is awesome. We’re going to be shipping pieces of this game for the foreseeable future and each of those is super exciting for us. We can’t wait to bring more *Grounded 2* to players and hope that they’ll love it as much or more than what’s available now.\n\n**Are there any stories about how players have engaged with your game that you’d like to reflect on?**\n\nThe single most satisfying thing for us on *Grounded 2* was the reception of the Buggies – your insect mounts. We felt from the very beginning of the project that this was going to be huge, but that it needed to be completely integrated into the overall experience. Our efforts on that feel like they’ve paid off. What we are hearing isn’t, “They should have done this better.” It’s more about how we are now talking amongst ourselves and saying, “We can and should do more and more and more of this.” That’s gratifying and has made us reevaluate how to bring more buggies and more buggy features online sooner.\n\nOn the other side, the less positive side, we are seeing that builders are less impressed with our offering. So we’ve changed some of our plans and accelerated some of our schedules to bring more building stuff online sooner. We want builders to be way more excited about building in *Grounded 2* than in *Grounded (1)* and we are focusing on getting there in the first half of 2026.\n\n**What is the studio most looking forward to in 2026?**\n\nWe have a lot of fun stuff coming up in updates to *Grounded 2* in 2026 (and beyond!). We’re going to have an entire community garden added to the park very early in the year in our Winter Update, followed by a mid-sized update in the Spring, and then a really massive and (fingers crossed) awesome update coming in the Summer. Of course there will be more to come after that but *Grounded 2* players can expect more of everything soon: more places to explore, more buggies, more armor and equipment, and more mysteries to solve. We are looking forward to bringing all these things to the players and continuing to make this game together.\n\n[**Back to Top]**\n\n[!\\[Grounded 2\\](https://store-images.s-microsoft.com/image/apps.54353.14609679373210979.beb28026-7f6b-4b1f-b526-43d0d04b269b.6dcfd9cd-f291-4121-b9d8-a09dd620a5c3?w=400&#038;h=600)](https://www.microsoft.com/en-us/store/apps/9p77pg7dk0w2)\n\n![Xbox Play Anywhere](https://assets.onestore.ms/cdnfiles/sfw-service-web-onestore-onerf-2017-11-8-12/store/common/images/xpalogo_black.png)\n\n## Grounded 2\n\nXbox Game Studios\n\n☆☆☆☆☆ 502\n\n★★★★★\n\n$29.99\n\n[Get it now](https://www.microsoft.com/en-us/store/apps/9p77pg7dk0w2)\n\nPC Game Pass\n\nXbox Game Pass\n\nShrunk again, but the world is much larger. Survive a sprawling open world alone or in co-op with friends. Craft weapons, forge armor, and build bases while exploring the park on your trusty Buggy mounts. Unravel hidden mysteries and face unexpected threats. But something else is out there—and it hasn’t forgotten you. Shrunk to the size of an ant, you’ll find once-familiar spaces turned into a sprawling, uncharted frontier. Survive alone or in co-op with friends, crafting weapons, forging armor, and building bases as you explore manmade playgrounds overgrown by nature. Traverse this new realm on trusty Buggy mounts—your capable allies—and uncover the mysteries lurking beneath bright colors and towering structures. But stay wary: something else is out there, and it hasn’t forgotten you.\n\nSurvive, Adapt, Overcome The world is relentless, but so are you. Shape your adventure with unique archetypes, each offering distinct abilities to match your playstyle. Whether you rely on precision, cunning, or sheer strength, you’ll need every advantage to survive against the threats lurking in the park.\n\nStronger Together The perils of the park are daunting alone, but with friends, every challenge becomes an adventure. Work together to build, fight, and uncover the secrets buried beneath the grass. Whether you’re facing danger side by side or continuing your journey in a shared world, survival is always better with allies.\n\nBecause Walking is Bogus They scurry, they fight, and now—they help you survive. Hatch, raise, and ride your own insect friends – Buggies! Saddle up and traverse through the park, fight on them or alongside them in battle, or use them to gather resources and build your base. The right partner could mean the difference between thriving and barely surviving.\n\nA Shadow That Follows You The threat is always there—watching, learning, waiting. You don’t know where it’s coming from, only that it never leaves. The deeper you dig, the closer it gets. Some mysteries should stay buried, but it’s too late now. It knows you’re looking. And it’s ready. Every answer drags you deeper, every step invites something closer. You were never alone. You thought you were in control. You were wrong.\n\n# **Heretic + Hexen**\n\n**What would you like to say to your players after releasing *Heretic + Hexen* this year?**\n\nEveryone who worked on *Heretic + Hexen* at id and Nightdive Studios would like to express our thanks for playing, writing about, and making videos about our little corner of classic re-releases. We hope you were able to have fun revisiting old memories or perhaps be introduced for the first time to a game you never knew existed.\n\n**How does it feel to have *Heretic + Hexen* out there after development?**\n\nBeing able to release at QuakeCon and getting to talk with everyone playing it live for the first time is such a fulfilling moment, especially for a game release that was unexpected like *Heretic + Hexen*’s. Releasing any game is always a huge, stressful effort, but the rush of that first couple of days after release is always worth it.\n\n**Are there any stories about how players have engaged with your game that you’d like to reflect on?**\n\nA big shoutout to the team of folks within the community that have taken up the mantle of collecting and uploading high quality, tested, versions of classic episodes. Be sure to load up the mods browser and be on the lookout for uploads marked “Bethesda Edition” and play through the best of what the community has put out over the years!\n\n[**Back to Top]**\n\n[!\\[Heretic + Hexen\\](https://store-images.s-microsoft.com/image/apps.45242.13568632792554292.fea70ec4-25b5-4014-996b-52c5abc58b71.3631a6a8-0f15-49b7-8ffc-b7ddb5d0dd2a?w=400&#038;h=600)](https://www.microsoft.com/en-us/store/apps/9nc7nrd0cm11)\n\n![Xbox Play Anywhere](https://assets.onestore.ms/cdnfiles/sfw-service-web-onestore-onerf-2017-11-8-12/store/common/images/xpalogo_black.png)\n\n## Heretic + Hexen\n\nBethesda Softworks\n\n☆☆☆☆☆ 217\n\n★★★★★\n\n$14.99\n\n$10.04\n\n[Get it now](https://www.microsoft.com/en-us/store/apps/9nc7nrd0cm11)\n\nPC Game Pass\n\nXbox Game Pass\n\nForged by Raven Software on a modified DOOM engine, Heretic and Hexen were released in 1994 and 1995, pushing first person shooters into bold new territory. These innovative cult classics introduced groundbreaking features like inventory systems, vertical aiming, and distinct character classes, reshaping first person action games for generations to come. This enhanced restoration makes Heretic + Hexen available to new audiences and long-time fans with expanded accessibility across more platforms and languages than ever before. Whether you're returning to these shadowy realms or discovering them for the first time, an epic legacy awaits.\n\nOwners Receive • Heretic: Shadow of the Serpent Riders • Hexen: Beyond Heretic • Hexen: Deathkings of the Dark Citadel • Two all-new episodes created in collaboration between individuals at id Software + Nightdive Studios: o Heretic: Faith Renewed o Hexen: Vestiges of Grandeur\n\n© 2025 ZeniMax Media Inc. id, id Software, Bethesda, Bethesda Softworks, and ZeniMax are trademarks of the ZeniMax group of companies. All rights reserved. HERETIC and HEXEN are trademarks of Activision Publishing, Inc. HERETIC and HEXEN: BEYOND HERETIC © 1994-2020 Raven Software. All rights reserved.\n\nhttps://eulas.bethesda.net/Heretic%20+%20Hexen\n\n# **Indiana Jones and the Great Circle: The Order of Giants**\n\n**What would you like to say to your players after releasing the expansion to *Indiana Jones and the Great Circle* this year?**\n\nSeeing all the Indiana Jones fans out there still playing and enjoying the timeless adventures of this beloved character through our passion project truly warms our hearts! It feels incredibly exciting to deliver a strong, mysterious, story-driven DLC that gives fans of the base game even more thrilling exploration and action in enigmatic temples, amidst forgotten and hidden secrets!\n\nWe are really happy and thankful to all the gamers out there who continue to show such strong support for our games—thank you!\n\n**How does it feel to have *Indiana Jones and the Great Circle: The Order of Giants* out there after development?**\n\nIt was an amazing experience to continue creating more Indiana Jones adventures after wrapping up the main game. We already had everything in place, which allowed us to quickly dive back into making the things we loved from the first game—mysterious, intricate adventures, secrets around every corner, and a high-quality experience for fans of strong adventure games. We feel very fortunate to be in a position where we could deliver another chapter to our Indiana Jone’s story.\n\n**Are there any stories about how players have engaged with the game that you’d like to reflect on?**\n\nOne of the most enjoyable things to witness as players explore the game is the incredible amount of time they spend in different areas! We constantly hear stories about how much time people dedicate to the sandboxes, uncovering secrets and hunting down every collectible.\n\nWhat’s even more amazing is how many players gather around the game as a family. We’ve heard stories of gamers playing together with their children—and even their parents. Fantastic! In a sense, it has truly become a generational game, exactly what we hoped for!\n\n**What is the team most looking forward to in 2026?**\n\nThe team at MachineGames is currently looking forward to creating more exciting games for our fans, and we still feel overwhelmed by the tremendous love and support we’ve received so far with the release of *Indiana Jones and The Great Circle: The Order of Giants*!\n\nSince we’re also gamers at MachineGames, we’re thrilled about all the amazing and creative games coming from so many other talented studios. It’s truly a great time to be alive if you love playing high-quality games.\n\n[**Back to Top]**\n\n[!\\[Indiana Jones and the Great Circle™: The Order of Giants\\](https://store-images.s-microsoft.com/image/apps.48751.14503474732147915.f3b03d92-f8d7-44b4-835f-f79bde6279b7.56f89422-d754-4faf-8528-60074bae092b?w=400&#038;h=600)](https://www.microsoft.com/en-us/store/apps/9p1w94sb1zvn)\n\n## Indiana Jones and the Great Circle™: The Order of Giants\n\nBethesda Softworks\n\n☆☆☆☆☆ 51\n\n★★★★★\n\n$19.99\n\n[Get it now](https://www.microsoft.com/en-us/store/apps/9p1w94sb1zvn)\n\n\\*INDIANA JONES AND THE GREAT CIRCLE™: THE ORDER OF GIANTS DLC WILL BE AVAILABLE FOR PURCHASE SEPARATELY FROM SEPTEMBER 4 11:00AM EDT, 2025 (BASE GAME REQUIRED TO PLAY)\n\nThere is a myth of a beast in the hidden depths of Rome, rumored to guard a terrible secret. Indiana Jones and the Great Circle™: The Order of Giants DLC is an all-new story chapter that takes Indiana Jones to the ancient streets of Rome where forgotten catacombs twist into something far more sinister. Indy must outwit a dangerous cult and decipher intricate puzzles designed by emperors to uncover the dark legacy of the Nephilim giants.\n\nMYSTERIES OF THE ROMAN EMPIRE AWAIT When Indiana Jones encounters Father Ricci, a young priest desperate for help to track down a Roman artifact, a standard treasure hunt soon turns into a perilous journey. Along the way Indy must face the sinister plots of Emperor Nero and his gladiator games, the enigmatic Cult of Mithras, and whatever else lurks in the shadows. Can Father Ricci's cryptic knowledge guide Indy through these treacherous passageways? Only Indiana Jones can piece together this breathtaking mystery.\n\nEXPLORE THE SHADOWS OF ROME Danger awaits as The Order of Giants takes Indiana Jones beyond the walls of Vatican City and into a brand new open-area map in the bustling city of Rome. Adventure through the crumbling ruins of the Colosseum to the pristine Vatican Gardens. The mystery will also take you into Rome’s ancient sewer system, the Cloaca Maxima, and deeper below ground to foreboding crypts.\n\nA DANGEROUS CULT The secretive, centuries old Cultists of Mithras are everywhere, striking from the shadows. Their dark red robes reflect the blood oaths to their cause, and they’re willing to kill or die to protect the ancient power they serve.\n\n\\*Base Game required (sold separately)\n\n# **Keeper**\n\n**What would you like to say to your players after releasing *Keeper* this year?**\n\nThanks for playing and reaching out to tell us about your experiences with *Keeper*! More than any other game I’ve led, players have been sharing a lot about their time with *Keeper*. For some, it’s been the emotion of the game that resonated with them, for others it’s the striking, painterly world, and for some it’s just that *Keeper* is something different and unexpected – a real palate cleanser!\n\n**How does it feel to have the game out there after development?**\n\nIn a word: amazing! Game developers work so hard for years to make and ship a compelling game – but you’re never sure if it will connect with players until it’s shipped and out in the wild. So it’s been wonderful that *Keeper* has received so much positive feedback! The team has watched a lot of fun streams and read all sorts of social media posts; it’s incredibly rewarding to see players engaging with the game, having fun, and discussing what they think the game is about.\n\n**Are there any stories about how players have engaged with your game that you’d like to reflect on?**\n\nLots of people have been playing this game with friends, their partners, or children. It’s a great game to experience with a loved one. A player reached out to tell us that they played the game with their twin daughters. Immediately after finishing the game, their daughters – through sobs – told their parent that they would be starting the game over the following day! That sort of thing is just amazing to hear– those personal experiences are good reminders that video games are meaningful to a whole lot of people in different ways.\n\n[**Back to Top]**\n\n[!\\[Keeper\\](https://store-images.s-microsoft.com/image/apps.14247.13566978592979529.8c034f7f-7f73-4897-9410-31e1512536ea.6b82459c-abd9-4712-b097-0d1164781ebe?w=400&#038;h=600)](https://www.microsoft.com/en-us/store/apps/9ncjwhhmvhr0)\n\n![Xbox Play Anywhere](https://assets.onestore.ms/cdnfiles/sfw-service-web-onestore-onerf-2017-11-8-12/store/common/images/xpalogo_black.png)\n\n## Keeper\n\nXbox Game Studios\n\n☆☆☆☆☆ 263\n\n★★★★★\n\n$29.99\n\n$23.99\n\n[Get it now](https://www.microsoft.com/en-us/store/apps/9ncjwhhmvhr0)\n\nPC Game Pass\n\nXbox Game Pass\n\nFrom Lee Petty and Double Fine Productions, Keeper is a beautiful and surreal otherworldly adventure, and a story told without words.\n\nOn an island in a long-lost sea, a forgotten lighthouse stands dormant in the shadow of a distant mountain peak. As withering tendrils spread and coalesce, it awakens. Taken with a mysterious sense of purpose and joined by a spirited seabird, it embarks upon a heartening tale of unlikely companionship, an odyssey of mystifying metamorphosis, and an unexpected journey towards the center of the island, into realms beyond understanding.\n\n# **Minecraft**\n\n**What would you like to say to your players after *Minecraft*‘s updates and additions this year?**\n\nI want to offer our players and creators a massive thank you for going on this journey with us this year. You inspire us every day. It’s been an incredible year for our team and our amazing community. This year alone, we released Mounts of Mayhem, The Copper Age, Chase the Skies, Spring to Life, and Vibrant Visuals! We’ve seen Minecraft creators deliver new games like *Soul Steel*, *Mobmaze*, and embrace Vibrant Visuals to create beautiful experiences like *Prizma Visuals*, *Luminous Dreams*, and *Dark Fantasy Visuals*. And earlier this year, we got to see the world’s incredible response to ‘A Minecraft Movie’.\n\n**Are there any stories about how players have engaged with the game that you’d like to reflect on?**\n\nEvery month, we receive hundreds of letters from players and fans across the world. Reading them is one of the most grounding parts of my job. People don’t just tell us what they’ve built – they tell us why it matters, and how *Minecraft* has woven itself into real moments in their lives.\n\nWhat stands out most is how often players describe *Minecraft* as something that brings them closer to the people they care about. They talk about worlds created with childhood friends that have lasted for years – sometimes a decade or more. They write about stepping away as life takes over… and then returning to those very same worlds as adults, opening the door to a place that still feels like home. Even when the world around them can feel heavy.\n\nWe hear from fathers and sons, mothers and daughters, college roommates, long-distance partners – all using *Minecraft* as a space to create, explore, laugh, problem-solve, and stay connected. These stories aren’t just heartwarming; they’re a reminder of the power of play.\n\nOver time, *Minecraft* has naturally found its way into life’s milestones: birthday parties, classroom projects, family traditions, and quiet moments when someone simply needed a place to feel safe and creative. Parents tell us they trust the environment we’ve created, and that all people feel welcome. And that’s ultimately why *Minecraft* holds such a special place in so many hearts: I’m reminded that *Minecraft* isn’t just a game – it’s a place where memories are built, shared, and carried forward. This inspires our team to keep building this game forward for generations to come.\n\n**What is the studio most looking forward to in 2026?**\n\n2026 is going to be a great year for the *Minecraft* community. We have so much in store for next year and the team is hard at work. We’re always listening to our community and excited to continue to evolve the game alongside all of them. Our creators are building some incredible experiences that will be going live all year and I can’t wait for our players to get their hands on our new game drops – there’s some amazing new features and content that we think the community will love.\n\n[**Back to Top]**\n\n[!\\[Minecraft\\](https://store-images.s-microsoft.com/image/apps.53095.13850085746326678.06e2dc5c-7997-46e9-a8e6-0e48b57cb13b.419e3c9d-9dd3-4a28-a9f3-a12350215871?w=400&#038;h=600)](https://www.microsoft.com/en-us/store/apps/9MVXMVT8ZKWC)\n\n## Minecraft\n\nMicrosoft Studios\n\n☆☆☆☆☆ 2000\n\n★★★★★\n\n$19.99\n\n$14.99\n\n[Get it now](https://www.microsoft.com/en-us/store/apps/9MVXMVT8ZKWC)\n\nXbox One X Enhanced\n\nXbox Game Pass\n\nCREATE Build whatever you can imagine in your own infinite world that’s unique in every playthrough.\n\nEXPLORE Discover biomes, resources and mobs, and craft your way through a world filled with surprises in the ultimate sandbox game.\n\nSURVIVE Experience unforgettable adventures as you face mysterious foes, traverse exciting landscapes, and travel to perilous dimensions.\n\nPLAY TOGETHER Have a blast with friends, whether you’re sitting on the same couch in split screen or miles apart in cross-platform play for console, mobile and PC. Connect with millions of players on community servers or subscribe to Realms Plus to play with up to 10 friends on your own private server.\n\nVIBRANT VISUALS Vibrant Visuals is Minecraft’s biggest official visual enhancement – delivering a dazzling cosmetic upgrade with a new modern graphics pipeline and an array of visual improvements. Sunrises are more vivid, water reflects, forests become shaded, and more!\n\nEXPERIENCE MORE Get creator-made add-ons, thrilling worlds, and stylish cosmetics on Minecraft Marketplace. Subscribe to Marketplace Pass (or Realms Plus) to access 150+ worlds, skin & textures packs, and more – refreshed monthly.\n\nTo switch to Vibrant Visuals on Xbox One and Xbox One S, players need to select \"Vibrant Visuals\" in the Video menu using the Graphics Mode drop-down. Performance may degrade for these consoles.\n\nMarketplace Add-Ons, Skins, and Persona items will work with Vibrant Visuals, however, Worlds and Texture Packs are not compatible with the new mode at this time.\n\nSplitscreen multiplayer is not supported with Vibrant Visuals and the game will switch to Fancy or Simple rendering if multiple players are joined locally.\n\n# **Ninja Gaiden 4**\n\n**What would you like to say to your players after releasing Ninja Gaiden 4 this year?**\n\nOur deepest thanks to everyone who has played the game, from the Master Ninjas who have been supporting the series for a long time, to those who are playing the series for the first time! Our days were spent developing the game so that players can enjoy the series’ signature intensity and a variety of actions to overcome difficult situations, so I’m happy if you experienced even a bit of the game! I think the flavor of the action really comes through the more you play it, so please continue to enjoy the different characteristics of the two Master Ninjas, Yakumo and Ryu! – *Hirayama*\n\nTo everyone who has supported Ninja Gaiden over the years, and to those how have started playing the series from this entry, thank you for playing the game. I enjoy watching your gameplay videos and comments on social media every day. In this game, we aimed for the revival of pure action that transcends time, and the three companies put everything into developing it. The action is really exciting and it’s a stoically made game, so those of you who have played the game please continue to thoroughly study it… and those who haven’t played it yet, I’ll be thrilled if you give this feel good slash action a try! – *Nakao*\n\n**How does it feel to have the game out there after development?**\n\nFirst of all, to be able to deliver a new numbered title in the series after 13 years is something that our entire team is truly happy about. We continuously debated and adjusted the game towards its launch, and once it was released it felt like it passed in an instant so I didn’t feel anything immediately, but as I saw social posts and videos being posted every day, little by little I began to feel joy. – *Hirayama*\n\nFor our development team, there are many members who, during the golden age of slash action games, were players or were involved as developers. So, while we had confidence in the game itself, I felt more nervous and excited than I have ever been before. And my current feeling is of relief, since the action has been well received. *– Nakao*\n\n**Are there any stories about how players have engaged with your game that you’d like to reflect on?**\n\nFor a long time, we were in the dark while developing this game but seeing everyone playing and reacting to it at gaming events was a big driving force in development, and we made use of it in the final adjustments towards launch. Thank you again for your support! Post-launch, we are checking every single piece of feedback, so please look forward to future in-game updates! – *Hirayama*\n\nAlthough I’ve mentioned it several times, we’ve been receiving a lot of feedback that, “the action definitely feels good!”, and it’s the part we’ve put our most effort into, so I am extremely happy that everyone is pleased with it. In this game we’ve taken the big challenge of mixing the best parts of Ninja Gaiden with the best parts of PlatinumGames’ action, so nothing makes me happier than hearing everyone enjoying the action. *– Nakao*\n\n**What is your studio most looking forward to in 2026?**\n\nWe are really looking forward to everyone playing “The Two Masters,” the additional content currently in development! In addition to new weapons for Yakumo and Ryu, we are planning on an additional story and other replayable content. We’re working hard to deliver it as soon as we can, so please wait a little bit longer! – *Hirayama*\n\nThere are many games coming out next year, and as always, several action games will be released, so as an action game maker we are looking forward to seeing these games. For us, in 2026 we are planning to release additional content for *Ninja Gaiden 4*, “The Two Masters,” which we are currently hard at work developing. Not only is there content such as a new story, but above all the new weapons for each character will provide a new play experience unlike any of the previous weapons, so we hope you look forward to it! *– Nakao*\n\n[**Back to Top]**\n\n[!\\[NINJA GAIDEN 4 Standard Edition\\](https://store-images.s-microsoft.com/image/apps.26007.14524843898704391.85a1bf00-ba10-44d9-90b4-d20f9cb73fb6.da3a1785-ad9e-463f-ae57-2ec1f5f94999?w=400&#038;h=600)](https://www.microsoft.com/en-us/store/apps/9n7358jzpx1z)\n\n![Xbox Play Anywhere](https://assets.onestore.ms/cdnfiles/sfw-service-web-onestore-onerf-2017-11-8-12/store/common/images/xpalogo_black.png)\n\n## NINJA GAIDEN 4 Standard Edition\n\nXbox Game Studios\n\n☆☆☆☆☆ 447\n\n★★★★★\n\n$69.99\n\n$48.99\n\n[Get it now](https://www.microsoft.com/en-us/store/apps/9n7358jzpx1z)\n\nPC Game Pass\n\nXbox Game Pass\n\nThe definitive ninja hack & slash franchise returns with NINJA GAIDEN 4! Embark on a cutting-edge adventure where legacy meets innovation in this high-octane blend of style and no-holds-barred combat.\n\nReturn of the Legend Experience a return to the intense, high-speed combat that established NINJA GAIDEN as a premier action game series. Prepare for a legacy reborn with captivating style for a new generation of players.\n\nEpic Hack and Slash Combat, Evolved NINJA GAIDEN 4 fuses Team NINJA’s tempered combat philosophy with the stylish, dynamic action gameplay of PlatinumGames. Engage in visually stunning combat that rewards precision and strategy. Use Bloodbind Ninjutsu to transform your weapons and unleash devastation upon your enemies, alongside legacy techniques like the Izuna Drop and Flying Swallow. The legendary Ryu Hayabusa also returns with a revamped yet familiar set of tools to master. With a customizable player experience, NINJA GAIDEN 4 will push action game veterans to their limits while allowing newcomers to enjoy a heart-pounding adventure full of twists and turns.\n\nAn Ancient Enemy Returns An endless rain of miasma hangs over a near-future Tokyo in the wake of an ancient enemy’s resurrection. The fate of the city lies in the hands of young ninja prodigy, Yakumo. Fighting his way through cybernetic ninja soldiers and otherworldly creatures, Yakumo must reconcile a destiny he shares with the legendary Ryu Hayabusa himself and free Tokyo from the ancient curse that brought the city to its knees.\n\n# **The Outer Worlds 2**\n\n**What would you like to say to your players after releasing *The Outer Worlds 2* this year?**\n\nThe most important thing I have to say is thank you. The response has been overwhelming and I can’t thank our fans enough for all the support they have given us. Sometimes when you are making a game you can feel lost. For, like, 90% of making an RPG it feels like a big mess – so many systems incomplete, and you just aren’t sure if things will fully come together. You have faith and experience, but you never truly know until it’s in the hands of the players. Then, you see how happy the fans are, and it reminds you why you go through those hard times. It’s because the game brings genuine happiness and that is a badass feeling.\n\n**How does it feel to have your game out there after development?**\n\nIt’s a strange feeling. In all of my years making games at Obsidian I’ve never felt it before. It’s a mixture of relief and excitement, but also some sadness.\n\nIt’s a thrill to see players get into the game and fall in love with all of the stuff we were hoping would resonate with them. It’s also a huge weight off of my shoulders after all of this time. I feel an enormous responsibility to our fans to give them the kind of RPG that I would want if I were them and I feel like we have delivered. That wasn’t a given, though, so it is good to see people really enjoying what we’ve put together for them.\n\nThe development of *The Outer Worlds 2* has been the longest of my career and the one that I’ve put the most of myself into during development. It’s such a relief to get it out to all of our fans, but there is now some undeniable sadness. It’s like watching your child go away to college or something. You’re proud of the accomplishments, but you’re sad to see something that was such a large part of your life go out into the world.\n\n**Are there any stories about how players have engaged with your game that you’d like to reflect on?**\n\nI’m not sure about specific stories, but I’ve been happy to see the positive reception to some of the deeper roleplaying mechanics we’ve added – like our revamped Flaws system. Seeing people’s excitement over all of the fun and interesting ways they can trigger flaws definitely brings a smile to my face. It’s the kind of found joy that I really love in games and, specifically, in RPGs. Just when you find something that wasn’t telegraphed in any way and feels like it was custom made for you. It’s the reason I fell in love with RPGs and I hope it makes other gamers fall in love with the genre in the same way. I was also a bit worried that some gamers may not enjoy that type of character development, but it gives me hope that we can really explore those types of RPG systems in future games I make. I think it gives us some leeway to do more experimenting in the future.\n\n**What is the studio most looking forward to in 2026?**\n\nI can’t speak for the studio, but I’m excited to work with the team to continue adding to *The Outer Worlds 2*. We have a couple of DLCs coming out and we are also talking about what kind of continual improvements we want to release to the players over the next year. We have a ton of ideas – everything from new features to quality-of-life improvements that players have been asking for when we talk to them. It’s an exciting time for us and I can’t wait to share more info once we get deeper into the planning.\n\n[**Back to Top]**\n\n[!\\[The Outer Worlds 2\\](https://store-images.s-microsoft.com/image/apps.1625.14086924108488409.5098cc78-dcb3-4bc1-858f-48fa36bb7026.82fc166e-9b79-4523-90d9-560ddb388864?w=400&#038;h=600)](https://www.microsoft.com/en-us/store/apps/9p8rmkxrml7d)\n\n![Xbox Play Anywhere](https://assets.onestore.ms/cdnfiles/sfw-service-web-onestore-onerf-2017-11-8-12/store/common/images/xpalogo_black.png)\n\n## The Outer Worlds 2\n\nXbox Game Studios\n\n☆☆☆☆☆ 332\n\n★★★★★\n\n$69.99\n\n$48.99\n\n[Get it now](https://www.microsoft.com/en-us/store/apps/9p8rmkxrml7d)\n\nPC Game Pass\n\nXbox Game Pass\n\nThe Outer Worlds 2 is the eagerly-awaited sequel to the award-winning first-person sci-fi RPG from Obsidian Entertainment (just look at the exciting number of dashes in this sentence!). Time to clear your calendar – get ready for an action-packed adventure with a new crew, new weapons, and new enemies in a new colony! So much newness!\n\nAs a daring and most likely good-looking Earth Directorate agent, you must uncover the source of devastating rifts threatening to destroy all of humanity. Your investigation leads to Arcadia, home of skip drive technology, where the fate of the colony, and ultimately the entire galaxy, rests on your decisions—your strengths, your flaws, your crew, and the factions you choose to trust.\n\nExplore a New Frontier The Arcadia colony is engulfed in a factional war, as the Protectorate’s so-called benevolent rule is challenged by the rebellion of their religious order and a corporate invasion. As destructive rifts spread across the colony, each faction fights to control or close them for their own ends. Navigate diverse zones, uncover hidden lore, and shape the fate of a system on the brink!\n\nYour Commander, Your Way Build your character with the abilities and choices that reflect your playstyle. The colony reacts to your every move, crafting a narrative that’s yours to own—whether you’re a disciple of diplomacy, an astute strategist, a crusader for chaos, or something different altogether. And yes, you can dumb!\n\nEnlist Your Companions Recruit companions with unique traits, backgrounds and goals. Whether you choose to help them achieve their ambitions or steer them toward your own objectives, your influence shapes their growth (or death), making them an integral part of the immersive story you create together.\n\n# **Overwatch 2**\n\n**What would you like to say to players after the updates to *Overwatch 2* this year?**\n\nThis year ultimately brought out the best in the Overwatch team. Inspired by the evolving landscape of the industry, we embraced the opportunity to take bold risks and focused on making impactful changes rather than playing it safe. The team launched major features like Stadium and Perks, choosing to introduce and tune them in ways that felt more daring and noticeable than in the past. The response from our community has been amazing, and we feel our relationship with our players is stronger than ever.\n\n**Are there any stories about how players have engaged with *Overwatch 2* that you’d like to reflect on?**\n\nOne standout moment was reconnecting with our players in China when we relaunched *Overwatch 2* in the region. Despite the absence, the community’s passion remained strong, with fans organizing offline events, creating art, and supporting esports. This enduring passion for the Overwatch universe highlighted how the game brings people together and means so much beyond just gameplay, reinforcing our excitement for the future.\n\n**What is the team most looking forward to in 2026?**\n\nLooking ahead, the Overwatch team is excited to deepen the universe and lore surrounding our Heroes, moving beyond their functional roles in a game. We’re eager to take creative steps that will allow the game to lean further into storytelling and character development, and we can’t wait to share these new experiences with our community. There’s a real sense of momentum and optimism within the development team, and we believe 2026 will be a year where our boldest ideas come to life.\n\n[**Back to Top]**\n\n[!\\[Overwatch® 2\\](https://store-images.s-microsoft.com/image/apps.25690.14548245473193065.c6f04a33-d52c-46ac-b8e9-47c3127dea5d.01b5b69a-8115-4af2-985f-411c7c5ac531?w=400&#038;h=600)](https://www.microsoft.com/en-us/store/apps/c1c4dzjpbc2v)\n\n## Overwatch® 2\n\nBlizzard Entertainment\n\n☆☆☆☆☆ 2000\n\n★★★★★\n\n[Get it now](https://www.microsoft.com/en-us/store/apps/c1c4dzjpbc2v)\n\nXbox One X Enhanced\n\nXbox Game Pass\n\nOverwatch 2 is an always-on and ever-evolving free-to-play, team-based hero shooter game set in an optimistic future, where every match is the ultimate 5v5 or 6v6 battlefield brawl featuring new heroes and maps, different ways to play, and unique cosmetics! Lead the charge, ambush your enemies, or aid your allies as one of Overwatch’s 40+ distinct heroes. Team up with friends, take them into battle across 25+ futuristic maps inspired by real-world locations, and master multiple unique game modes.\n\nOverwatch 2 – Season 20: Vendetta\n\nGive the Gift of Vengeance\n\nEmbrace the season in a flurry of festivity with a new DPS Hero, Winter Wonderland modes, holiday event, merry Mythics, and more!\n\nSeason 20 carves a cold path with Vendetta, the ruthless new melee DPS villain fueled by ambition and revenge. But it's not all frosty edges—celebrate the holidays in the return of Winter Wonderland! Make some merry Mischief & Magic on a whimsical new wintery map, with a midway mode twist where the props fight back in Mischief & Magic Wonderland. Earn Winter Tokens through the Winter Wonderland event to unlock festive holiday skins for Tracer, Junkrat, and Torbjörn, then step into Stadium for a fresh map with new Heroes, updates, and prizes. Top it all off with Mythic Divine Desperado Cassidy and Orisa’s Mythic Capsule Cannon packing a cascade of cheer, plus more frosty skins as you jingle all the way through Battle Pass tiers. 'Tis the season to deck your enemies' halls, claim your vengeance, and unwrap your rewards!\n\n# **Retro Classics**\n\n**What would you like to say to your players after releasing *Retro Classics* this year?**\n\nWe want to extend a huge thank you to the 1.5 million retro game enthusiasts who have come out to play. It has been inspiring for the development team to see such a great response to the tournaments, challenges, and high score leaderboards and drives us to improve the experience with every new release. *– Mike Rouse*\n\n**How does it feel to have *Retro Classics* out there after development?**\n\nAs a small studio of dedicated retro game developers, being able to work with Microsoft Studios IP and bring these legacy games to life on modern platforms has been a privilege. The passion the community has shown so far keeps the Antstream team motivated as we are not even half-way through the full catalogue of titles and still have loads of great games to come. *– Steve Cottam*\n\n**Are there any stories about how players have engaged with *Retro Classics* that you’d like to reflect on?**\n\nThe community continues to surprise us, with certain games drawing way more attention than anticipated, like *Tennis*, which continues to see strong active player numbers. Then we have some of the more obscure titles like *Venetian Blinds*, and some of the early Activision tech demos, which players seem to love despite limited gameplay – we can only speculate that that’s the best kind of nostalgia. We have also loved reading the responses to announcing the monthly game drops, with players frequently reminiscing about their favourite gameplay moments or speculating what the next launch titles will be and their excitement when we deliver. *– Mike Rouse*\n\n**What are you most looking forward to in 2026?**\n\n2026 is shaping up to be a keystone year for interactive entertainment. The industry is expecting some generation-defining titles to be launched, along with exciting new ways for gamers to access their content. Antstream are excited to continue launching titles that helped define the previous generations, and bringing the joy of retro to a new generation of gamers wherever they choose to play.” – *Oliver Woods*\n\nGames are all about telling great stories and capturing moments that surprise us. These don’t always rely on high-end devices or cutting-edge CGI, retro games can achieve these moments through simple mechanics and 8-bit graphics, which in the right moment leaves a lasting memory. It’s these moments we try to bring out in *Retro Classics* and, while the players aren’t always able to share these with us directly, we know they are happening across couches, dorm rooms and games rooms around the world every day. *– Stewart Stanbury*\n\n[**Back to Top]**\n\n[!\\[Retro Classics\\](https://store-images.s-microsoft.com/image/apps.28072.13805261594576123.3da89ecd-dd82-4eb6-8b3e-50d0e4f648d2.a8403e66-b083-443f-b9c6-e184e81fe281?w=400&#038;h=600)](https://www.microsoft.com/en-us/store/apps/9mtvj3hhtqgs)\n\n![Xbox Play Anywhere](https://assets.onestore.ms/cdnfiles/sfw-service-web-onestore-onerf-2017-11-8-12/store/common/images/xpalogo_black.png)\n\n## Retro Classics\n\nXbox Game Studios\n\n☆☆☆☆☆ 244\n\n★★★★★\n\n[Get it now](https://www.microsoft.com/en-us/store/apps/9mtvj3hhtqgs)\n\nPC Game Pass\n\nXbox Game Pass\n\nDiscover timeless classics and hidden gems with Game Pass. Retro Classics includes over 50 restored and ready-to-play games available for Xbox Game Pass members. Power up your play with community challenges, competitive leaderboards, all-new challenge modes, high-score rankings and more. Play over 50 classic games from Activision like Commando, Grand Prix, Kaboom! Mech Warrior 2: 31st Century Combat, and Pitfall! Take on friends, rivals or the entire world with unique challenges – or dive in solo – and collect achievements. Save your progress and continue later for the first time for many games. Available for Game Pass members to play on console, PC, and on supported devices with cloud gaming.\n\n# **Sea of Thieves**\n\n**What would you like to say to your players after *Sea of Thieves*’ updates and additions this year?**\n\nA huge thank-you to anyone who’s set sail in 2025! Whether you’re an old salt or you cast off on your maiden voyage this year, it’s always incredible to see players living their best pirate life and diving into our new features each season. We’ve had big updates to The Hunter’s Call and The Reaper’s Bones this year which offer two very diverse sets of activities for different kinds of players, the arrival of the Smugglers’ League to shake up how you gather and turn in treasure, and we’ve just launched Season 18, introducing a brand new boss fight with the Eternal Guard. We really appreciate everyone who’s been a part of our pirate paradise.\n\n**Are there any stories about how players have engaged with the game that you’d like to reflect on?**\n\n*Sea of Thieves* is a game that’s driven by our players’ stories, so too many to list, but our Community Weekends are always a great source of creativity and camaraderie! That was especially true for our seventh anniversary, where we organised a cake hunt in-game. We didn’t explicitly say what was happening, so it was up to our players to come together, seek out the cakes, and work out that seven riddles found nearby contained a code that would unlock an in-game title. And right now it’s the Festival of Giving, so we’ve got our *Sea of Thieves* Partners and our Pirate Legends sailing around in game giving out gifts to other crews. You love to see it!\n\n**What’s the studio most looking forward to in 2026?**\n\nWe’ve been working on a lot of exciting features and updates, and players will get their first taste of them in our Community Direct podcast in January, so that’s currently got a lot of us excited as it’ll be the big reveal of months of hard work across the team. Beyond that, I’d better not say, or I’ll risk ending up in the brig for the holidays!\n\n[**Back to Top]**\n\n[!\\[Sea of Thieves: 2025 Edition\\](https://store-images.s-microsoft.com/image/apps.58500.14554784103656548.43ed5725-f81e-40a1-b672-196a35538bfc.bede6b0d-69e1-461b-b8b3-a346882ad777?w=400&#038;h=600)](https://www.microsoft.com/en-us/store/apps/9P2N57MC619K)\n\n![Xbox Play Anywhere](https://assets.onestore.ms/cdnfiles/sfw-service-web-onestore-onerf-2017-11-8-12/store/common/images/xpalogo_black.png)\n\n## Sea of Thieves: 2025 Edition\n\nMicrosoft Studios\n\n☆☆☆☆☆ 2000\n\n★★★★★\n\n$39.99\n\n$13.99\n\n[Get it now](https://www.microsoft.com/en-us/store/apps/9P2N57MC619K)\n\nXbox One X Enhanced\n\nPC Game Pass\n\nXbox Game Pass\n\nSea of Thieves is a smash-hit pirate adventure game, offering the quintessential pirate experience of plundering lost treasures, fighting intense battles, vanquishing sea monsters and more.\n\nAdditional digital bonuses\\* include access to the Sea of Thieves Original Soundtrack – 2025 Edition, the Sea of Thieves: Athena's Fortune audiobook and The Rough Guide to Sea of Thieves eBook.\n\n\\* A Sea of Thieves website login is required to access the digital bonuses – visit www.seaofthieves.com/bonuses online and follow the instructions.\n\n# **South of Midnight**\n\n**What would you like to say to your players after releasing *South of Midnight* this year?**\n\nThank you for giving *South of Midnight* a chance. Thank you for your kind words, your messages, and your support. Most of all, thank you for exploring the world we’ve built and sharing your experiences with us… it means the world to the team.\n\n**How does it feel to have your game out there after development?**\n\nIt’s our first game as an Xbox Games Studio, and we’ve come a long way since shipping *We Happy Few*. With *South of Midnight*, we’ve grown as a team, matured as a studio, and created what we believe is our best game yet. Making this game required us to be vulnerable, to open ourselves creatively and take risks, and the result is a title that doesn’t leave players indifferent. As for us, we’re already working on our next project! The team is unified and more motivated than ever to build our next game. We’ve learned so much from *South of Midnight*, and we feel confident that the choices we’re making now will set us up to create our most memorable game yet!\n\n**Are there any stories about how players have engaged with your game that you’d like to reflect on?**\n\nWe’ve been receiving many messages from players, particularly those from the American Deep South, praising how we’ve captured the region’s atmosphere, and that means a lot to us, since we’ve devoted so much effort to it. Many highlight the sounds: crickets, the wind through the trees, and the overall soundscape… as well as the art, the feeling of heat, and the atmosphere. Hearing them describe how the world resonates with them has been incredibly rewarding for the team. We’ve also received a lot of positive reactions to the story, and how players connect emotionally with some of the mythical creatures and their backstories. The fact that the game’s world, audio, the music, and narrative evoke such strong responses is something we deeply value.\n\n**What is the studio most looking forward to in 2026?**\n\nEveryone at Compulsion is incredibly proud of what we’ve built, and of the amazing response from players. Over the past months, we’ve received countless requests from the community to bring the game to PlayStation 5 and Nintendo Switch 2. We’re thrilled to answer those calls and can’t wait for even more players to experience *South of Midnight* when it launches on these platforms next Spring.\n\n[**Back to Top]**\n\n[!\\[South of Midnight\\](https://store-images.s-microsoft.com/image/apps.45547.13678609147241298.c742bfe1-6624-4d6a-800e-503c12872c58.e240d226-a024-4880-9c66-0f0f15b8a378?w=400&#038;h=600)](https://www.microsoft.com/en-us/store/apps/9njcvgs6t30k)\n\n![Xbox Play Anywhere](https://assets.onestore.ms/cdnfiles/sfw-service-web-onestore-onerf-2017-11-8-12/store/common/images/xpalogo_black.png)\n\n## South of Midnight\n\nXbox Game Studios\n\n☆☆☆☆☆ 625\n\n★★★★★\n\n$39.99\n\n$29.99\n\n[Get it now](https://www.microsoft.com/en-us/store/apps/9njcvgs6t30k)\n\nPC Game Pass\n\nXbox Game Pass\n\nFrom the creators of Contrast and We Happy Few, South of Midnight is a spellbinding third person action-adventure game set in the American Deep South.\n\nAs Hazel, you will explore the mythos and encounter creatures of Southern folklore in a macabre and fantastical world. When disaster strikes her hometown, Hazel is called to become a Weaver: a magical mender of broken bonds and spirits. Imbued with these new abilities, Hazel will confront and subdue dangerous creatures, untangle the webs of her own family's shared past and – if she's lucky – find her way to a place that feels like home.\n\nA DARK MODERN FOLKTALE When a hurricane rips through Prospero, Hazel is pulled into a Southern Gothic world of memory made real and must embark on a journey to rescue her mother and safeguard her hometown. In this folktale for modern times, Hazel will need to reconcile the weight of family, history, and legacy against her own identity.\n\nCONFRONT MYTHICAL CREATURES Wield an ancient power to restore creatures and uncover the traumas that consume them. Cast weaving magic to fight destructive Haints, explore the diverse regions of the South, and reweave the tears in the Grand Tapestry.\n\nHAUNTING BEAUTY OF THE GOTHIC SOUTH Discover the lush, decayed county of Prospero and its locals. Experience a crafted visual style, touching storytelling, and immersive music inspired by the complex and rich history of the South.\n\n# **Tony Hawk’s Pro Skater 3 + 4**\n\n**What would you like to say to players after releasing *Tony Hawk’s Pro Skater 3 + 4* this year?**\n\nThis community has always been the heart of Tony Hawk’s Pro Skater, and releasing *THPS 3+4* this year reminded us just how passionate, creative, and welcoming you all are. Thank you from us and Iron Galaxy for showing up with the same energy that made these games iconic in the first place. Whether you’ve been kickflipping since the early 2000s or you’re discovering these levels for the first time, we’re grateful you’ve chosen to shred with us. Launching a game rooted in nostalgia while delivering something fresh is no small task, and your support made the journey worth every step. Thank you for keeping the spirit of skate alive.\n\n**How does it feel to have the game out there, and what’s the response been like?**\n\nIt’s surreal in the best possible way. On the road to launch, alongside the team at Iron Galaxy, we kept asking ourselves, ‘How do we stay true to what players love while still pushing things forward?’ Seeing players immediately recognize the soul of THPS – the flow, the muscle memory, the soundtrack vibes – has been incredibly validating. Hearing that people are rediscovering their favorite lines and competing for top leaderboard spots again in *Tony Hawk’s Pro Skater 3 + 4* has been a highlight for our entire team.\n\n**The launch of the game featured an incredible event — do you have any stories you’d like to share about bringing so many people together to celebrate the game?**\n\nTHPS Fest was in incredible moment for everyone involved in bringing *THPS 3+4* to players.  For us, the standout story was watching the energy shift as soon as live performances from the soundtrack kicked in. Tracks that defined an era had people across generations vibing instantly – developers, pro skaters, content creators, media, Tony, everyone. At one point, a group of creators spontaneously organized a live ‘combo challenge’ in the corner of the venue, drawing a massive crowd. It was unplanned and completely authentic, which made it perfect. That’s the magic of Tony Hawk’s Pro Skater – it brings people together without even trying.\n\n[**Back to Top]**\n\n[!\\[Tony Hawk&#039;s™ Pro Skater™ 3 + 4\\](https://store-images.s-microsoft.com/image/apps.40.13968131629601189.02100553-7fb7-4f1a-b080-6b3ac33c153c.fb963dfe-c59b-4477-a990-9b6f76e653bb?w=400&#038;h=600)](https://www.microsoft.com/en-us/store/apps/9n1wk33qnsrj)\n\n![Xbox Play Anywhere](https://assets.onestore.ms/cdnfiles/sfw-service-web-onestore-onerf-2017-11-8-12/store/common/images/xpalogo_black.png)\n\n## Tony Hawk's™ Pro Skater™ 3 + 4\n\nActivision Publishing Inc.\n\n☆☆☆☆☆ 296\n\n★★★★★\n\n[Get it now](https://www.microsoft.com/en-us/store/apps/9n1wk33qnsrj)\n\nPC Game Pass\n\nXbox Game Pass\n\nGet hyped for the legendary franchise to return with Tony Hawk’s™ Pro Skater™ 3 + 4. Everything you loved is back, but revamped with more skaters, new parks, gnarlier tricks, eardrum shattering music, plus a whole lot more.\n\n– Reunite the crew with cross-platform online Multiplayer\\* for up to 8 skaters in new and returning game modes. – Drop in to new parks or tear it up across the timeless parks from both Tony Hawk’s™ Pro Skater™ 3 & Tony Hawk’s™ Pro Skater™ 4, authentically remade in jaw dropping 4K\\*\\* resolution with streamlined goals and the epic 2-minute format. – Hit ‘em with some drip in the expanded Create-A-Skater and Create-A-Park modes, including the ability to create custom goals to share with friends for the first time ever. – Shred harder than ever with more challenging goals and an enhanced New Game+ mode. – Whether you’re a total casual or a grungy pro, the same smooth handling and simple-to-learn controls from Tony Hawk’s™ Pro Skater™ 1 + 2 will have you shredding like a Pro.\n\nAlert the neighborhood watch and grab your skate buddies because the shred’s not dead. It’s back and better than ever. \\*Activision account and internet required for online Multiplayer and other features. A Game Pass subscription may be required for Multiplayer and other features (sold separately). Activision may modify or discontinue online services in the future, which may impact the continued availability of online gameplay. Online services may be discontinued to to factors including number of players.\n\n\\*\\*The Xbox Series X version of the game will run native 4K at 60FPS in Fidelity Mode. The Xbox Series S version will render at 1440P and upscale to 4K. 4K output requires a 4K compatible device or display.\n\nFor more information, please see www.tonyhawkthegame.com.\n\n© 2025 Activision Publishing Inc. ACTIVISION and PRO SKATER are trademarks of Activision Publishing, Inc. TONY HAWK is a registered trademark of Tony Hawk, Inc. All other trademarks and trade names are the property of their respective owners.\n\n# **Towerborne (Game Preview)**\n\n**What would you like to say to your players after *Towerborne*‘s updates and additions this year?**\n\nOn April 29 we [brought *Towerborne* to Xbox Game Preview](https://news.xbox.com/en-us/2025/04/29/towerborne-launch-xbox/). Adding Xbox and Windows players to our Steam community was awesome. Thank you to everyone who played this year, but especially to our Founders. We haven’t been able to say much lately but we heard your feedback and have been working tirelessly to incorporate it into *Towerborne*.\n\n**What is the studio most looking forward to in 2026?**\n\nWe learned so much this year, both from what players told us and how they played. We took this feedback to heart, and the entire team has worked hard on a major update to *Towerborne*. We’re excited to share that update with everyone in 2026!\n\n[**Back to Top]**\n\n[!\\[Towerborne (Game Preview)\\](https://store-images.s-microsoft.com/image/apps.56718.14100945740468620.f7c55d6b-e535-4591-a835-7fa6ffedcc1f.4228e448-8f56-4942-9990-6ab20594e17d?w=400&#038;h=600)](https://www.microsoft.com/en-us/store/apps/9P7TLX79S7N7)\n\n![Xbox Play Anywhere](https://assets.onestore.ms/cdnfiles/sfw-service-web-onestore-onerf-2017-11-8-12/store/common/images/xpalogo_black.png)\n\n## Towerborne (Game Preview)\n\nXbox Game Studios\n\n☆☆☆☆☆ 220\n\n★★★★★\n\n[Get it now](https://www.microsoft.com/en-us/store/apps/9P7TLX79S7N7)\n\nPC Game Pass\n\nXbox Game Pass\n\nTowerborne is a new kind of Looter Brawler, combining side-scrolling combat with action RPG loot progression and endless customization.\\* You are an Ace, born anew from the spirit realm with special skills, grit, and determination. Unite with other Aces\\*\\* and fight as one to defend the Belfry, humanity’s last refuge, from the dark forces outside its walls. Can you become the Ace humanity needs to survive? Explore, fight, and grow stronger – together\n\nExplore Together – With an evolving world map and ongoing updates, your adventure continues with new enemies, regions, rewards, and story. Venture solo or with up to three other Aces\\*\\* and recruit Umbra allies with unique abilities to join your fight. Return to the Belfry to reforge gear and continue your journey.\n\nFight Your Way – Jump into satisfying, pick-up-and-play brawler combat that's easy to learn but challenging to master. Towerborne delivers fast-paced, thrilling battles with deep, evolving strategy. Every fight is a chance to sharpen your skills and face tougher challenges.\n\nEndless Customization\\* – Customize your Ace's appearance, gear, and weapons. Set your preferred danger level in the Wilds, wield powerful weapons with special moves, and mix gear and Umbra companions to create a playstyle that's uniquely yours.\n\nThis game is a work in progress. Some content and features may change over time before full release of the game. Please purchase only if you are comfortable with the game in its current state.\n\nFull details on the latest status of the game, and how you can give feedback and report issues can be found at https://www.Towerborne.com/.\n\n\\* This game includes optional in-game purchases of virtual currency that can be used to acquire virtual in-game items.\n\n\\*Game Preview Access requires a Towerborne Founder's Pack or Xbox Game Pass Standard, Game Pass PC, or Game Pass Ultimate (subscription sold separately).\n\n\\*\\*Online console multiplayer requires Xbox Game Pass Standard, Game Pass Ultimate, or Game Pass Core (subscriptions sold separately).\n\n# **World of Warcraft**\n\n**What would you like to say to players after the updates to *WoW* this year?**\n\nEverything *World of Warcraft* has accomplished this year has been shaped by the community’s input and feedback. Our roadmap reflects what players have told us they want, and we’re committed to making Azeroth a place where everyone can find their people and play their way. The heartbeat of *World of Warcraft* is its community, and that will always guide us going forward.\n\n**Are there any stories about how players have engaged with *WoW* that you’d like to reflect on?**\n\nIt’s been inspiring to see the community embrace Player Housing! Players have already created incredible neighborhoods and shared guides, showing creativity and a willingness to help others. The way people our players come together – whether through guilds, new features, or supporting each other in-game – continues to make Azeroth feel like a true home and a place for connection and meaning.\n\n**What is the team most looking forward to in 2026?**\n\nWe’re excited to keep evolving Azeroth as a world where players can escape, recharge, and connect with friends. We’ll be launching our *Midnight* expansion on March 2, which is part two of The Worldsoul Saga – this is a story that will resonate whether you’re a new player or have been with us for decades.\n\nNext year, we’ll focus on expanding Player Housing, listening even more closely to player feedback, and finding new ways to bring the magic of Warcraft to everyone, both in-game and beyond. There’s a real sense of momentum as we march toward BlizzCon 2026, and we’re looking forward to building the future of Azeroth together with our community.\n\n[**Back to Top]**",
  "FeedLevelAuthor": "Source",
  "Description": "The post [Xbox looks back on a memorable year for players](https://news.xbox.com/en-us/2025/12/18/xbox-bethesda-blizzard-activision-king-2025-games-thank-you/) appeared first on [Source](https://news.microsoft.com/source).",
  "PubDate": "2025-12-18T17:45:40+00:00",
  "FeedName": "Microsoft News",
  "OutputDir": "_news",
  "Tags": [
    "Company News",
    "Gaming"
  ],
  "ProcessedDate": "2025-12-18 18:04:12"
}
