{
  "FeedLevelAuthor": "Source",
  "Tags": [
    "Company News",
    "Gaming"
  ],
  "ProcessedDate": "2026-02-04 18:16:34",
  "Link": "https://news.xbox.com/en-us/2026/02/04/xbox-safer-internet-day-transparency-report-2026-minecraft-education/",
  "Title": "Highlighting Xbox experiences and transparency report ahead of Safer Internet Day",
  "FeedUrl": "https://news.microsoft.com/source/feed/",
  "EnhancedContent": "![]()\n\nSkip to main content\n\n[!\\[\\](https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RE1Mu3b?ver=5c31)](https://microsoft.com) [Xbox Wire](https://news.xbox.com/en-us/)\n\n- Visit:\n- https://x.com/xboxwire\n- https://whatsapp.com/channel/0029VakfW7e5K3ze30Dp1247\n\n- Share:\n- https://www.twitter.com/share?url=https://news.xbox.com/en-us/2026/02/04/xbox-safer-internet-day-transparency-report-2026-minecraft-education/\n- https://api.whatsapp.com/send?text=Safer%20Internet%20Day%202026:%20Xbox%20Transparency%20Report%20and%20Tools%20to%20Play%20with%20Confidence%20https://news.xbox.com/en-us/2026/02/04/xbox-safer-internet-day-transparency-report-2026-minecraft-education/\n\nBringing the joy of gaming to everyone means protecting the people who play, and that responsibility has been core to Xbox since the beginning. We know that gaming just might be [the most fulfilling, socially connected, and powerful form of entertainment today,](https://news.xbox.com/en-us/2025/11/19/xbox-culture-of-play-report-gaming-survey/) and it’s crucial we continue protecting the shared moments and experiences that come from playing games together.\n\nAs we mark Xbox’s 25th anniversary this year, our commitment remains unchanged. In 2022, we made a promise to stay transparent about the work we do to protect our community and moderate content on our platform by regularly publishing our Xbox Transparency Reports. This year, ahead of Safer Internet Day, we’re sharing more than ever about how we’re innovating protections and providing players, parents, and caregivers with a variety of tools and resources so they can feel confident that Xbox continues to be a place for positive play, for the next 25 years and beyond.\n\nToday, we’re highlighting how we’re continuing to shape the industry standard for safe gameplay experiences, our newly published [Xbox Transparency Report](https://www.xbox.com/en-US/legal/xbox-transparency-report), an upcoming Minecraft world teaching digital citizenship and safety skills, and our ongoing work to implement [Age Verification.](https://news.xbox.com/en-us/2025/07/28/xbox-age-verification-uk/)\n\n## **Shaping the Standard for Safer Play**\n\nAt Xbox, safety starts with understanding how people play. Since launching the Xbox 360 in 2005, which helped set the bar for online gaming, Xbox has shaped how safety, privacy, and security are built into gaming experiences across the video game industry. Over the past two decades, this approach has evolved to meet the needs of players where they play. It is guided by five core pillars shaped by player and parent feedback, the constantly evolving nature of online harms, and the ways safety by default can help create safer, more welcoming communities from the start:\n\n- **Age Verification in the UK and beyond**: Introduced in the UK and expanding to more regions later this year, age verification on Xbox helps ensure children only have access to age-appropriate content and are limited in how they can interact with others on our platform. Read more about our approach to Age Verification [here,](https://news.xbox.com/en-us/2025/07/28/xbox-age-verification-uk/) and stay tuned for information about Age Verification expanding to more regions later this year.\n- **Child and Teen Accounts:** Specialized accounts on Xbox that consider the different needs of children and teens help ensure age-appropriate access for young players, giving them a tailored and protected experience. To set up a child or teen account, visit: [Xbox Child Account](https://www.xbox.com/en-US/family-hub/child-account?msockid=31c3e738d9b966be3750f1e0d8f26723)\n- **Tools to Support Digital Parenting**: Through tools like the Xbox Family Settings app, detailed settings that give families control over their gaming experiences can be managed directly from a mobile device, with features like Ask A Parent, which prompts children to request approval for activities and empower parents to make real-time decisions. Download the Xbox Family Settings app or learn more about [Game Ratings](https://www.xbox.com/en-US/games/gameratings), how to manage online and privacy settings, get familiar with the [Minecraft Parents Guide](https://www.minecraft.net/en-us/article/parents--guide-minecraft), and more on the [Xbox Family Hub.](https://www.xbox.com/en-US/family-hub)\n- **Continued AI Innovation Supported by Human Expertise:** Constant innovation of automated AI tools combined with human moderators help us detect, review, proactively block and address harmful online behavior more accurately and efficiently than ever. AI quickly and proactively spots potential issues, supported by human reviewers who add context, focus on nuance, and remain central to applying judgment to complex situations.\n- **Commitment to Transparency**: As the first in the video game industry to commit to regular transparency reporting, Xbox continues to ensure our community knows how safety is maintained and issues are handled.\n\n**New 2026 Xbox Transparency Report Shows Continued AI Innovation & Reduction in Spam**\n\nOur sixth Xbox Transparency Report shares insights into the work we do behind the scenes to protect all players from disruptive behavior and support experiences that are fun, positive, safe, and age appropriate. Key takeaways, which span Xbox safety efforts in 2025, include:\n\n- **Responsibly advancing our AI approach to safety**. We expanded the scope of our proactive AI moderation solutions to include 11 additional harmful topics that matter to players, allowing us to identify harmful content more effectively so our human moderators can focus on combatting the most nuanced and complex harms.\n- **An adaptive response to spam.** In 2025, our proactive moderation efforts to prevent unsolicited content from ever reaching players resulted in a 90% drop in spam message complaints compared to 2024, and an overall 23% drop in complaints for messages from non-friends.\n- **Improved Player Reporting for More Frictionless Play.** Our constant efforts to improve safety processes reach across all of our teams at Xbox. Developer Turn 10 recently expanded reporting capabilities around user generated content in *Forza Horizon 5*, allowing players to more efficiently file a report for cheating and unsportsmanlike conduct without ever needing to leave their game. Our teams at Turn 10 and across Xbox are excited to continue exploring improved functionality like this for future projects.\n\nYou can read more about our efforts to protect players in the full Xbox Transparency Report [here](https://www.xbox.com/en-US/legal/xbox-transparency-report?msockid=2cde2437127d64b11135308013f96533).\n\n## **Practicing Safer Online Decisions with *Minecraft Education***\n\nOn Safer Internet Day next week, *Minecraft* will launch *CyberSafe:* *Bad Connection*?, the fifth installment in the [CyberSafe series](https://education.minecraft.net/en-us/lessons/cybersafe) for Minecraft Bedrock and Minecraft Education. This new world will help young players build online safety and digital citizenship skills through scenario-driven gameplay. Players will explore ways to recognize risks and red flags, learn how to report suspicious activity, and build confidence to keep themselves and their community safe. *Bad Connection?* builds on the legacy of the CyberSafe series, which has reached more than 80 million downloads since 2022, equipping players with the skills, practice, and confidence to navigate online spaces.\n\n*Bad Connection?* will be available for free in the Minecraft Marketplace and Minecraft Education on February 10, along with free, downloadable materials for parents and educators to support critical, ongoing conversations about online safety. We also recently shared more about the *Minecraft* Safety Council, which brings together industry experts to help guide safer multiplayer experiences for the *Minecraft* community. Meet the council and learn more [here](https://www.minecraft.net/article/the-minecraft-safety-council).\n\n## **Our Ongoing Commitment to Safety Today and for the Next 25 Years**\n\nEvery gaming community is unique and there’s no one-size-fits-all solution to keeping players safe. Whether it’s Call of Duty’s ongoing studies on [player trust and positive play](https://research.activision.com/), new insights from the tenth annual Global Online Safety Survey publishing on [the Microsoft On the Issues blog](https://blogs.microsoft.com/on-the-issues/) on February 10, or [our recent update to our Online Safety Principles](https://news.xbox.com/en-us/2026/01/14/online-safety-principles-xbox-nintendo-sony/) developed with Nintendo and Sony Interactive Entertainment, our teams are constantly working to help players enjoy fun, positive, and inclusive experiences.\n\nOur work in player safety at Xbox is ongoing. For more information on Microsoft privacy, safety, and responsible gaming, explore these resources:\n\n- [Microsoft Online Safety Guides](https://www.microsoft.com/en-us/DigitalSafety/resources?msockid=2cde2437127d64b11135308013f96533)\n- [Microsoft Privacy for Young People](https://privacy.microsoft.com/en-us/young-people)\n- [Digital Safety for Young People](https://www.microsoft.com/en-us/DigitalSafety/digital-safety-for-young-people)",
  "OutputDir": "_news",
  "FeedName": "Microsoft News",
  "PubDate": "2026-02-04T17:33:47+00:00",
  "Author": "stclarke",
  "Description": "The post [Highlighting Xbox experiences and transparency report ahead of Safer Internet Day](https://news.xbox.com/en-us/2026/02/04/xbox-safer-internet-day-transparency-report-2026-minecraft-education/) appeared first on [Source](https://news.microsoft.com/source)."
}
