{
  "Tags": [
    "Cloud",
    "Company News"
  ],
  "FeedName": "Microsoft News",
  "Title": "How technology could help the Vikings build next year’s ‘winning edge’",
  "Link": "https://news.microsoft.com/signal/articles/how-technology-could-help-the-vikings-build-next-years-winning-edge/",
  "EnhancedContent": "As the New England Patriots and Seattle Seahawks prepare to face off in Super Bowl LX, the 30 other National Football League teams who didn’t make it to the big game have shifted their attention to next season — where every yard matters when it comes to getting to football’s grandest stage.\n\nThat includes the Minnesota Vikings, who fell short of the postseason but closed their season strong with five straight victories, showcasing their week-to-week improvement and ability to adjust on the fly. The team’s coaching staff will work closely with the front office as they make decisions about player evaluation, free agency and the NFL Draft throughout the offseason.\n\nFortunately, the Vikings have a high-tech tool to help them analyze the steps they should take in their quest for next year’s championship. Viper is a proprietary platform the Vikings designed in partnership with Microsoft using Azure technology. It is a cloud-based, fully customizable, in-house video review system the team is frequently updating and refining to meet the organization’s specific needs — from weekly adjustments driven by the coaching staff to optimizing the latest tech to help find an edge in player evaluation based on recommendations by the scouting department.\n\n“I’m evaluating offensive players, defensive players, special teams players — all these guys on our roster,” Minnesota coach Kevin O’Connell says. “How do we make sure this is seamless for me to compare across the board and really look at data in a way I would have never been able to do?”\n\nO’Connell used to spend long hours with a clicker in his hand trying to navigate through all the footage. Now, using Viper “makes it start to feel like you can see doing your job more efficiently,” he says, and the team can “grow this to becoming a winning edge for us.”\n\n![a coach holding a tablet showing a football practice video on a field](https://news.microsoft.com/signal/wp-content/uploads/2026/02/Vikings-Viper-platform-1024x576.jpg)The Vikings use the Viper app to review practice footage.\n\nThe platform combines practice scouting, game review and prospect evaluation into an intuitive experience. It holds all game, opponent and practice video, as well as player tracking and historical records, and is searchable via several queries. Hundreds of thousands of files are uploaded to Viper each season, giving the Vikings staff a wealth of information for review.\n\nThe Vikings development team, led by Luke Burson, senior director of Football Information Systems, can quickly design, code and ship updates using GitHub Copilot, allowing the coaches to request changes that can help them on a weekly basis during the season. Burson recalls a request made by a Vikings front office leader as he was searching for information in Viper as an example of how agile the platform can be.\n\n“He asked me if we had this extra information, and I told him it was already part of the data set, and I just needed to expose it to him,” Burson says. “And so, 20 minutes later, he had what he wanted to see.”\n\nBurson credits O’Connell and the Vikings coaching staff with being flexible and open to suggestions that veer far from the old-school coaching mentality, which often relied on gut instincts and an aversion to outside voices.\n\n“Inclusion and communication are two big pieces,” Burson says. “Us being able to go to training camp, watch practices or organized team activities and be able to see some of the stuff as guys are moving around helps inspire us with ideas and then say, ‘Hey, what do you think about this? Can we make this piece more efficient? Would you be interested in this data for your job?’”\n\nHe says “being able to be a part of it and not just holed away in some room in the back of the building” is key.\n\n>\n> “It can give us real, formidable things that we can use to be better than our opponent, and that’s what we’re all really looking for on a daily basis.”\n> > >\n> — Kevin O’Connell, Minnesota Vikings coach\n>\n\nIn the offseason, the Vikings are using Viper to evaluate college players all the way up to the NFL Draft in April. That will include footage from throughout the college football season, college all-star games like the East-West Shrine Bowl and in-person workouts. They’ll also track footage from the NFL Scouting Combine in March and use the [NFL Combine App](https://www.microsoft.com/en/customers/story/23954-nfl-combine-azure-ai-foundry), an Azure AI-powered tool that gives all 32 NFL teams instantaneous player insights and data comparisons during the event in Indianapolis.\n\nAs the Vikings turn to NFL Draft meetings, developers join sessions to help keep Viper updated quickly so coaches can focus on players and not navigating technology. The Vikings also use the platform to help with their free agent planning and internal player evaluations.\n\nCoaches, scouts and staff can access footage almost instantly and filter it by personnel, game situations or participation as they plan and evaluate. Cutting film used to be a tedious, time-consuming task. Before Viper, the Vikings would mail external hard drives with footage to their regional scouts on a weekly basis. Now, preparation for the next game or next season can begin immediately.\n\nThe Vikings can do all this safely, as Viper is secured through Microsoft Entra ID, with centralized authentication and conditional access to protect production environments and admin portals. Sensitive player information and strategic data remain locked down, so the Vikings can preserve their competitive edge.\n\n“We have great tools, technology-based tools, that can take this data and give us answers,” O’Connell says. “It can give us real, formidable things that we can use to be better than our opponent, and that’s what we’re all really looking for on a daily basis.”\n\n*Lead image: Minnesota Vikings head coach Kevin O’Connell during an NFL football game against the Dallas Cowboys on Sunday, Dec. 14, 2025, in Arlington, Texas. (AP Photo/Matt Patterson)*\n\n*Elliott Smith writes about AI and innovation at Microsoft, from how the Premier League is [transforming its online presence](https://news.microsoft.com/source/emea/features/premier-league-microsoft-partnership) to why AI may play a major role in [saving the Amazon rainforest](https://news.microsoft.com/source/latam/features/ai/project-guacamaya-rainforest-deforestation). Previously, Smith worked as a sports reporter in Washington, D.C., Washington state and Texas, covering high schools to the pros. You can contact him on [LinkedIn](https://www.linkedin.com/in/smithelliott).*",
  "PubDate": "2026-02-05T16:03:03+00:00",
  "Author": "stclarke",
  "FeedLevelAuthor": "Source",
  "ProcessedDate": "2026-02-05 16:12:50",
  "OutputDir": "_news",
  "FeedUrl": "https://news.microsoft.com/source/feed/",
  "Description": "The post [How technology could help the Vikings build next year’s ‘winning edge’](https://news.microsoft.com/signal/articles/how-technology-could-help-the-vikings-build-next-years-winning-edge/) appeared first on [Source](https://news.microsoft.com/source)."
}
