{
  "FeedLevelAuthor": "Source",
  "Description": "The post [India’s Shriram Finance partners with Microsoft to deliver services that travel with customers](https://news.microsoft.com/source/asia/features/with-shriram-one-financial-services-travel-with-the-customer/) appeared first on [Source](https://news.microsoft.com/source).",
  "Tags": [
    "Cloud",
    "Company News"
  ],
  "FeedUrl": "https://news.microsoft.com/source/feed/",
  "PubDate": "2026-02-17T15:20:35+00:00",
  "Author": "stclarke",
  "ProcessedDate": "2026-02-17 16:16:16",
  "Title": "India’s Shriram Finance partners with Microsoft to deliver services that travel with customers",
  "FeedName": "Microsoft News",
  "EnhancedContent": "When Ashwini Kuchekar decided to take a bank loan for expansion of her grocery store, she did not have to visit a bank branch. Instead, she applied for a business loan on her Shriram One app while at the store and the loan was approved in three days.\n\n“I had sent a message on the app and the customer care person contacted me. There was no need for branch visits and missing out on work,” says the 36-year-old from Ratnagiri, in the Southwestern state of Maharashtra in India\n\nKuchekar is one of the 20 million people in India who have downloaded Shriram One, the cloud native “super app” by Shriram Finance, which groups all its financial services on a single interface so that customers can engage with their accounts with minimal friction.\n\nShe and her husband had started the wholesale grocery business 15 years ago as a modest, family‑run operation. Over time, demand increased but space became a constraint. “We simply couldn’t stock more or diversify,” Kuchekar says. Like many small enterprises, the challenge was not demand, but access to timely capital when opportunity appeared.\n\nWith the loan from Shriram Finance, she started her own store, expanded her godown space and widened her inventory beyond groceries to include stationery and cattle fodder. Today, she employs 15 young women, supporting livelihoods across her local community.\n\n![A woman in a shop looking at her mobile phone and another woman in the background.](https://news.microsoft.com/source/asia/wp-content/uploads/2026/02/Archana-Kuchekar-from-Ratnagiri-1024x576.jpg)Ashwini Kuchekar, a woman entrepreneur from Ratnagiri, Maharashtra, runs an independently owned wholesale grocery outlet, managing her business digitally as it grows. Photo by Mihir Patel, Fotoley for Microsoft\n\nAs India leapfrogs branch banking straight to smartphones, Shriram Finance, part of Shriram Capital, recognized that serving customers across different ages, geographies and risk profiles would require moving beyond digital access alone. Partnering with Microsoft, the company built Shriram One — a cloud‑native platform designed to scale financial services while earning trust in smaller cities and towns.\n\n**Access achieved, usage still uneven**\n\nIndia is often cited as a global success story in financial inclusion. The [World Bank’s Global Findex 2025](https://www.worldbank.org/en/publication/globalfindex) data shows India has seen one of the fastest expansions in financial access, with 89 percent of adults holding a bank account in 2024, up from 77.5 percent in 2021 and 35 percent in 2011—above the global average of 79 percent. Yet one in six account holders in India, 16 percent, did not use their account in the past 12 months, nearly three times the global average, highlighting that access alone no longer explains engagement.\n\nThe [Reserve Bank of India’s Financial Inclusion Index](https://www.pib.gov.in/PressNoteDetails.aspx?NoteId=154980&amp;ModuleId=3&amp;reg=3&amp;lang=2#:~:text=The%20Reserve%20Bank%20of%20India,financial%20infrastructure%20of%20the%20country.) (FI-Index), which tracks access, usage and quality of financial services, stood at 67.0 in FY25, up from 64.2 in March 2024. The rise reflects India’s success in expanding formal access through bank accounts, digital payments and basic financial products. However, in the FI-Index framework, the gap between access and usage signals that millions of Indians hold accounts, but do not actively engage with them, the real test of financial inclusion*.*\n\n**Bridging products and people**\n\nFor large parts of India’s financial system, the challenge is no longer opening accounts but stitching together how people actually use them. For first-time borrowers or conservative savers, fragmentation of various financial products can be alienating.\n\n![A man wearing black T-shirt standing against the backdrop of a painting.](https://news.microsoft.com/source/asia/wp-content/uploads/2026/02/Vinod-Kumar-Chief-Digital-Officer-Shriram-Finance-1024x576.jpeg)Vinod Kumar, Chief Digital Officer, Shriram Finance. Image courtesy: Vinod Kumar\n\nNon-bank lenders such as Shriram, which operate at the intersection of formal finance and informal livelihoods, sit squarely in this gap, and the app was built as a response. The group consolidated its existing offerings—lending, deposits, insurance and payments—into a single interface with an aim to offer all products under one platform and reduce friction for customers.\n\nFor Shivjot Singh, a long‑haul truck driver from Ropar in Punjab, that consolidation translated into a loan, insurance and UPI payments under a single interface. When he needed a loan of Rs 5 lakh for a new commercial vehicle, Singh applied through the Shriram One app. The loan, with a tenure of two years, was approved within a week, without requiring him to visit a branch or pause his work.\n\n![A man wearing orange turban looking at his mobile phone and standing in front of a white truck ](https://news.microsoft.com/source/asia/wp-content/uploads/2026/02/Shivjot-Singh-2-1024x683.jpg)Shivjot Singh applied for a commercial vehicle loan while on the road using the Shriram One app. Photo by Paramdeep Singh, Fotoley for Microsoft\n\n“Every day off the road is lost income,” Singh says. “I didn’t have to visit a bank branch to get my loan approved. More importantly, the monthly instalments can be paid off while on the road.”\n\nHis experience reflects a broader shift underway in India’s mobile‑first financial ecosystem, where digital platforms are increasingly judged not by access alone, but by whether they fit into customers’ daily routines.\n\n**Technology as infrastructure, not interface**\n\nBehind Shriram One sits a shift in how the institution builds and runs its digital systems. The platform is cloud-native, designed to scale services, update features, and monitor risk in near real time—without asking customers to learn a new language of finance.\n\nParts of that infrastructure run on Microsoft Azure, giving the organization the ability to manage workloads across lending, deposits, payments, and insurance while keeping analytics and automation embedded in day‑to‑day operations. Security and compliance are supported through Microsoft Defender for Cloud and Microsoft Sentinel, built into the system rather than layered on later.\n\nAccording to Gayadhar Behera, Chief Technology Officer at Shriram Finance, the choice of technology mattered as much as building internal capability. “We needed a partner who could help our teams pick up new skills as we moved faster,” he says. “We were already predominantly in a Microsoft environment, so Azure was a practical fit for how we needed to scale.”\n\n![A man wearing a blue T- shirt](https://news.microsoft.com/source/asia/wp-content/uploads/2026/02/Panakala-raju-455x683.jpg)Panakala Raju, Chief Software Officer at Novac Technologies, Shriram’s technology partner. Image courtesy: Panakala Raju\n\nFor customers, that architecture is largely invisible—but its effects are not. Onboarding is quicker, data is pre-filled. Navigation follows familiar patterns, whether someone is booking a fixed deposit, buying insurance, making a digital payment, or checking a loan. Behind the scenes, analytics and AI help personalize recommendations and flag anomalies in real time.\n\n“We are a legacy organization, but digitally we are a start-up,” says Vinod Kumar, Chief Digital Officer at Shriram Finance. “To grow from there to where we are today has been a massive achievement for the team.”\n\n**Building the trust factor**\n\nFor Shriram One, offering multiple languages has become one of the key drivers of growth and has enabled expansion. The app supports seven Indian languages, with interfaces designed to feel familiar for the large semi-urban and rural population.\n\n![A person holding a mobile phone with the Shriram One app open.](https://news.microsoft.com/source/asia/wp-content/uploads/2026/02/Shriram-One-app--1024x576.jpg)The Shriram One app supports multiple Indian languages, helping customers navigate financial services with greater ease and confidence. Photo by Mihir Patel, Fotoley for Microsoft\n\nFor Kuchekar, the ease of accessing the app in Hindi, gave clarity and confidence. “Once you are able to navigate the app and understand the different services, financial planning became easier,” she says. For Singh, that transformation is practical. “During my long-distance trips that run into weeks, I don’t have to worry about loan installments or cash flows.  Everything works digitally without losing time on branch visits,” he says.\n\nBut according to Behara and Kumar, the more meaningful indicators lie elsewhere. It is fewer drop‑offs and rising confidence among customers who once relied entirely on traditional bank branches.\n\nThe numbers reflect this shift. Monthly fixed deposit volumes on the app have grown more than three-fold—from Rs 80 crore to nearly Rs 300 crore in two years. The app has crossed 20 million downloads as of January 31, a notable milestone for a company where 63 percent of new users come from Tier‑3 cities and beyond, and another 27 percent from Tier‑2 markets. Personalization models built using AI and machine learning have also helped lift deposit balances by nearly 30 percent.\n\nMuralikrishnan Narayanan, Chennai-based retired professional and a conservative investor, illustrates this evolution most clearly. Before investing, the 61‑year‑old spends time examining the app’s security features — authentication alerts, dashboards and transaction visibility. He is comfortable with technology, but skeptical of platforms that are quick to promise returns without explaining risk. “I need to know where my money is, how it moves and how it is protected,” he says.\n\nThose concerns are not incidental—they are central to how the company has designed its digital infrastructure. “All customer data is hosted within India, aligned with regulatory compliances and guidelines,” says Behera.\n\nAI, too, is being deployed with restraint. “Our chatbot is being trained to handle routine collections, assist with fixed‑deposit renewals, and seamlessly route complex queries to human agents,” says Panakala Raju, Chief Software Officer at Novac Technologies, Shriram’s technology partner.\n\nIn a country as diverse as India, design decisions like these often matter more than features.\n\n“Inclusion in India isn’t a single problem with a single solution,” says Kumar. “Digital finance works when it adapts to people, not the other way around.”\n\nAs India enters the next phase of its financial development, the test will no longer be how many accounts exist—but how many people return to them, trust them, and find them useful over time.\n\n*Top Image:* *Shivjot Singh, long‑haul truck driver from Ropar, Punjab, uses the Shriram One app to manage loans, insurance and payments while on the road. Photo by Paramdeep Singh, Fotoley for Microsoft*",
  "Link": "https://news.microsoft.com/source/asia/features/with-shriram-one-financial-services-travel-with-the-customer/",
  "OutputDir": "_news"
}
