{
  "FeedName": "Microsoft News",
  "FeedLevelAuthor": "Source",
  "Tags": [
    "Company News",
    "Education"
  ],
  "Description": "The post [Microsoft introduces innovations and programs to support AI-powered teaching and learning](https://www.microsoft.com/en-us/education/blog/2026/01/introducing-microsoft-innovations-and-programs-to-support-ai-powered-teaching-and-learning/) appeared first on [Source](https://news.microsoft.com/source).",
  "EnhancedContent": "Announcing Microsoft Elevate for Educators—helping connect educators with community, professional development, and AI tools to transform teaching.\n\n/\n\nPowered by [!\\[\\](https://www.microsoft.com/en-us/education/blog/wp-content/plugins/ms-cloud-marketing-modules/assets/images/logo-azure.png) Azure](https://azure.microsoft.com/en-us/products/cognitive-services/text-to-speech)\n\n*Empowering education systems, educators, and students to thrive in the AI-era.*\n\nClassrooms are places of possibility where curiosity meets knowledge, and potential becomes reality. At Microsoft, we’ve supported education systems, leaders, educators, and students for over 50 years, and remain dedicated to this mission as education is reimagined in the age of AI. Trustworthy AI, combined with practical skills for educators, can amplify teacher expertise making instruction more responsive, freeing time for human connection, and ensuring every learner can actively participate in the opportunities of this new era.\n\nToday we’re excited to advance [our offerings](https://news.microsoft.com/source/?p=23346), bringing together secure, education-specific technology, supported by skill‑building programs to empower every school, educator, and student to thrive with confidence in an AI‑powered future. We’re announcing **[Microsoft Elevate for Educators](https://aka.ms/MicrosoftElevateforEducators)**, a program connecting educators with community, professional development, and AI tools to transform teaching. In addition, we’ve launched new AI-powered tools purpose-built for education, including **Teach in the Microsoft 365 Copilot app** to streamline lesson preparation. For educators that have Copilot+ PCs, **Microsoft Learning Zone** can provide rich, dynamic interactive experiences using on-device intelligence to engage students better.\n\nThe new **Study and Learn Agent** provides students with an AI-powered learning companion to understand concepts and practice skills. We’re also **offering** **higher education students free 12-month access to Microsoft 365 Premium and LinkedIn Premium Career**, supporting them from classroom learning to career readiness. These offerings are designed specifically for schools to help build capacity, develop essential skills, and create more engaging teaching and learning experiences.\n\n## Introducing Microsoft Elevate for Educators\n\nThe Microsoft Elevate for Educators program is part of the [company’s broader Microsoft Elevate commitment](https://blogs.microsoft.com/on-the-issues/2025/07/09/elevate/) to help schools and educators build skills, expand opportunities, and ensure everyone benefits from AI. Through Microsoft Elevate, Microsoft aims to help more than 20 million people gain in-demand AI skilling credentials in the next two years and advance AI education and workforce readiness globally.\n\nThe Microsoft Elevate for Educators program equips educators and school leaders with access to one of the world’s largest and most connected peer educator networks, offers free professional development resources and access to in-demand credentials to confidently integrate AI into the classroom. Microsoft Elevate for Educators is available today and includes:\n\n- **New global communities for K-12 educators and schools**. Educators and schools worldwide face the challenge of integrating AI in ways that truly benefit every student. In response, Microsoft is launching significant updates to its global educator community to help educators strengthen skills, gain recognition, and collaborate globally on best practices in AI-powered teaching. The new Microsoft Elevate for Educators and Microsoft Elevate Schools communities build on our existing global community and now offer year-round membership, expanded training opportunities and resources, and a progressive achievement system for educators to advance as they learn. For the first time, school districts, systems, and ministries can gain special recognition for supporting educators’ professional growth and demonstrating measurable impact in classrooms and across education systems.\n- **Professional development for educators globally**. Free professional development and associated credentials help educators earn recognition for demonstrated skills that can qualify for salary increases or career advancement. The [AI Skills Navigator](https://aka.ms/AISkillsNavigator_EDUBlog) helps educators learn new skills through a suite of new self-paced courses, live sessions, and AI-powered simulations available in more than 13 languages. Also launching during Bett UK 2026, Microsoft is providing educators with a new [AI in Special Education](https://aka.ms/AIinSpecialEd) course to help enhance and customize student learning.\n- **Industry-recognized credentials for educators**. Available at no cost, the new Microsoft Elevate for Educators Credential, developed in partnership with ISTE+ASCD and aligned to the AI Literacy Framework, helps educators gain confidence and expertise in integrating AI into their teaching and learning. Educators worldwide will also have access to study materials for other Microsoft certifications, including a new Microsoft certification in Instructional Technology which will be made available to educators in the coming months.\n\n[Discover the Microsoft Elevate for Educators program](https://aka.ms/MicrosoftElevateforEducators)\n\nIn higher education, we continue to partner with colleges and universities to integrate AI into classrooms, empower faculty, and equip students with future-ready skills. Through AI Skills Navigator, we support the entire campus ecosystem. Microsoft Learn for Educators and AI Bootcamps support faculty with ready-to-use Microsoft Official Courseware, making it easier to teach, learn, and apply AI responsibly. And our Microsoft Student Ambassadors program nurtures a vibrant student body and accelerates learning through skilling events, AI adoption, and credentials. Explore more with [The Skills Hub Blog](https://aka.ms/SkillingHigherEdBlog).\n\n## AI tools designed for education\n\nAI can be a powerful complement to educator expertise. Many of our education tools are available at no cost for Microsoft 365 Education customers such as Teach and the Study and Learn Agent and can help educators save time, simplify planning, and engage students. Additionally, educators, staff, and students can advance their AI journey with a deeply integrated experience and the latest innovations through an [academic offering of Microsoft 365 Copilot](https://www.microsoft.com/en-us/education/blog/2025/10/designing-microsoft-365-copilot-to-empower-educators-students-and-staff/).\n\nTo provide leaders with guidance on responsible and effective AI adoption, we’re sharing a new IDC White Paper, sponsored by Microsoft, [A Blueprint for AI-Ready Schools: Strategies from the Front Lines of K-12 Education](https://aka.ms/IDCWhitepaper-AIinK12).1 It highlights lessons learned from early adopters, such as Brisbane Catholic Education in Australia, Broward County Schools in the United States, and Coquitlam School District in Canada, and outlines opportunities for integrating AI into schools.\n\n### Teach: Your AI assistant for instruction and more\n\nNow available in the Microsoft 365 Copilot app, Teach helps streamline class preparation with intuitive, customizable features including lesson plan creation, quiz, rubric development, and adapting materials to different reading levels. With Teach, you can quickly generate lesson plans aligned to relevant standards, modify content for diverse learners, and adjust difficulty levels with simple prompts. Available at no additional cost for education customers, Teach helps you save time and stay focused on your students’ success.\n\n### Microsoft Learning Zone: Bringing the power of Copilot+ PCs to education\n\n![Screenshot of the Microsoft Learning Zone app&rsquo;s section with content from the&nbsp;Nobel Peace Center.](https://www.microsoft.com/en-us/education/blog/wp-content/uploads/2026/01/learning-zone-nobel-peace-center-lessons-1024x423.webp)Enhance global citizenship awareness with Microsoft Learning Zone.\n\nCopilot+ PCs are Microsoft’s most advanced laptops yet, combining the power of next-generation hardware with on-device AI and deep Windows integration. [Microsoft Learning Zone](https://learningzone.microsoft.com/) is an AI-powered Windows app designed to use on-device intelligence on [Copilot+ PCs to deliver real educational value](https://www.microsoft.com/en-us/windows/learning-center/copilot-plus-pcs-back-to-school-companions). With this new Copilot+ PC app, educators can quickly create, share, and track personalized and interactive learning activities right from their device, instantly boosting student engagement. Students can engage with these activities on any Windows 11 PC to receive immediate feedback and personalized coaching. Microsoft Learning Zone has earned the [ISTE Seal of Alignment](https://learningzone.microsoft.com/) for learning design, usability, and research-backed teaching practices.\n\n[Design interactive lessons with Microsoft Learning Zone](https://learningzone.microsoft.com/)\n\nThe app draws on trusted content partners, including NASA, OpenStax, PBS NewsHour, the Nobel Peace Center, World Wildlife Fund, Figma, and [Minecraft Education](https://education.minecraft.net/en-us)—to support high-quality learning experiences. New content additions include the Nobel Peace Center lesson collection, which explores peace, justice, and human rights through stories of laureates such as Malala Yousafzai and Wangari Maathai, alongside companion activities in Minecraft Education.\n\nEducators can share Learning Zone content anywhere through [Microsoft Teams](https://www.microsoft.com/en-us/education/products/teams), with learning management system (LMS) integration expected later in 2026. It currently supports English and Spanish, with Portuguese, French, German, and additional languages planned for 2026.\n\n### Study and Learn Agent: Supporting student growth\n\n![Screenshot of the Study and Learn agent in Microsoft 365 Copilot.](https://www.microsoft.com/en-us/education/blog/wp-content/uploads/2026/01/M365-Copilot-Study-and-Learn-1024x520.webp)The Study and Learn Agent is available in Microsoft 365 Copilot.\n\nThe Study and Learn Agent, built on learning science principles, is designed to help students ages 13 and older engage more deeply with academic concepts to develop critical and reflective thinking skills. Students can work to understand concepts, practice with adaptive exercises, explore topics through guided study, or engage with built-in activities like flashcards, matching exercises, and quizzes. Study and Learn will provide students with an AI-powered learning companion that supports their growth and independence.\n\n[Learn more about AI innovations designed for education](https://aka.ms/MicrosoftEDUJanuary2026TC)\n\n### Supporting students in higher education\n\nStudents are already using AI-powered tools for writing, research, creativity, and career planning. For a limited time, eligible higher education students can now get [12 months of Microsoft 365 Premium and LinkedIn Premium Career](https://aka.ms/M365PremiumPlusLinkedInPremium-StudentOffer)—two powerful subscriptions working together to support academic success and jump start careers. The offer is an all-in-one AI-powered plan to help students excel in every aspect of campus life, from writing research papers and organizing class notes, to creating standout presentations and applying for internships and jobs, available at no extra cost for eligible students.2\n\n![Lifestyle image of two people looking at a computer and smiling](https://www.microsoft.com/en-us/education/blog/wp-content/uploads/2026/01/Microsoft-Education-FY25-Photo-Library-Image-07-1920px-1024x683.jpg)\n\n## Trusted resources for education leaders\n\nSecurity, trust, and accessibility are foundational in education. We’re proud to introduce the [Microsoft Education Security Toolkit](https://aka.ms/edusectoolkit), a comprehensive resource designed to help education institutions simplify and strengthen their cybersecurity posture. It provides practical guidance for education leaders on everything from strategic planning and compliance to implementation scenarios and real-world case studies.\n\n[Read the Microsoft Education Security Toolkit](https://info.microsoft.com/ww-landing-microsoft-education-security-toolkit.html?lcid=EN-US)\n\nFor organizations just getting started, the [Microosft Education AI Toolkit](https://aka.ms/eduaitoolkit) offers a practical starting point. It includes real-world customer stories, guidance for responsible AI adoption, snapshots of AI usage, and a wealth of information to help you on your AI journey! [Read stories and best practices](https://www.microsoft.com/en/customers/search?filters=industry%3Aeducation) from other education institutions.\n\n## Join us in shaping the future of education together\n\nMicrosoft is committed to supporting education systems, leaders, educators, and students as learning is reimagined in the age of AI. With tools, skilling, resources, and programs, we aim to help you reclaim time for what matters most: inspiring students, fostering curiosity, and nurturing the next generation of thinkers, creators, and leaders.\n\nHeading to Bett UK 2026 from January 21–23, 2026? Visit Microsoft at stand SM20 to explore our latest innovations. See our full program and [explore the 2026 agenda](https://aka.ms/MicrosoftatBett).\n\n[Sign up for resources to build your AI adoption strategy](https://info.microsoft.com/ww-landing-Education-Stay-Informed.html?lcid=en-us)\n\n1 IDC White Paper, sponsored by Microsoft, A Blueprint for AI-Ready Campuses: Strategies from the Front Lines of K-12 Education, #US54034625, December 2025.\n\n2 With select market restrictions, [check here for availability and details](https://www.microsoft.com/microsoft-365/college-student-pricing?ocid=cmmnf3oysde).",
  "PubDate": "2026-01-15T16:09:33+00:00",
  "ProcessedDate": "2026-01-15 17:09:06",
  "Link": "https://www.microsoft.com/en-us/education/blog/2026/01/introducing-microsoft-innovations-and-programs-to-support-ai-powered-teaching-and-learning/",
  "OutputDir": "_news",
  "Title": "Microsoft introduces innovations and programs to support AI-powered teaching and learning",
  "Author": "stclarke",
  "FeedUrl": "https://news.microsoft.com/source/feed/"
}
