{
  "PubDate": "2026-01-15T16:00:04+00:00",
  "OutputDir": "_news",
  "Link": "https://news.microsoft.com/source/2026/01/15/microsoft-expands-its-commitment-to-education-with-elevate-for-educators-program-and-new-ai-powered-tools/",
  "FeedLevelAuthor": "Source",
  "Title": "Microsoft expands its commitment to education with Elevate for Educators Program and new AI-powered tools",
  "ProcessedDate": "2026-01-15 16:05:54",
  "Tags": [
    "Company News",
    "Press releases"
  ],
  "Author": "stclarke",
  "FeedName": "Microsoft News",
  "EnhancedContent": "**REDMOND, Wash. — Jan. 15, 2026** **—** Microsoft Corp. on Thursday announced Microsoft Elevate for Educators, a new comprehensive program connecting educators with community, resources and in-demand credentials and new AI-powered capabilities at no additional cost to help schools worldwide prepare educators and students for an AI-driven future.\n\nToday’s announcements are aligned with Microsoft’s mission to support education in the AI era. Unveiled ahead of Bett UK 2026, these innovations put trusted, education-specific AI tools in the hands of educators and students while ensuring they have the skills, support and confidence to use them effectively and responsibly.\n\n“As AI becomes part of everyday learning, our responsibility is to ensure it supports educators and earns the confidence of students and families,” said Justin Spelhaug, President of Microsoft Elevate. “For Microsoft, that means building responsible AI-powered solutions for education in the Microsoft 365 Copilot app secure and grounded in the values that make learning human, while ensuring our educators and schools have the skills and resources through programs like Elevate for Educators to use these tools effectively.”\n\n**Introducing Microsoft Elevate for Educators**\n\nThe Microsoft Elevate for Educators program is part of the [company’s broader Microsoft Elevate commitment](https://blogs.microsoft.com/on-the-issues/2025/07/09/elevate/) to help schools and educators build skills, expand opportunity and ensure everyone benefits from AI. The program equips educators and school leaders with access to one of the world’s largest and most connected peer educator networks, and offers free professional development resources and access to in-demand credentials to confidently integrate AI into the classroom. Microsoft Elevate for Educators is available today at [https://aka.ms/MicrosoftElevateforEducators](https://aka.ms/MicrosoftElevateforEducators) and includes:\n\n- **Industry-recognized credentials** **for educators.** A new, free Microsoft Elevate Educator Credential, developed in partnership with ISTE + ASCD, and aligned to the AI Literacy Framework, helps educators gain confidence and expertise in integrating AI into their teaching and learning. Educators worldwide will also have access to a new Microsoft Certified Instructional Technologist and Coach certification, which will be made available to educators in coming months.\n- **New global communities for K-12 educators and schools.** Educators and schools worldwide face the challenge of integrating AI in ways that truly benefit every student. In response, Microsoft is launching significant updates to its global educator community to help educators strengthen skills, gain recognition and collaborate globally on best practices in AI-powered teaching. The new Microsoft Elevate Educators and Microsoft Elevate Schools communities now offer year-round membership, expanded training opportunities and resources, and a progressive achievement system for educators to advance as they learn. For the first time, school districts, systems and ministries can gain special recognition for supporting educators’ professional growth and demonstrating measurable impact in classrooms and across education systems.\n- **Free professional development** **for all educators globally.** Professional development training and credentials can help educators keep current on certifications, or qualify for salary increases or career advancement. To help educators learn new skills and achieve more, the new Microsoft Elevate for Educators program offers a suite of new self-paced courses, live sessions and AI-powered simulations, available globally and in more than 13 languages through the [AI Skills Navigator](https://aiskillsnavigator.microsoft.com/).\n\n**Announcing a limited time Copilot and LinkedIn promotion for students**\n\nMicrosoft [introduced a new offer](https://aka.ms/M365PremiumPlusLinkedInPremium-StudentOffer) to empower college students with the tools they need to succeed in today’s AI-powered workplace. Beginning today, eligible college students can get **12 months of Microsoft 365 Premium and LinkedIn Premium Career subscriptions for free,** [available directly through Microsoft](https://www.microsoft.com/microsoft-365/college-student-pricing?ocid=cmmnf3oysde). This limited-time promotion provides students with powerful productivity tools — including Researcher and Analyst agents, extensive AI usage limits, and productivity apps like Word, Excel and PowerPoint with Copilot built in — plus career resources to help build skills, network and prepare for future opportunities.\n\n**Designed for education: Personalized AI that puts educators and students first**\n\nMicrosoft also introduced new AI-powered capabilities purpose-built for education, available at no additional cost for Microsoft 365 Education customers. Building on existing education‑specific tools, these capabilities are designed to amplify teaching and learning while maintaining security and trust.\n\n***Giving educators more time for what matters most***\n\n- **Teach in the Microsoft 365 Copilot app** helps educators streamline class preparation and personalize instruction in one place. Available today, new features in Teach enable educators to quickly plan high‑quality, standards‑aligned lessons and learning activities, giving them more time to focus on teaching. Built‑in AI tools make it easy to adapt instruction to different learning needs, adjust reading levels and differentiate content across diverse classrooms, while AI‑powered assessment support helps educators evaluate understanding and provide timely, actionable feedback.\n- Available now, **Microsoft Learning Zone** is a free, AI-powered learning app and the first Copilot+ PC experience built for educators to create personalized, adaptive learning activities\n\n***Empowering students to learn at their own pace***\n\nAs AI increasingly shapes how students learn and prepare for the future, Microsoft is delivering tools that support more independent and engaging study. **The Study and Learn Agent** is an adaptive AI assistant that provides students with personalized support. Available in preview later this month, the Study and Learn Agent is designed to foster critical and reflective thinking, helping students learn independently while building confidence.\n\nFor more information on Microsoft’s commitment to education, visit us at [aka.ms/AIforTeachingandLearning](file:///C:/Users/akim/AppData/Local/Microsoft/Windows/INetCache/Content.Outlook/PNLMOXG5/aka.ms/AIforTeachingandLearning) or at the Microsoft stand (SM20) at Bett UK (Jan. 21-23).\n\nMicrosoft (Nasdaq “MSFT” @microsoft) creates platforms and tools powered by AI to deliver innovative solutions that meet the evolving needs of our customers. The technology company is committed to making AI available broadly and doing so responsibly, with a mission to empower every person and every organization on the planet to achieve more.\n\n**For more information, press only:** Microsoft Media Relations, **We. Communications,** (425) 638-7777, [\\[email protected\\]](/cdn-cgi/l/email-protection#7a081b0a131e081f090a1514091f3a0d1f191517170f1413191b0e1315140954191517)\n\n*Note to editors:* For more information, news and perspectives from Microsoft, please visit Microsoft Source at [https://news.microsoft.com/source](https://news.microsoft.com/source). Web links, telephone numbers and titles were correct at time of publication but may have changed. For additional assistance, journalists and analysts may contact Microsoft’s Rapid Response Team or other appropriate contacts listed at [https://news.microsoft.com/microsoft-public-relations-contacts](https://news.microsoft.com/microsoft-public-relations-contacts).",
  "FeedUrl": "https://news.microsoft.com/source/feed/",
  "Description": "The post [Microsoft expands its commitment to education with Elevate for Educators Program and new AI-powered tools](https://news.microsoft.com/source/2026/01/15/microsoft-expands-its-commitment-to-education-with-elevate-for-educators-program-and-new-ai-powered-tools/) appeared first on [Source](https://news.microsoft.com/source)."
}
