{
  "Tags": [
    "Company News",
    "Press releases"
  ],
  "Author": "stclarke",
  "FeedUrl": "https://news.microsoft.com/source/feed/",
  "Link": "https://news.microsoft.com/source/2026/02/18/microsoft-and-crowdstrike-announce-the-falcon-platform-now-available-on-microsoft-marketplace/",
  "ProcessedDate": "2026-02-18 17:22:35",
  "PubDate": "2026-02-18T17:20:15+00:00",
  "OutputDir": "_news",
  "EnhancedContent": "**AUSTIN, Texas, and REDMOND, Wash. — Feb. 18, 2026 —** [CrowdStrike](https://protect.checkpoint.com/v2/r01/___https:/www.crowdstrike.com/en-us/___.YzJ1OndlY29tbXVuaWNhdGlvbnM6YzpvOmIxMjliZjhjZmMwYWM0MWQzYjk0OThiZjA3YjNhODlmOjc6ZmI5YjpiYmU3YmFlNjI1YTg1ZmEwMjE3ZjJmOGI4NzVlNzY0Y2MyODA2Yzk4ZGFmYjA2ZWE3N2M3N2E1NDc3MjNhN2FkOnA6VDpG) **** (NASDAQ: CRWD) and Microsoft Corp. (NASDAQ: MSFT) on Wednesday announced an expansion of their strategic alliance that allows organizations of all sizes to purchase the [CrowdStrike Falcon® platform](https://www.crowdstrike.com/en-us/platform/) on [Microsoft Marketplace](https://marketplace.microsoft.com/en-us/) using its existing Microsoft Azure Consumption Commitment.\n\nMarketplace streamlines procurement and billing, helping organizations accelerate deployment of Falcon’s unified, AI-native protection across endpoints, cloud workloads, identity, AI and data to stop breaches.\n\nWith this expanded access, customers can:\n\n- **Accelerate time-to-protection** by simplifying procurement through Marketplace.\n- **Optimize committed cloud spend** by applying CrowdStrike purchases toward Microsoft Azure Consumption Commitment.\n- **Reduce operational overhead** by consolidating purchasing and billing.\n\n“Security is the foundation for AI Transformation,” said Judson Althoff, CEO of Microsoft’s commercial business. “By enabling customers to apply their Azure Consumption Commitment in Microsoft Marketplace toward the Falcon platform, we are providing the financial flexibility they need to optimize cloud spend while adopting a rigorous security posture.”\n\n“Adversaries don’t wait for budget cycles, and neither should security teams,” said George Kurtz, CEO and founder of CrowdStrike. “By enabling customers to use Azure Consumption Committment for CrowdStrike, we remove procurement friction and maximize the impact of the cloud investment they already have to stop breaches with the Falcon platform. Through ongoing collaboration with Microsoft, our ecosystem is broadening to meet the market’s broad-based demand for Falcon.”\n\n**What industry experts and joint customers are saying:**\n\n“Cloud marketplaces are becoming a primary route to market for enterprise software, streamlining procurement while activating partner co-sell at scale,” said Jay McBain, Chief Analyst at Canalys. “By allowing Falcon to transact against Azure Consumption Commitments, Microsoft and CrowdStrike are aligning security purchases with cloud spend — accelerating deal velocity and simplifying the path from agreement to deployment.”\n\n“In today’s agentic world, security must move at the speed of innovation,” said Tom Le, Chief Information Security Officer at Gap Inc. “CrowdStrike and Microsoft are strategic pillars of our technology ecosystem. Azure drives our dynamic, digital-first retail ecosystem, and the Falcon platform delivers the protection we rely on to stay secure. Making Falcon available through Microsoft Marketplace gives us the agility to adapt to rapid shifts in technological change, supporting how we accelerate secure cloud and AI innovation worldwide.”\n\nThe CrowdStrike Falcon platform is available immediately via Microsoft Marketplace with full Microsoft Azure Consumption Commitment decrement eligibility. For more information, visit [https://marketplace.microsoft.com/en-us/product/crowdstrike1726000395811.falconcloudsecurity](https://marketplace.microsoft.com/en-us/product/crowdstrike1726000395811.falconcloudsecurity).\n\n**About CrowdStrike**\n\n[CrowdStrike](https://www.crowdstrike.com/) (NASDAQ: CRWD), a global cybersecurity leader, has redefined modern security with the world’s most advanced cloud-native platform for protecting critical areas of enterprise risk — endpoints and cloud workloads, identity and data.\n\nPowered by the CrowdStrike Security Cloud and world-class AI, the CrowdStrike Falcon® platform leverages real-time indicators of attack, threat intelligence, evolving adversary tradecraft, and enriched telemetry from across the enterprise to deliver hyper-accurate detections, automated protection and remediation, elite threat hunting, and prioritized observability of vulnerabilities.\n\nPurpose-built in the cloud with a single lightweight-agent architecture, the Falcon platform delivers rapid and scalable deployment, superior protection and performance, reduced complexity, and immediate time-to-value.\n\nCrowdStrike: We stop breaches.\n\nLearn more: [https://www.crowdstrike.com/](https://www.crowdstrike.com/)\n\nFollow us: [Blog](https://www.crowdstrike.com/blog/) | [X](https://x.com/crowdstrike) | [LinkedIn](https://www.linkedin.com/company/crowdstrike/mycompany/) | [Instagram](https://www.instagram.com/crowdstrike/)\n\nStart a free trial today: [https://www.crowdstrike.com/trial](https://www.crowdstrike.com/trial)\n\n© 2026 CrowdStrike, Inc. All rights reserved. CrowdStrike and CrowdStrike Falcon are marks owned by CrowdStrike, Inc. and are registered in the United States and other countries. CrowdStrike owns other trademarks and service marks and may use the brands of third parties to identify their products and services.\n\n**About Microsoft**\n\nMicrosoft (Nasdaq “MSFT” @microsoft) creates platforms and tools powered by AI to deliver innovative solutions that meet the evolving needs of our customers. The technology company is committed to making AI available broadly and doing so responsibly, with a mission to empower every person and every organization on the planet to achieve more.\n\n**For more information, press only:**\n\nMicrosoft Media Relations, **We. Communications** for Microsoft, (425) 638-7777, [\\[email protected\\]](/cdn-cgi/l/email-protection#463427362f2234233536292835230631236b3129342a22312f22236825292b)\n\nJake Schuster, CrowdStrike Corporate Communications, [\\[email protected\\]](/cdn-cgi/l/email-protection#a8d8dacddbdbe8cbdac7dfccdbdcdac1c3cd86cbc7c5)\n\n*Note to editors:* For more information, news and perspectives from Microsoft, please visit Microsoft Source at [https://news.microsoft.com/source](https://protect.checkpoint.com/v2/r01/___https:/news.microsoft.com/source___.YzJ1OndlY29tbXVuaWNhdGlvbnM6YzpvOjY4YjJlNzdjNzA1N2JmZDFmNGQxODNjZGQ2MzVkZmM2Ojc6NTZhMTpkODU2YmEwZDhlMmVhZjQ0YjVkYTRmYTFhMDU5MzM3MDU0ZmZkMzQ4OTIzYWQwNDAzNTQ4NzBkOThmODAxM2YyOnA6RjpG). Web links, telephone numbers and titles were correct at time of publication but may have changed. For additional assistance, journalists and analysts may contact Microsoft’s Rapid Response Team or other appropriate contacts listed at [https://news.microsoft.com/microsoft-public-relations-contacts](https://protect.checkpoint.com/v2/r01/___https:/news.microsoft.com/microsoft-public-relations-contacts___.YzJ1OndlY29tbXVuaWNhdGlvbnM6YzpvOjY4YjJlNzdjNzA1N2JmZDFmNGQxODNjZGQ2MzVkZmM2Ojc6ODYyOTo4NWIyNTMwZDRmZmFhMTM5MjViZDViYWQxOWY1MWI5YzkxYzJkZmVhNmE4M2FiMzJkNmJiYzgxNWYxNGQwYmJjOnA6RjpG).",
  "Title": "Microsoft and CrowdStrike announce the Falcon platform now available on Microsoft Marketplace",
  "Description": "The post [Microsoft and CrowdStrike announce the Falcon platform now available on Microsoft Marketplace](https://news.microsoft.com/source/2026/02/18/microsoft-and-crowdstrike-announce-the-falcon-platform-now-available-on-microsoft-marketplace/) appeared first on [Source](https://news.microsoft.com/source).",
  "FeedName": "Microsoft News",
  "FeedLevelAuthor": "Source"
}
