{
  "Tags": [
    "collaboration tools",
    "Improvement"
  ],
  "FeedLevelAuthor": "Archive: 2026 - GitHub Changelog",
  "Author": "Allison",
  "Title": "Improved pull request “Files changed” – February 5 updates",
  "OutputDir": "_news",
  "Link": "https://github.blog/changelog/2026-02-05-improved-pull-request-files-changed-february-5-updates",
  "FeedUrl": "https://github.blog/changelog/feed/",
  "ProcessedDate": "2026-02-06 01:31:09",
  "Description": "This release brings CODEOWNERS validation to the new “Files changed” experience and includes broad performance improvements across common review workflows. Navigation between pull request tabs is faster and more reliable,…\n\nThe post [Improved pull request “Files changed” – February 5 updates](https://github.blog/changelog/2026-02-05-improved-pull-request-files-changed-february-5-updates) appeared first on [The GitHub Blog](https://github.blog).",
  "PubDate": "2026-02-05T23:05:59+00:00",
  "EnhancedContent": "This release brings `CODEOWNERS` validation to the new “Files changed” experience and includes broad performance improvements across common review workflows. Navigation between pull request tabs is faster and more reliable, especially when moving between **Conversations** and **Files changed**. Review interactions are smoother for the largest pull requests, with better scrolling, reduced memory usage, and overall stability improvements.\n\n## 🗂️ Codeowner validation\n\nWe added `CODEOWNERS` validation, filling a gap from the classic “Files changed” experience. Required reviewers are now correctly surfaced based on `CODEOWNERS` rules, ensuring review requirements are accurately enforced before merge.\n\n![Screenshot showing social CODEOWNERS validation in the new Files changed tab](https://github.com/user-attachments/assets/0fe2bf99-9603-48da-ae1e-d56293eb4df6)\n\n## 📲 Small screens improvements\n\nWe are rolling out improvements to the “Files changed” experience on small screens by fixing multiple layout, spacing, and overflow issues, ensuring diffs, comments, headers, and controls render and behave correctly on mobile and smaller viewports.\n\n## 🚀 Performance improvements\n\nPerformance is a top priority for us. Based on your feedback, we’ve shipped several improvements in the past week that directly address lag issues, with a focus on larger pull requests:\n\n- Pull request diffs have been optimized for greater responsiveness when clicking, typing, and scrolling on the page. Early data shows large pull requests in the new files changed experience respond up to 67% faster to these kinds of interactions.\n- Only the largest pull requests use virtualization to enhance performance while scrolling and interacting.\n- It’s now quicker to navigate between the **Conversations** and **Files** tabs, with load times from 10+ seconds to a few seconds.\n- Resizing the file tree is now smoother and more responsive, even for large pull requests with many files.\n- Improved performance and stability when reviewing pull requests in Safari.\n- Fixed high memory usage when reviewing large pull requests.\n\n## 🔧 More fixes and improvements\n\n- **Fixed:** The issue where opening a notification directly into the **Files changed** tab did not mark the notification as read. Notifications now correctly update their read state when viewed, matching the behavior of the classic experience.\n- **Fixed:** An issue where the file diff header was not consistently sticky when scrolling.\n- **Fixed:** An issue where code snippets in thread replies had a background color that was hard to distinguish from the reply background.\n- **Fixed:** An error that occurred when commenting across large index differences in diffs.\n\n## ❤ Feedback\n\nYour feedback is important. You can report problems, ask questions, and view known issues in the [“Files changed” preview feedback discussion](https://gh.io/new-files-changed-feedback).",
  "FeedName": "The GitHub Blog"
}
