{
  "OutputDir": "_news",
  "FeedLevelAuthor": "The GitHub Blog",
  "Description": "Discover the latest trends and insights on public software development activity on GitHub with data from the Innovation Graph through Q3 2025.\n\nThe post [Year recap and future goals for the GitHub Innovation Graph](https://github.blog/news-insights/policy-news-and-insights/year-recap-and-future-goals-for-the-github-innovation-graph/) appeared first on [The GitHub Blog](https://github.blog).",
  "ProcessedDate": "2026-01-28 16:06:24",
  "Tags": [
    "Innovation Graph",
    "News & insights",
    "open source",
    "Policy"
  ],
  "Title": "Year recap and future goals for the GitHub Innovation Graph",
  "Link": "https://github.blog/news-insights/policy-news-and-insights/year-recap-and-future-goals-for-the-github-innovation-graph/",
  "FeedName": "The GitHub Blog",
  "Author": "Kevin Xu",
  "FeedUrl": "https://github.blog/feed/",
  "EnhancedContent": "Today’s data release marks our second full year of regular releases since the[launch of the GitHub Innovation Graph](https://github.blog/news-insights/policy-news-and-insights/announcing-the-github-innovation-graph/). The Innovation Graph serves as a stable, regularly updated source for aggregated statistics on public software development activity around the world, informing public policy, strengthening research, guiding funding decisions, and equipping organizations with the evidence needed to build secure and resilient AI systems.\n\n## Updated bar chart races\n\nWith our new data release, we’ve updated the bar chart race videos to the [git pushes](https://innovationgraph.github.com/global-metrics/git-pushes), [repositories](https://innovationgraph.github.com/global-metrics/repositories), [developers](https://innovationgraph.github.com/global-metrics/developers), and [organizations](https://innovationgraph.github.com/global-metrics/organizations) global metrics pages.\n\nLet’s take a look back at some of the progress the Innovation Graph has helped drive.\n\n## Academic papers\n\nOne of the most rewarding aspects of the past year has been seeing the growing range of research questions addressed with Innovation Graph data. Recent papers have explored everything from global collaboration networks to the institutional foundations of digital capabilities.\n\nThese studies showcase how network analysis techniques can be applied to Innovation Graph data, in addition to  [earlier work we referenced last year](https://github.blog/news-insights/policy-news-and-insights/thats-a-wrap-github-innovation-graph-in-2024/#academic-papers) linking open source to economic value, innovation measurement, labor markets, and AI-driven productivity through other methodologies.\n\n### Historical Institutions and Modern Digital Capabilities: New Evidence from GitHub in Africa\n\nResearch by an economist at the Federal Reserve Board uses GitHub data to examine how the density of Protestant mission stations correlates with present-day participation in digital production across African countries.\n\n- Olana, Deriba, “Historical Institutions and Modern Digital Capabilities: New Evidence from GitHub in Africa” (November 25, 2025). Available at SSRN: [https://ssrn.com/abstract=5805622](https://ssrn.com/abstract=5805622) or [http://dx.doi.org/10.2139/ssrn.5805622](https://dx.doi.org/10.2139/ssrn.5805622).\n\n### The Structure of Cross-National Collaboration in Open-Source Software Development\n\nResearchers from MIT, Carnegie Mellon, and the University of Chicago analyze international collaboration patterns in the Innovation Graph’s economy collaborators dataset, shedding light on how common colonial histories influence modern software development collaboration activities.\n\n- Xu, Henry, et al. “The Structure of Cross-National Collaboration in Open-Source Software Development,” (November 10, 2025). Available at doi.org/10.1145/3746252.3761237.\n- Replication package available at [https://github.com/hehao98/github-innovation-graph](https://github.com/hehao98/github-innovation-graph).\n\n### Small-World Phenomenon of Global Open-Source Software Collaboration on GitHub\n\nA social network analysis by researchers at Midwestern State University and Tarleton State University highlights the tightly connected, [small-world](https://en.wikipedia.org/wiki/Six_degrees_of_separation) structure of global OSS collaboration.\n\n- Zhang, Guoying, et al. “Small-World Phenomenon of Global Open-Source Software Collaboration on Github: A Social Network Analysis.” *Journal of Global Information Management* Vol. 33, No. 1 (2025). Available at doi.org/10.4018/JGIM.387412.\n\n### The Software Complexity of Nations\n\nThese researchers extend countries’ software economic complexity into the digital economy by leveraging the geographic distribution of programming languages in open source software, showing that software economic complexity predicts GDP, income inequality, and emissions, which have important policy implications.\n\n- Juhász, Sándor, et al. “The Software Complexity of Nations.” *Research Policy* Vol. 55, No. 3. Available at [doi.org/10.1016/j.respol.2026.105422](https://doi.org/10.1016/j.respol.2026.105422).\n\n## Conferences\n\nThe Innovation Graph and related GitHub datasets were featured prominently in academic and policy discussions at a wide range of venues, including:\n\n- [ATLC25](https://atlconf.spp.gatech.edu/): The 10th Atlanta Conference on Science and Innovation Policy\n- [OpenForum Academy Symposium 2025](https://symposium.openforumeurope.org/)\n- [2nd CEU Vienna Data Analytics Jamboree](https://events.ceu.edu/2025-12-05/2nd-ceu-vienna-data-analytics-jamboree)\n- [Wharton Human-AI Research: 3rd Annual Business & Generative AI Conference](https://ai.wharton.upenn.edu/business-generative-ai-conference-2025/)\n\n## News publications\n\nWe were also encouraged to see Innovation Graph data referenced in major international reporting. In 2025, two pieces in *The Economist* drew on GitHub data examining [China’s approach to open technology](https://economist.com/business/2025/06/17/why-china-is-giving-away-its-tech-for-free) (June 17, 2025) and[India’s potential role as a distinctive kind of AI superpower](https://economist.com/leaders/2025/09/18/india-could-be-a-different-kind-of-ai-superpower) (September 18, 2025). Coverage like this reinforces the role that data on open source activity can play in understanding geopolitical and economic shifts.\n\n## Reports\n\nOnce again, Innovation Graph data contributed to several flagship reports, including:\n\n- [The 2025 Stanford AI Index Report](https://hai.stanford.edu/ai-index)\n- [The 2025 WIPO Global Innovation Index](https://www.wipo.int/web-publications/global-innovation-index-2025/en/index.html)\n- [The Rise of FOSS in India](https://www.nls.ac.in/news-events/nlsiu-releases-report-on-the-rise-of-foss-in-india/) report from the National Law School of India University\n\nWe continue to value these opportunities to support macro-level measurement efforts, and we’re equally excited by complementary work that dives deeper into regional, institutional, and community-level dynamics.\n\n## Moving forward\n\nAs we move through 2026, we’re grateful for the community that has formed around the Innovation Graph, and we’re looking forward to building the next chapter together. Our focus will be on deepening collaboration, welcoming new perspectives, and creating clearer pathways for people to apply the Innovation Graph data in their own contexts, from strategy and research to product development and policy.",
  "PubDate": "2026-01-28T16:00:00+00:00"
}
