{
  "OutputDir": "_news",
  "Author": "Allison",
  "Tags": [
    "application security",
    "Improvement"
  ],
  "FeedLevelAuthor": "Archive: 2026 - GitHub Changelog",
  "Description": "GitHub secret scanning is adding support for extended metadata checks in security configurations. This change makes it substantially easier to enable extended metadata checks at scale. As announced previously, repositories…\n\nThe post [Secret scanning improvements to extended metadata checks](https://github.blog/changelog/2026-02-18-secret-scanning-improvements-to-extended-metadata-checks) appeared first on [The GitHub Blog](https://github.blog).",
  "FeedName": "The GitHub Blog",
  "ProcessedDate": "2026-02-18 22:06:20",
  "Title": "Secret scanning improvements to extended metadata checks",
  "FeedUrl": "https://github.blog/changelog/feed/",
  "PubDate": "2026-02-18T21:31:29+00:00",
  "Link": "https://github.blog/changelog/2026-02-18-secret-scanning-improvements-to-extended-metadata-checks",
  "EnhancedContent": "GitHub secret scanning is adding support for extended metadata checks in security configurations. This change makes it substantially easier to enable extended metadata checks at scale.\n\nAs [announced previously](https://github.blog/changelog/2026-01-15-secret-scanning-extended-metadata-to-be-automatically-enabled-for-certain-repositories/), repositories with validity checks enabled will automatically see extended metadata checks enabled as part of this change. You can track feature enablement status by monitoring the audit log for your enterprise or organization.\n\n### What are extended metadata checks?\n\nWith extended metadata checks, secret scanning alerts now display details about a secret’s owner, secret creation and expiry dates, and project or organization context when information is available from the secret provider. This feature extends validity checks to additional context about the secret.\n\nFor example, leaked OpenAI keys with information available will display the secret owner’s name, email, and identifier, in addition to information about the organization.\n\nThese new metadata keys expand on existing validity checks to give more actionable context for triage and remediation, enabling development and security teams to assess exposure faster and prioritize remediation.\n\nNote: The availability of metadata depends on the secret provider, the type of token, and sometimes even the secret itself. GitHub makes a best effort to display all available metadata, but not every key will always be present.\n\n### What’s changing?\n\nExtended metadata checks are currently available to Enterprise Cloud customers with secret scanning who have validity checks enabled. You can now enable or disable the feature at organization and enterprise levels with security configurations. Repositories with validity checks enabled with security configurations will see metadata checks automatically enabled for them as part of this change.\n\n### Learn more and share feedback\n\nLearn more about [securing your repositories with secret scanning](https://docs.github.com/enterprise-cloud@latest/code-security/concepts/secret-security/about-secret-scanning) or [share feedback](https://github.com/orgs/community/discussions/177054) about secret scanning and extended metadata checks."
}
