{
  "FeedUrl": "https://github.blog/changelog/feed/",
  "Title": "Improved search for GitHub Issues in public preview",
  "Link": "https://github.blog/changelog/2026-01-29-improved-search-for-github-issues-in-public-preview",
  "FeedName": "The GitHub Blog",
  "OutputDir": "_news",
  "EnhancedContent": "It’s now easier than ever to find exactly the issue you’re looking for with our improved search for GitHub Issues. Built on our new semantic index, you can now find results based on the meaning of your query, not just the keywords you use.\n\n# What’s new\n\nSearch for issues using natural language like “authentication failing on mobile” or “funny timeline behavior”, and GitHub returns conceptually similar results, even if the issue titles or descriptions use completely different wording. The more descriptive your query, the better your results.\n\nOur prerelease testing has found that this is a significant improvement for users. Overall, results are 39% better with semantic search compared to traditional search.\n\n![Line chart showing a major improvement in search ranking for GitHub Issues. Lexical Search averages a low position of 4, while the new Semantic Search consistently finds results closer to position 1 or 2](https://github.com/user-attachments/assets/64116472-5acb-4245-ace1-c79eb91c9903)\n\n## How it works\n\nSemantic search activates when you describe what you’re looking for in natural language. To make best use of this, results are now automatically ordered by “Best match” to surface the most relevant issues first.\n\nFor searches that need exact matching (e.g. queries with quotation marks) GitHub uses the traditional, lexical search engine to give you the precision you need.\n\nDuring public preview, you can opt out using the [feature preview dialog](https://docs.github.com/get-started/using-github/exploring-early-access-releases-with-feature-preview).\n\n## How to try it\n\nHead to any repository’s **Issues** tab and search using natural language. We’d love to hear what you think. Share your experience in our [community discussion](https://github.com/orgs/community/discussions/185760) post.\n\n# Additional improvements to issues and projects\n\n- We’ve fixed a bug causing slow performance when searching for labels on Edge and Safari.\n- A Safari based scrolling bug impacting GitHub Issues is now fixed for smoother scroll behaviour.\n- Milestone ordering works consistently for both open and closed issues.",
  "Tags": [
    "projects & issues",
    "Release"
  ],
  "ProcessedDate": "2026-01-29 18:08:21",
  "Author": "Allison",
  "PubDate": "2026-01-29T11:07:03+00:00",
  "FeedLevelAuthor": "Archive: 2026 - GitHub Changelog",
  "Description": "It’s now easier than ever to find exactly the issue you’re looking for with our improved search for GitHub Issues. Built on our new semantic index, you can now find…\n\nThe post [Improved search for GitHub Issues in public preview](https://github.blog/changelog/2026-01-29-improved-search-for-github-issues-in-public-preview) appeared first on [The GitHub Blog](https://github.blog)."
}
