{
  "OutputDir": "_news",
  "Author": "Allison",
  "FeedName": "The GitHub Blog",
  "Title": "New repository settings for configuring pull request access",
  "EnhancedContent": "Maintainers now have more control over how repositories accept contributions. Two new settings let you manage pull requests to better match your project’s needs.\n\n### Disable pull requests entirely\n\nYou can now turn off pull requests entirely from your repository’s **Settings**, just like you can with wikis, issues, discussions, and projects. When disabled, the pull requests tab will not be visible. This means no one can see existing pull requests or open new ones.\n\nThis is particularly useful for mirror repositories, read-only codebases, or projects where you want to share your work publicly without managing contributions.\n\n![Repository setting to disable pull requests](https://github.com/user-attachments/assets/3d15772d-9ce4-4d98-b7d3-1d6963c45072)\n\n### Restrict pull requests to collaborators\n\nYou can now restrict pull request creation to collaborators only if you still want to use the pull request flow with a managed group of contributors. When enabled, the pull requests tab remains visible. All pull requests can be seen and commented on, but only collaborators (i.e., users with write access) can create new ones. Collaborators can be added or removed by going to the **Collaborators** tab in a repository’s settings.\n\nThis helps you manage contribution quality during critical development phases or when you need tighter control over who submits changes.\n\n![Repository setting to restrict pull request creation to collaborators only](https://github.com/user-attachments/assets/5c9fde90-5134-43fa-8134-2a83c20c6850)\n\n### Availability\n\nThese settings are available now for all public and private repositories. Navigate to your repository’s **Settings** &gt; **General** &gt; **Features** to configure pull request access.\n\n**Mobile app:** Full UI changes are coming soon to the mobile app. Currently if you disable pull requests, the pull requests tab will still appear in the app, but no one can create new pull requests. All other settings work the same across both platforms.\n\n**Note:** To temporarily limit activity from certain users on a public repository, you can continue to use [temporary interaction limits](https://docs.github.com/en/communities/moderating-comments-and-conversations/limiting-interactions-in-your-repository).\n\n[Learn more about managing pull request settings](https://docs.github.com/en/repositories/managing-your-repositorys-settings-and-features/enabling-features-for-your-repository/disabling-pull-requests)\n\nFor a deeper dive on why we’re doing this and our broader efforts, check out our [latest blog post](https://github.blog/open-source/maintainers/welcome-to-the-eternal-september-of-open-source-heres-what-we-plan-to-do-for-maintainers/). To share your feedback, join the conversation in our [Community discussion](https://github.com/orgs/community/discussions/187038).",
  "Description": "Maintainers now have more control over how repositories accept contributions. Two new settings let you manage pull requests to better match your project’s needs. Disable pull requests entirely You can…\n\nThe post [New repository settings for configuring pull request access](https://github.blog/changelog/2026-02-13-new-repository-settings-for-configuring-pull-request-access) appeared first on [The GitHub Blog](https://github.blog).",
  "ProcessedDate": "2026-02-13 19:15:08",
  "PubDate": "2026-02-13T18:12:55+00:00",
  "FeedLevelAuthor": "Archive: 2026 - GitHub Changelog",
  "Tags": [
    "collaboration tools",
    "Release"
  ],
  "Link": "https://github.blog/changelog/2026-02-13-new-repository-settings-for-configuring-pull-request-access",
  "FeedUrl": "https://github.blog/changelog/feed/"
}
