{
  "FeedName": "The GitHub Blog",
  "Tags": [
    "GitHub Security Lab",
    "npm",
    "Security",
    "Supply chain security"
  ],
  "FeedLevelAuthor": "The GitHub Blog",
  "Description": "Security advice for users and maintainers to help reduce the impact of the next supply chain malware attack.\n\nThe post [Strengthening supply chain security: Preparing for the next malware campaign](https://github.blog/security/supply-chain-security/strengthening-supply-chain-security-preparing-for-the-next-malware-campaign/) appeared first on [The GitHub Blog](https://github.blog).",
  "PubDate": "2025-12-23T23:52:08+00:00",
  "OutputDir": "_news",
  "EnhancedContent": "The open source ecosystem continues to face organized, adaptive supply chain threats that spread through compromised credentials and malicious package lifecycle scripts. The most recent example is the multi-wave Shai-Hulud campaign.\n\nWhile individual incidents differ in their mechanics and speed, the pattern is consistent: Adversaries learn quickly, target maintainer workflows, and exploit trust boundaries in publication pipelines.\n\nThis post distills durable lessons and actions to help maintainers and organizations harden their systems and prepare for the next campaign, not just respond to the last one. We also share more about what’s next on the npm security roadmap over the next two quarters.\n\n# Recent Shai-Hulud Campaigns\n\nShai-Hulud is a coordinated, multi-wave campaign targeting the JavaScript supply chain and evolved from opportunistic compromises to engineered, targeted attacks.\n\nThe first wave focused on abusing compromised maintainer accounts. It injected malicious post install scripts to slip malicious code into packages, exfiltrate secrets, and self-replicate, demonstrating how quickly a single foothold can ripple across dependencies.\n\nThe second wave, referred to as Shai-Hulud 2.0, escalated the threat: Its ability to self-replicate and spread via compromised credentials was updated to enable cross-victim credential exposure. The second wave also introduced endpoint command and control via self-hosted runner registration, harvesting a wider range of secrets to fuel further propagation, and destructive functionality. This wave added a focus on CI environments, changing its behavior when it detects it is running in this context and including privilege escalation techniques targeted to certain build agents. It also used a multi-stage payload that was harder to detect than the previous wave payload. The shortened timeline between variants signals an organized adversary studying community defenses and rapidly iterating around them.\n\nRather than isolated breaches, the Shai-Hulud campaigns target trust boundaries in maintainer workflows and CI publication pipelines, with a focus on credential harvesting and install-time execution. The defining characteristics we see across waves include:\n\n- **Credential-adjacent compromise:** Attackers gain initial footholds via compromised credentials or OAuth tokens, then pivot to collect additional secrets (npm tokens, CI tokens, cloud credentials) to expand reach. This enables reuse across organizations and future waves without a single point of failure.\n- **Install-time execution with obfuscation:** Malicious post-install or lifecycle scripts are injected into packages (or dependency chains) and only reveal behavior at runtime. Payloads are often conditionally activated (e.g., environment checks, org scopes) and exfiltrate data using techniques tailored to the environment it is running in.\n- **Targeting trusted namespaces and internal package names:** The campaign affected popular and trusted packages, and the worm published infected packages with existing package names. The second wave also patched the version number of the package to make the infected packages look like legitimate updates and blend in with normal maintainer activity.\n- **Rapid iteration and engineering around defenses:** Short intervals between variants and deliberate changes to bypass previous mitigations indicate an organized campaign mindset. The goal is durable access and scalable spread, not one-off opportunism.\n- **Review blind spots in publication pipelines:** Differences between source and published artifacts, lifecycle scripts, and build-time transformations create gaps where injected behavior can land without notice if teams lack artifact validation or staged approvals.\n\nRecent waves in this pattern reinforce that defenders should harden publication models and credential flows proactively, rather than tailoring mitigations to any single variant.\n\n# What’s Next for npm\n\nWe’re accelerating our security roadmap to address the evolving threat landscape. Moving forward, our immediate focus is on adding support for:\n\n- **Bulk OIDC onboarding**: Streamlined tooling to help organizations migrate hundreds of packages to trusted publishing at scale.\n- **Expanded OIDC provider support**: Adding support for additional CI providers beyond GitHub Actions and GitLab.\n- **Staged publishing**: A new publication model that gives maintainers a review period before packages go live, with MFA-verified approval from package owners. This empowers teams to catch unintended changes before they reach downstream users—a capability the community has been requesting for years.\n\nTogether, these investments give maintainers stronger, more flexible tools to secure their packages at every stage of the publication process.\n\n# Advice for GitHub and npm users and maintainers\n\nMalware like Shai-Hulud often spreads by adding malicious code to npm packages. The malicious code is executed as part of the installation of the package so that any npm user who installs the package is compromised. The malware scavenges the local system for tokens, which it can then use to continue propagating. Since npm packages often have many dependencies, by adding malware to one package, the attacker can indirectly infect many other packages. And by hoarding some of the scavenged tokens rather than using them immediately, the attacker can launch a new campaign weeks or months after the initial compromise.\n\nIn the “References” section below, we have included links to longer articles with analysis of recent campaigns and advice on how to stay secure, so we won’t rehash all of that information here. Instead, here is a short summary of our top recommendations:\n\n### Advice for everyone\n\n- Enable phishing-resistant MFA on all your accounts, particularly for [GitHub](https://docs.github.com/en/authentication/securing-your-account-with-two-factor-authentication-2fa/configuring-two-factor-authentication#configuring-two-factor-authentication-using-a-passkey) package managers like [npm](https://docs.npmjs.com/configuring-two-factor-authentication), [PyPI](https://pypi.org/help/#twofa), [RubyGems](https://guides.rubygems.org/setting-up-multifactor-authentication/), or [NuGet](https://learn.microsoft.com/en-us/nuget/nuget-org/individual-accounts), and also any accounts that could be leveraged for account takeover or phishing, like email and social media accounts.\n- Always set an [expiration date](https://docs.github.com/en/authentication/keeping-your-account-and-data-secure/token-expiration-and-revocation) on tokens to ensure that they’re rotated on a regular schedule. Organizations can enforce a [maximum lifetime policy](https://docs.github.com/en/organizations/managing-programmatic-access-to-your-organization/setting-a-personal-access-token-policy-for-your-organization#enforcing-a-maximum-lifetime-policy-for-personal-access-tokens).\n- Audit and [revoke access](https://docs.github.com/en/apps/using-github-apps/reviewing-and-revoking-authorization-of-github-apps) for unused GitHub/OAuth apps.\n- Use a sandbox, such as [GitHub Codespaces](https://github.com/features/codespaces) or a virtual machine or container, for development work. This limits the access of any malware that you accidentally run.\n\n### Advice for maintainers\n\n- Enable [branch protection](https://docs.github.com/en/repositories/configuring-branches-and-merges-in-your-repository/managing-protected-branches/about-protected-branches) so that malicious updates cannot be pushed directly to your main branch, even if the attacker has access to a valid token.\n- Use npm [trusted publishing](https://docs.npmjs.com/trusted-publishers) instead of tokens. Trusted publishing is also available for other package managers such as [PyPI](https://docs.pypi.org/trusted-publishers/), [RubyGems](https://guides.rubygems.org/trusted-publishing), and [NuGet](https://learn.microsoft.com/en-us/nuget/nuget-org/trusted-publishing).\n- [Pin CI dependencies](https://docs.github.com/en/actions/reference/security/secure-use#using-third-party-actions), enable [code scanning](https://docs.github.com/en/code-security/code-scanning/enabling-code-scanning/configuring-default-setup-for-code-scanning), and don’t forget to [*resolve* the code scanning alerts](https://docs.github.com/en/code-security/code-scanning/managing-code-scanning-alerts/resolving-code-scanning-alerts#generating-suggested-fixes-for-code-scanning-alerts)!\n- Monitor package artifacts and validate published tarballs/bundles against source (e.g., [SRI](https://developer.mozilla.org/en-US/docs/Web/Security/Defenses/Subresource_Integrity) or [artifact build attestations](https://docs.github.com/en/actions/how-tos/secure-your-work/use-artifact-attestations/use-artifact-attestations)).\n\nNote that the above advice is preventative. If you believe you are a victim of an attack and need help securing your GitHub or npm account, please contact [GitHub Support](https://support.github.com/).\n\n# References\n\n- [Report a malicious package in npm](https://docs.npmjs.com/reporting-malware-in-an-npm-package)\n- [Our plan for a more secure npm supply chain](https://github.blog/security/supply-chain-security/our-plan-for-a-more-secure-npm-supply-chain/)\n- [Strengthening npm security](https://github.blog/changelog/2025-09-29-strengthening-npm-security-important-changes-to-authentication-and-token-management)\n- [View malware advisories in the Advisory Database](https://github.com/advisories?query=type%3Amalware)\n- [Quickstart for securing your repository](https://docs.github.com/en/code-security/getting-started/quickstart-for-securing-your-repository)\n- [Dependency review on GitHub](https://docs.github.com/en/code-security/supply-chain-security/understanding-your-software-supply-chain/about-dependency-review)\n- [OpenSSF best practices for npm](https://github.com/ossf/package-manager-best-practices/blob/main/published/npm.md#readme)\n- [Microsoft’s guidance for detecting and defending](https://www.microsoft.com/en-us/security/blog/2025/12/09/shai-hulud-2-0-guidance-for-detecting-investigating-and-defending-against-the-supply-chain-attack/)\n- [Recent improvements to GitHub Actions](https://github.blog/changelog/2025-11-07-actions-pull_request_target-and-environment-branch-protections-changes/)",
  "Title": "Strengthening supply chain security: Preparing for the next malware campaign",
  "Author": "Madison Oliver",
  "FeedUrl": "https://github.blog/feed/",
  "Link": "https://github.blog/security/supply-chain-security/strengthening-supply-chain-security-preparing-for-the-next-malware-campaign/",
  "ProcessedDate": "2025-12-24 09:16:01"
}
