{
  "FeedLevelAuthor": "Archive: 2026 - GitHub Changelog",
  "Title": "GitHub MCP Server: New Projects tools, OAuth scope filtering, and new features",
  "Link": "https://github.blog/changelog/2026-01-28-github-mcp-server-new-projects-tools-oauth-scope-filtering-and-new-features",
  "PubDate": "2026-01-28T10:23:45+00:00",
  "FeedName": "The GitHub Blog",
  "Description": "The GitHub MCP Server has arrived with improved capabilities to manage GitHub Projects with more efficient usage of the context window, automatic tool filtering based on your token’s permissions, and…\n\nThe post [GitHub MCP Server: New Projects tools, OAuth scope filtering, and new features](https://github.blog/changelog/2026-01-28-github-mcp-server-new-projects-tools-oauth-scope-filtering-and-new-features) appeared first on [The GitHub Blog](https://github.blog).",
  "ProcessedDate": "2026-01-29 11:09:18",
  "EnhancedContent": "![A code snippet defines a GitHub server configuration with an HTTP endpoint, an api.githubcopilot.com MCP insiders URL, and an X&#8209;MCP&#8209;Toolsets header set to projects.](https://github.com/user-attachments/assets/c80409be-8021-4b1e-9533-7dfa7f9b270d)\n\nThe GitHub MCP Server has arrived with improved capabilities to manage GitHub Projects with more efficient usage of the context window, automatic tool filtering based on your token’s permissions, and features including Insiders and HTTP server mode!\n\nVisit the [GitHub MCP Server repository](https://github.com/github/github-mcp-server) to learn more.\n\n## Consolidated GitHub Projects toolset\n\nPreviously, the Projects toolset, as with other now-consolidated toolsets, used a significant portion of the context window for the tools list. As a result, we’ve reduced token usage by around **23,000 tokens** (50%). Managing GitHub Projects is now simpler with a new consolidated set of tools that replace the previous approach. The new `projects` toolset provides unified access to project management capabilities:\n\n- **`projects_list`**: List projects for a user, organization, or repository.\n- **`projects_get`**: Retrieve detailed information about a specific project, including fields and items.\n- **`projects_write`**: Create, update, and manage project items with full field support.\n\nThe consolidated tools handle owner type detection automatically—you no longer need to specify whether the owner is a user or organization.\n\n## OAuth scope filtering\n\nThe GitHub MCP Server now manages tool availability based on your authentication method.\n\nWhen using a classic Personal Access Token (`ghp_` prefix), the server automatically detects your token’s OAuth scopes and hides tools you don’t have permission to use. This reduces clutter and prevents errors from attempting operations your token can’t perform. To learn more about creating a personal access token (PAT) for yourself, check out our docs on [managing your personal access tokens](https://docs.github.com/authentication/keeping-your-account-and-data-secure/managing-your-personal-access-tokens).\n\n### How it works\n\n1. At startup, the server detects if your token is a classic PAT.\n2. It discovers your token’s scopes via a lightweight API call.\n3. Tools requiring scopes your token doesn’t have are automatically hidden.\n\n| Token Type | Behavior | | --- | --- | | Classic PAT (`ghp_`<br>) | Tools filtered based on token scopes | | Fine-grained PAT (`github_pat_`<br>) | All tools shown, API enforces permissions | | OAuth (remote server) | Dynamic scope challenges on-demand |\n\n## Insiders mode for experimental features\n\nWe’re introducing **Insiders mode**, an opt-in mechanism that lets you access experimental and preview functionality in the GitHub MCP Server. This will be available for both local and remote server deployments.\n\n### How it works\n\n- Users explicitly opt in by setting a configuration header or using the new `/insiders`\nURL.\n- When enabled, the MCP Server grants access to experimental features, behavior changes under evaluation, and functionality not yet generally available.\n- Removing the header or reverting to the standard URL instantly restores standard generally available behavior.\n\n## HTTP server mode with OAuth support\n\nEnterprise users are now able to run the GitHub MCP Server in HTTP mode with OAuth token support.\n\n### What’s coming\n\n- **HTTP server mode**: Run the local MCP server as an HTTP server on a configurable port.\n- **Per-request OAuth tokens**: Support tokens via Authorization header.\n- **Fallback support**: Falls back to `GITHUB_PERSONAL_ACCESS_TOKEN`\nif no header is provided.\n- **Enterprise Server compatibility**: Full support for GitHub Enterprise Server deployments.\n\nThis allows enterprise teams to deploy a shared MCP server with OAuth token forwarding, eliminating the need for every user to manage their own personal access tokens.\n\n## Copilot coding agent tools\n\nThe GitHub MCP Server adds new tools and improvements for working with the Copilot coding agent.\n\nThe new `get_copilot_job_status` tool lets you check on Copilot’s progress. You can query by job ID or pull request number.\n\n![Checking the status of Copilot coding agent jobs](https://github.com/user-attachments/assets/1acaa644-3718-4e5f-846c-6c19eee9faa4)\n\nBoth `assign_copilot_to_issue` and `create_pull_request_with_copilot` now support a `base_ref` parameter:\n\n- **Feature branches**: Start Copilot’s work from any branch, not just the default.\n- **Stacked PRs**: Build on existing work by specifying a feature branch as the base.\n- **Sequential tasks**: Chain multiple Copilot assignments together.\n\nTask assignments now return a job ID or pull request link immediately, so you can track status right away.\n\nThe `assign_copilot_to_issue` tool now supports custom instructions.\n\n### Getting started\n\nTo get started, enable the `copilot` toolset.\n\nVisit the [GitHub MCP Server repository](https://github.com/github/github-mcp-server) to learn more.\n\nTry out these features today! If you have feedback, please open an issue in our open-source [GitHub MCP Server repository](https://github.com/github/github-mcp-server).",
  "FeedUrl": "https://github.blog/changelog/feed/",
  "OutputDir": "_news",
  "Author": "Allison",
  "Tags": [
    "copilot",
    "Release"
  ]
}
