{
  "Description": "Linux and Windows arm64 standard GitHub-hosted runners are now supported in private repositories. You can now use these free-tier eligible arm64 runners in all repositories, letting you take advantage of…\n\nThe post [arm64 standard runners are now available in private repositories](https://github.blog/changelog/2026-01-29-arm64-standard-runners-are-now-available-in-private-repositories) appeared first on [The GitHub Blog](https://github.blog).",
  "FeedName": "The GitHub Blog",
  "FeedLevelAuthor": "Archive: 2026 - GitHub Changelog",
  "Tags": [
    "actions",
    "Improvement"
  ],
  "Author": "Allison",
  "FeedUrl": "https://github.blog/changelog/feed/",
  "Link": "https://github.blog/changelog/2026-01-29-arm64-standard-runners-are-now-available-in-private-repositories",
  "ProcessedDate": "2026-01-29 20:04:04",
  "PubDate": "2026-01-29T16:00:13+00:00",
  "EnhancedContent": "Linux and Windows arm64 standard GitHub-hosted runners are now supported in private repositories. You can now use these free-tier eligible arm64 runners in all repositories, letting you take advantage of the performance benefits of arm64 processors and run native multi-architecture builds without the overhead of virtualization or emulation.\n\nBecause these are standard GitHub-hosted runners, usage counts towards the [free minutes included in your plan](https://docs.github.com/billing/concepts/product-billing/github-actions#free-use-of-github-actions).\n\n## What’s new\n\n- Linux and Windows arm64 standard hosted runners are now supported in all repositories.\n- In private repositories, these runners have two vCPUs; in public repositories, they have four vCPUs.\n- These runners use an arm64 processor and images managed by Arm, LLC.\n\nAs standard GitHub-hosted runners, they are eligible for use towards your GitHub plan’s free minute allocation in private repositories. macOS arm64 standard runners are already available for private repositories. This update extends private repository arm64 support to Linux and Windows.\n\nThis is ideal for teams targeting arm64 production, such as containerized services or multi-architecture builds, who want native performance using standard GitHub-hosted runners in private repositories.\n\n## Get started\n\nTo start building on arm64, add one of the following supported labels to the runs-on field in your workflow:\n\n- `windows-11-arm`\n- `ubuntu-24.04-arm`\n- `ubuntu-22.04-arm`\n\nFor more details on arm64 runners and usage, see [our documentation for standard GitHub-hosted runners](https://docs.github.com/actions/reference/runners/github-hosted-runners#standard-github-hosted-runners-for--private-repositories).\n\nThese runners are fully supported standard GitHub-hosted runners and are suitable for production CI workloads.\n\nJoin the discussion within [GitHub Community](https://github.com/orgs/community/discussions/185840).",
  "OutputDir": "_news",
  "Title": "arm64 standard runners are now available in private repositories"
}
