{
  "ProcessedDate": "2026-02-25 00:08:34",
  "PubDate": "2026-02-24T23:37:14+00:00",
  "Link": "https://github.blog/changelog/2026-02-24-github-enterprise-server-3-20-release-candidate-is-available",
  "EnhancedContent": "GitHub Enterprise Server (GHES) 3.20 enhances deployment efficiency, monitoring capabilities, code security, and policy management. Here are a few highlights in the 3.20 release:\n\n- The improved merge experience on the pull request page is now generally available. This is designed to help you better understand the state of your pull request and get it merged faster. Status checks are grouped by status—with failing checks listed first—and ordered using natural sorting. When commit metadata rules fail, merge-time errors explain what to fix. For improved accessibility, the merge experience also has consistent keyboard navigation, focus, and landmarks. Please see [improved pull request merge experience](https://github.blog/changelog/2025-03-04-improved-pull-request-merge-experience-is-now-generally-available/) for a detailed update including screenshots.\n- GitHub releases now support immutability, locking release assets from being added, modified, or deleted after publication and protecting the release tag from being moved or deleted. This helps protect distributed artifacts from supply chain attacks. For more information, see [our changelog about immutable releases](https://github.blog/changelog/2025-10-28-immutable-releases-are-now-generally-available/). Release attestations are not yet supported on GHES and are only available on GitHub.com.\n- Secret scanning includes several improvements to help teams prevent and address credential leaks at scale. Validity checks indicate if secrets are still active; enterprise admins can make the feature available to repository admins from the Management Console. Push protection delegated bypass controls can now be managed at the enterprise level. Secret scanning also supports alert assignment for collaboration. Secret scanning push protection expands default coverage to block additional secrets, reducing the risk of credential leaks during pushes. Finally, secret scanning adds new detectors and improves detectors for existing secret types.\n- Enterprise owners can create and manage enterprise teams to simplify governance across their enterprise. Using the API or enterprise settings UI, owners can assign enterprise teams to organizations, create and assign custom enterprise roles, and assign roles to both teams and users. Organization and repository owners can assign roles to enterprise teams within their scope, and enterprise teams can be added to ruleset bypass lists. There are product limitations to this experience. For more information, see [teams in an enterprise](https://docs.github.com/enterprise-server@3.20/admin/concepts/enterprise-fundamentals/teams-in-an-enterprise#what-kind-of-team-should-i-use). This feature is in public preview and subject to change.\n- For GitHub Advanced Security, including code scanning and secret scanning features, the `Enterprise Security Manager`\nrole is available for simplified security policy and alert management across an enterprise. The role is supported only for enterprises with up to 15,000 organizations. This feature is in public preview.\n- The backup service, previously in public preview, is now generally available in GHES 3.20. The managed, built-in service provides an alternative to GHES backup utilities and does not require a separate host for backup software. For more information, see [Backup service](https://docs.github.com/enterprise-server@3.20/admin/backing-up-and-restoring-your-instance/backup-service-for-github-enterprise-server/about-the-backup-service-for-github-enterprise-server). Please note that [`backup-utils`](https://github.com/github/backup-utils/) will be retired starting in version 3.22.\n\nRelease candidates are a way for you to try the latest features early. They also help us gather feedback to help ensure the release works in your environment. Read more about [the release candidate process](https://docs.github.com/enterprise-server@3.20/admin/overview/about-upgrades-to-new-releases). To learn more about GHES 3.20, check out the [release notes](https://docs.github.com/enterprise-server@3.20/admin/release-notes), or [download the 3.20 release candidate](https://enterprise.github.com/releases/3.20.0/download) now.\n\nIf you have any feedback or questions about the release candidate, please [contact our support team](https://support.github.com/features/enterprise-administrators-server).",
  "Tags": [
    "collaboration tools",
    "Release"
  ],
  "OutputDir": "_news",
  "FeedName": "The GitHub Blog",
  "Title": "GitHub Enterprise Server 3.20 release candidate is available",
  "FeedUrl": "https://github.blog/changelog/feed/",
  "Description": "GitHub Enterprise Server (GHES) 3.20 enhances deployment efficiency, monitoring capabilities, code security, and policy management. Here are a few highlights in the 3.20 release: The improved merge experience on the…\n\nThe post [GitHub Enterprise Server 3.20 release candidate is available](https://github.blog/changelog/2026-02-24-github-enterprise-server-3-20-release-candidate-is-available) appeared first on [The GitHub Blog](https://github.blog).",
  "FeedLevelAuthor": "Archive: 2026 - GitHub Changelog",
  "Author": "Allison"
}
