{
  "ProcessedDate": "2026-01-20 01:30:05",
  "Description": "GitHub Enterprise customers can now configure enterprise-scoped budgets that exclude cost center usage, allowing specific portions of an enterprise to incur additional usage while limiting the rest. Previously, this required…\n\nThe post [Enterprise-scoped budgets that exclude cost center usage in public preview](https://github.blog/changelog/2026-01-19-enterprise-scoped-budgets-that-exclude-cost-center-usage-in-public-preview) appeared first on [The GitHub Blog](https://github.blog).",
  "Author": "Allison",
  "OutputDir": "_news",
  "EnhancedContent": "GitHub Enterprise customers can now configure enterprise-scoped budgets that exclude cost center usage, allowing specific portions of an enterprise to incur additional usage while limiting the rest.\n\nPreviously, this required creating distinct budgets for every part of an enterprise to enforce a default limit. With this improvement, enterprises can now apply an enterprise-scoped budget that excludes cost center usage and selectively grant access to additional usage using cost centers.\n\n![Screenshot showing the new option to exclude cost center usage when configuring an enterprise budget](https://github.com/user-attachments/assets/30311d80-9e91-4f32-860c-4e49e5b450e9)\n\n### Key details\n\n- This option is only available for enterprise-scoped budgets and can be applied to new or existing budgets.\n- Existing enterprise-scoped budgets continue to include cost center usage by default.\n- This option is available through the REST API, and changes to this setting are recorded in the audit log.\n\nTo learn more, see “[Setting up budgets to control spending on metered products](https://docs.github.com/enterprise-cloud@latest/billing/tutorials/set-up-budgets).”",
  "Tags": [
    "enterprise management tools",
    "Improvement"
  ],
  "Title": "Enterprise-scoped budgets that exclude cost center usage in public preview",
  "FeedUrl": "https://github.blog/changelog/feed/",
  "Link": "https://github.blog/changelog/2026-01-19-enterprise-scoped-budgets-that-exclude-cost-center-usage-in-public-preview",
  "FeedName": "The GitHub Blog",
  "PubDate": "2026-01-20T00:27:17+00:00",
  "FeedLevelAuthor": "Archive: 2026 - GitHub Changelog"
}
