{
  "Author": "Allison",
  "ProcessedDate": "2026-01-14 17:05:51",
  "Title": "Organization custom properties now generally available",
  "FeedUrl": "https://github.blog/changelog/feed/",
  "Description": "Organization custom properties are now generally available, giving enterprise administrators a powerful way to tag organizations with metadata and automatically target enterprise rulesets. Why organization custom properties Enterprises often organize…\n\nThe post [Organization custom properties now generally available](https://github.blog/changelog/2026-01-13-organization-custom-properties-now-generally-available) appeared first on [The GitHub Blog](https://github.blog).",
  "Link": "https://github.blog/changelog/2026-01-13-organization-custom-properties-now-generally-available",
  "EnhancedContent": "Organization custom properties are now generally available, giving enterprise administrators a powerful way to tag organizations with metadata and automatically target enterprise rulesets.\n\n## Why organization custom properties\n\nEnterprises often organize their GitHub presence around business units, geographic regions, compliance frameworks, or development stages. Until now, applying consistent rulesets meant manually selecting organizations one-by-one or relying on naming conventions that don’t scale.\n\nWith organization custom properties, you can:\n\n- **Define once, apply everywhere:** Tag organizations with properties like `region: EMEA`\n, `compliance: SOC2` , or `business-unit: Platform` and let your rulesets do the rest.\n- **Eliminate configuration drift:** Rulesets automatically apply to any organization matching your criteria, even newly created ones.\n- **Adapt to your enterprise structure:** Whether you organize by department, regulatory requirements, or project lifecycle, custom properties meet you where you are.\n\nImagine you need to enforce stricter code review requirements for all organizations handling customer data in the EU. Instead of maintaining a manual list, create a ruleset that targets `region: EU` and `data-classification: customer-data` . When a new EU-based team spins up their organization, the policies apply automatically.\n\n## How it works\n\n![A screenshot showing the \"region\" custom property settings, including its name, description, type, options, and other attributes](https://github.com/user-attachments/assets/f802250c-45ed-4532-8d49-1bc7333ccc9b)\n\nEnterprise administrators define custom properties at the enterprise level and assign values to individual organizations. Properties support:\n\n- **Single-select**: Choose one value from a predefined list\n- **Multi-select**: Choose multiple values from a predefined list\n- **Text**: Enter free-form text\n- **True/false**: Set a boolean value\n- **URL**: Enter URL value\n\nOnce you’ve tagged your organizations, enterprise rulesets can target them based on any combination of properties.\n\n![A screenshot of the \"Regional Compliance\" code ruleset settings, showing its evaluation status, an empty bypass list, and target organizations defined by region and compliance frameworks.](https://github.com/user-attachments/assets/19aee9db-45e6-43b9-b956-c85b58b0bdec)\n\n## Get started\n\nOrganization custom properties are available to all GitHub Enterprise Cloud customers.\n\nEnterprise administrators can access custom properties in the organization section of their enterprise settings.\n\nFor more information, see “[Managing custom properties for organizations in your enterprise](https://gh.io/org-properties-docs)” in GitHub Docs.",
  "Tags": [
    "enterprise management tools",
    "Improvement",
    "platform governance"
  ],
  "OutputDir": "_news",
  "FeedLevelAuthor": "Archive: 2026 - GitHub Changelog",
  "FeedName": "The GitHub Blog",
  "PubDate": "2026-01-13T20:48:28+00:00"
}
