{
  "Link": "https://github.blog/changelog/2025-12-18-github-enterprise-cloud-data-residency-in-japan-is-generally-available",
  "Title": "GitHub Enterprise Cloud data residency in Japan is generally available",
  "FeedUrl": "https://github.blog/changelog/feed/",
  "Author": "Allison",
  "EnhancedContent": "GitHub Enterprise Cloud with data residency in Japan is now generally available, allowing GitHub Enterprise Cloud customers greater flexibility in choosing where their code and repository data are stored. This ensures enterprise customers have a single, global DevOps platform for their teams, while providing the ability to maintain their code close to home.\n\nWith this release, teams can enhance productivity and collaboration while gaining more control over their code to meet their data residency preferences. This will help customers in Japan or with specific requirements in the region meet their compliance, regulatory, or data residency needs.\n\n### What is GitHub Enterprise Cloud with data residency?\n\nGitHub Enterprise Cloud is a multi-tenant, enterprise SaaS deployment option of GitHub Enterprise powered by Microsoft Azure. It provides a single, end-to-end DevOps platform with a suite of tools and features that integrate with the GitHub ecosystem, allowing organizations to build, secure, and ship software at scale.\n\nWith the introduction of data residency in Japan, customers now have the flexibility to choose where their code is stored. GitHub Enterprise Cloud with data residency is powered by Microsoft Azure’s globally distributed data center infrastructure, providing high availability, security, and performance wherever your teams are located.\n\n### Who is this available for?\n\nGitHub Enterprise Cloud with data residency in Japan is available for customers who need their code and repository data to reside in that region. Support for additional regions is currently being planned and will be announced in future changelog updates.\n\n### How can you access GitHub Enterprise Cloud with data residency in Japan?\n\nGet started today by [contacting our sales team](https://github.com/enterprise/contact?utm_campaign=ghec-data-residency-leads), or by [signing up for a free 30-day trial of GitHub Enterprise Cloud with data residency](https://docs.github.com/enterprise-cloud@latest/admin/overview/setting-up-a-trial-of-github-enterprise-cloud). You can also learn more by [visiting our Docs](https://docs.github.com/enterprise-cloud@latest/admin/overview/about-github-enterprise-cloud) and exploring GitHub Enterprise Cloud deployment options.",
  "FeedLevelAuthor": "Archive: 2025 - GitHub Changelog",
  "Description": "GitHub Enterprise Cloud with data residency in Japan is now generally available, allowing GitHub Enterprise Cloud customers greater flexibility in choosing where their code and repository data are stored. This…\n\nThe post [GitHub Enterprise Cloud data residency in Japan is generally available](https://github.blog/changelog/2025-12-18-github-enterprise-cloud-data-residency-in-japan-is-generally-available) appeared first on [The GitHub Blog](https://github.blog).",
  "PubDate": "2025-12-18T17:00:58+00:00",
  "FeedName": "The GitHub Blog",
  "OutputDir": "_news",
  "Tags": [
    "enterprise management tools",
    "Release"
  ],
  "ProcessedDate": "2025-12-18 18:03:40"
}
