{
  "Tags": [
    "actions",
    "Release"
  ],
  "Description": "This month, GitHub Actions introduces new capabilities, including custom runner autoscaling, expanded security controls for all users, and early access to new Windows and macOS runner images. GitHub Actions runner…\n\nThe post [GitHub Actions: Early February 2026 updates](https://github.blog/changelog/2026-02-05-github-actions-early-february-2026-updates) appeared first on [The GitHub Blog](https://github.blog).",
  "OutputDir": "_news",
  "EnhancedContent": "This month, GitHub Actions introduces new capabilities, including custom runner autoscaling, expanded security controls for all users, and early access to new Windows and macOS runner images.\n\n## GitHub Actions runner scale set client\n\nThe GitHub Actions runner scale set client is now available in public preview. The client is a standalone Go-based module that lets you build custom autoscaling solutions for GitHub Actions runners without requiring Kubernetes.\n\nThe client provides the core building blocks for implementing autoscaling on any infrastructure. Whether you’re running containers, virtual machines, bare metal servers, or cloud services, by integrating directly with GitHub’s scale set APIs, you gain full control over runner lifecycle management while GitHub handles the orchestration logic.\n\n**Key capabilities:**\n\n- **Platform agnostic design**: Works with containers, virtual machines, and bare metal servers across Windows, Linux, and macOS.\n- **Full provisioning control**: You define how runners are created, scaled, and destroyed based on your specific requirements.\n- **Native multi-label support**: Assign multiple labels to each scale set, optimizing resources for multiple build types.\n- **Agentic scenario support**: Supports agentic workflows, including GitHub [Copilot coding agent](https://docs.github.com/enterprise-cloud@latest/copilot/how-tos/use-copilot-agents/coding-agent/customize-the-agent-environment?utm_source=changelog-docs-cca-selfhosted-runners&amp;utm_medium=changelog&amp;utm_campaign=universe25#about-customizing-copilot-coding-agents-development-environment).\n- **Real-time telemetry**: Monitor job execution and runner performance with built-in metrics.\n\n### How it works\n\nThe client orchestrates API interactions with GitHub’s scale set infrastructure while leaving the actual runner provisioning entirely in your hands. This separation means you maintain complete control over your infrastructure decisions. Whether that’s spinning up containers, launching cloud virtual machines, or provisioning physical hardware, all while benefiting from GitHub’s scale set APIs.\n\n**Important**: You’ll manage all infrastructure setup, provisioning logic, and scaling strategies. GitHub provides the APIs and client libraries. You’re responsible for implementing your infrastructure automation.\n\n### Relationship to Actions Runner Controller\n\nThe Runner Scale Set Client isn’t a replacement for Actions Runner Controller (ARC), which remains a reference implementation of the scale set APIs and the recommended Kubernetes solution for autoscaling runners. Instead, the client is a new tool for interfacing with same scale set APIs for building custom autoscaling solutions outside of Kubernetes. Multi-label support will also be made available for ARC with the 0.14.0, which will be available in March 2025—see [the issue for adding this support](https://github.com/github/roadmap/issues/1195).\n\n### Get started\n\nThe [GitHub Actions Runner Scale Set Client](https://github.com/actions/scaleset) is fully open source and available for you to explore the source code and adapt the implementation to your specific infrastructure needs. You can also visit the [GitHub Actions Runner Scale Set Client documentation](https://docs.github.com/actions/hosting-your-own-runners) for additional information.\n\nTry out [GitHub Actions Runner Scale Set Client](https://github.com/actions/scaleset), join the [community discussion](https://gh.io/to-community-186265), and share your feedback!\n\n## Allowed actions settings now available for all plan types\n\nAction allowlisting is now available across all GitHub plans, bringing security controls to Free, Team, and Enterprise customers. You can define exactly which actions and reusable workflows run in your repositories to enforce least privilege principles, protect against potentially compromised actions, and maintain consistent policies.\n\nLearn more in the [managing GitHub Actions permissions documentation](https://docs.github.com/repositories/managing-your-repositorys-settings-and-features/enabling-features-for-your-repository/managing-github-actions-settings-for-a-repository#allowing-select-actions-and-reusable-workflows-to-run), which includes step-by-step configuration examples and security best practices.\n\n## Windows Server 2025 with Visual Studio 2026 image now available for GitHub-hosted runners\n\nA new Windows runner image with Visual Studio 2026 is now available in public preview. This dedicated image runs alongside the current windows-2025 image, providing a safe validation path ahead of the default Windows image migration. Visual Studio 2026 will be integrated into the windows-2025 image when it reaches general availability on May 4, 2026.\n\nYou can test against Visual Studio 2026 without disrupting existing pipelines, identify and fix compatibility issues on your timeline, maintain fallback options (like windows-2022) if needed, and plan migrations with full visibility into the upgrade timeline.\n\nTo use the the new runner image, update the `runs-on:` target in your YAML workflow file to `windows-2025-vs2026` . For additional information on the available windows runner images, visit [our doucmentation](https://docs.github.com/actions/reference/runners/github-hosted-runners?versionId=free-pro-team%40latest&amp;productId=actions&amp;restPage=concepts%2Crunners%2Cgithub-hosted-runners).\n\n## macOS 26 Intel image now available for GitHub-hosted runners\n\nWe’ve released the GitHub Actions macOS 26 Intel runner image in public preview for larger runners, providing the latest macOS and Xcode tooling for Intel-based workflows. To use it, update the `runs-on:` target in your YAML workflow file to `macos-26-large` . For complete details on available software and versions, visit the [macOS runner images documentation](https://docs.github.com/actions/reference/runners/larger-runners#available-macos-larger-runners-and-labels).",
  "Author": "Allison",
  "FeedUrl": "https://github.blog/changelog/feed/",
  "Title": "GitHub Actions: Early February 2026 updates",
  "Link": "https://github.blog/changelog/2026-02-05-github-actions-early-february-2026-updates",
  "PubDate": "2026-02-05T12:51:46+00:00",
  "ProcessedDate": "2026-02-05 14:15:56",
  "FeedLevelAuthor": "Archive: 2026 - GitHub Changelog",
  "FeedName": "The GitHub Blog"
}
