{
  "Title": "Access all pull request comments without leaving the new Files changed page",
  "FeedUrl": "https://github.blog/changelog/feed/",
  "Link": "https://github.blog/changelog/2026-02-19-access-all-pull-request-comments-without-leaving-the-new-files-changed-page",
  "Description": "When reviewing a pull request, it’s common to move back and forth between the “Files changed” and the “Conversation” pages just to understand the full context. With this update, you…\n\nThe post [Access all pull request comments without leaving the new Files changed page](https://github.blog/changelog/2026-02-19-access-all-pull-request-comments-without-leaving-the-new-files-changed-page) appeared first on [The GitHub Blog](https://github.blog).",
  "EnhancedContent": "When reviewing a pull request, it’s common to move back and forth between the “Files changed” and the “Conversation” pages just to understand the full context. With this update, you no longer need to switch tabs to follow the discussion.\n\nGeneral comments on the pull request are now available in the **Comments** panel in the new “Files changed” page, so you can review code and keep track of high-level conversations in one place. You can also add new comments from this panel without navigating away.\n\nYou can also **quote reply** to an existing comment from this panel, making it easier to respond with context and keep discussions clear.\n\nWe improved the resolved and unresolved filters so comment states display correctly and update as expected.\n\n## ✋ Improvements to “Request changes” reviews\n\nWhen requesting changes, you no longer need to add a summary if you’ve already left comments. Now you can submit your review without adding extra reasoning.\n\n## ❤ Feedback\n\nYour feedback is important. You can report problems, ask questions, and view known issues in the [“Files changed” preview feedback discussion](https://gh.io/new-files-changed-feedback).",
  "FeedLevelAuthor": "Archive: 2026 - GitHub Changelog",
  "OutputDir": "_news",
  "Tags": [
    "collaboration tools",
    "Improvement"
  ],
  "Author": "Allison",
  "ProcessedDate": "2026-02-19 20:06:06",
  "PubDate": "2026-02-19T19:03:09+00:00",
  "FeedName": "The GitHub Blog"
}
