{
  "FeedLevelAuthor": "The GitHub Blog",
  "Link": "https://github.blog/news-insights/octoverse/what-the-fastest-growing-tools-reveal-about-how-software-is-being-built/",
  "PubDate": "2026-02-03T17:00:00+00:00",
  "ProcessedDate": "2026-02-03 17:17:09",
  "FeedName": "The GitHub Blog",
  "OutputDir": "_news",
  "Tags": [
    "News & insights",
    "Octoverse"
  ],
  "Title": "What the fastest-growing tools reveal about how software is being built",
  "EnhancedContent": "In 2025, software development crossed a quiet threshold. In [our latest Octoverse report](https://github.blog/news-insights/octoverse/octoverse-a-new-developer-joins-github-every-second-as-ai-leads-typescript-to-1/), we found that the fastest-growing languages, tools, and open source projects on GitHub are no longer about shipping more code. Instead, they’re about reducing friction in a world where AI is helping developers build more, faster.\n\nBy looking at some of the areas of fastest growth over the past year, we can see how developers are adapting through:\n\n- The programming languages that are growing most in AI-assisted development workflows.\n- The tools that win when speed and reproducibility matter.\n- The areas where new contributors are showing up (and what helps them stick).\n\nRather than catalog trends, we want to focus on what those signals mean for how software is being built today and what choices you might consider heading into 2026.\n\n## The elephant in the room: Typescript is the new #1\n\nIn August 2025, [TypeScript became the most-used language on GitHub](https://github.blog/developer-skills/programming-languages-and-frameworks/7-learnings-from-anders-hejlsberg-the-architect-behind-c-and-typescript/), overtaking Python and JavaScript for the first time. Over the past year, [TypeScript added more than one million contributors](https://github.blog/developer-skills/programming-languages-and-frameworks/typescripts-rise-in-the-ai-era-insights-from-lead-architect-anders-hejlsberg/), which was the largest absolute growth of any language on GitHub.\n\n![A chart showing the top 10 programming languages on GitHub from 2023 to 2025. TypeScript rises to #1 in 2025, overtaking Python and JavaScript, which move to #2 and #3 respectively. Other top languages include Java, C#, PHP, Shell, C++, HCL, and Go. The chart tracks ranking changes over time on a dark background with colored lines representing each language.](https://github.blog/wp-content/uploads/2025/10/octoverse-2025-top-programming-languages.png?resize=1024%2C576)\n\nPython also continued to grow rapidly, adding roughly 850,000 contributors (+48.78% YoY), while JavaScript grew more slowly (+24.79%, ~427,000 contributors). Together, TypeScript and Python both significantly outpaced JavaScript in both total and percentage growth.\n\nThis shift signals more than a preference change. Typed languages are increasingly becoming the default for new development, particularly as AI-assisted coding becomes routine. Why is that?\n\nIn practice, a significant portion of the failures teams encounter with AI-generated code surface as type mismatches, broken contracts, or incorrect assumptions between components. Stronger type systems act as early guardrails: they can help catch errors sooner, reduce review churn, and make AI-generated changes easier to reason about before code reaches production.\n\nIf you’re going to be using AI in your software design, which more and more developers are doing on a daily basis, strongly typed languages are your friend.\n\n**Here’s what this means in practice:**\n\n- If you’re starting a new project today, TypeScript is increasingly becoming the default (especially for teams using AI in daily development).\n- If you’re introducing AI-assisted workflows into an existing JavaScript codebase, adding types may reduce friction more than switching models or tools.\n\n## Python is key for AI\n\nContributor counts show who is using a language. Repository data shows what that language is being used to build.\n\nWhen we look specifically at AI-focused repositories, Python stands apart. As of August 2025, nearly half of all new AI projects on GitHub were built primarily in Python.\n\n![A chart listing the most commonly used programming languages in AI-tagged projects on GitHub in 2025. Python ranks first with 582,000 repositories (+50.7% year over year), followed by JavaScript with 88,000 (+24.8%), TypeScript with 86,000 (+77.9%), Shell with 9,000 (+324%), and C++ with 7,800 (+11%). The chart includes brief descriptions of each language&rsquo;s role in AI development, displayed on a blue gradient background with green geometric ribbon graphics.](https://github.blog/wp-content/uploads/2026/01/GitHub-Octoverse-2025_Most-commonly-used-languages-inside-AI%E2%80%91tagged-repos_1920x1080_2x.png?resize=1024%2C576)\n\nThis matters because AI projects now account for a disproportionate share of open source momentum. Six of the ten fastest-growing open source projects by contributors in 2025 were directly focused on AI infrastructure or tooling.\n\n![A table listing the fastest-growing open source projects on GitHub in 2025 by contributors. The top ten are zen-browser/desktop, cline/cline, vllm-project/vllm, astral-sh/uv, microsoft/vscode, infiniflow/ragflow, sgl-project/sglang, continuedev/continue, comfyanonymous/ComfyUI, and home-assistant/core. Growth rates range from 2,301% to 6,836%, with most projects marked as AI-focused. Displayed on a blue gradient background with the GitHub Octoverse ribbon graphic.](https://github.blog/wp-content/uploads/2025/10/octoverse-2025-fastest-growing-open-source-projects-by-contributors.png?resize=1024%2C576)\n\nPython’s role here isn’t new, but it is evolving. The data suggests a shift from experimentation toward production-ready AI systems, with Python increasingly anchoring packaging, orchestration, and deployment rather than living only in notebooks.\n\nMoreover, Python is likely to continue to grow in 2026, as AI continues to gain support and additional projects.\n\n**Here’s what this means in practice:**\n\n- Python remains the backbone of applied AI work from training and inference to orchestration.\n- Production-focused Python skills such as packaging, typing, CI, and containerization are becoming more important than exploratory scripting alone.\n\n## A deeper look at the top open source projects\n\nLooking across the fastest-growing projects, a clear pattern emerges: developers are optimizing for speed, control, and predictable outcomes.\n\nMany of the fastest-growing tools emphasize performance and minimalism. Projects like [astral-sh/uv](https://github.com/astral-sh/uv), a package and project manager, focus on dramatically faster Python package management. This reflects a growing intolerance for slow feedback loops and non-deterministic environments.\n\nHaving just one of these projects could be an anomaly, but having multiple indicates a clear trend. This trend aligns closely with AI-assisted workflows where iteration speed and reproducibility directly impact developer productivity.\n\n**Here’s what this means in practice:**\n\n- Fast installs and deterministic builds increasingly matter as much as feature depth.\n- Tools that reduce “works on my machine” moments are winning developer mindshare.\n\n## Where first-time open source contributors are showing up\n\nAs the developer population grows, understanding where first-time contributors show up (and why) becomes increasingly important.\n\n![A chart showing the open source projects that attracted the most first-time contributors on GitHub in 2025. The top ten are microsoft/vscode, firstcontributions/first-contributions, home-assistant/core, slackblitz/bolt.new, flutter/flutter, zen-browser/desktop, is-a-dev/register, vllm-project/vllm, comfyanonymous/ComfyUI, and ollama/ollama. Displayed on a blue gradient background with green 3D ribbon graphics.](https://github.blog/wp-content/uploads/2025/10/octoverse-2025-open-source-projects-attracting-most-first-time-contributors.jpg?resize=1024%2C576)\n\nProjects like [VS Code](https://github.com/microsoft/vscode) and [First Contributions](https://github.com/firstcontributions/first-contributions) continued to top the list over the last year, reflecting both the scale of widely used tools and the persistent need for low-friction entry points into open source (notably, we define contributions as any content-generating activity on GitHub).\n\nDespite this growth, basic project governance remains uneven across the ecosystem. README files are common, but contributor guides and codes of conduct are still relatively rare even as first-time contributions increase.\n\nThis gap represents one of the highest-leverage improvements maintainers and open source communities can make. The fact that most of the projects on this list have detailed documentation on what the project is and how to contribute shows the importance of this guidance.\n\n**Here’s what this means in practice:**\n\n- Clear documentation lowers the cost of contribution more than new features.\n- Contributor guides and codes of conduct can help convert curiosity into sustained participation.\n- Improving project hygiene is often the fastest way to grow a contributor base.\n\n## Putting it all together\n\nTaken together, these trends point to a shift in what developers value and how they choose tools.\n\nAI is no longer a separate category of development. It’s shaping the languages teams use, which tools gain traction, and which projects attract contributors.\n\nTyped languages like TypeScript are becoming the default for reliability at scale, while Python remains central to AI-driven systems as they move from prototypes into production.\n\nAcross the ecosystem, developers are rewarding tools that minimize friction with faster feedback loops, reproducible environments, and clearer contribution paths.\n\nDevelopers and teams that optimize for speed, clarity, and reliability are shaping how software is being built.\n\nAs a reminder, you can check out [the full 2025 Octoverse report](https://github.blog/news-insights/octoverse/octoverse-a-new-developer-joins-github-every-second-as-ai-leads-typescript-to-1/) for more information and make your own conclusions. There’s a lot of good data in there, and we’re just scratching the surface of what you can learn from it.",
  "FeedUrl": "https://github.blog/feed/",
  "Author": "Dylan Birtolo",
  "Description": "What languages are growing fastest, and why? What about the projects that people are interested in the most? Where are new developers cutting their teeth? Let’s take a look at Octoverse data to find out.\n\nThe post [What the fastest-growing tools reveal about how software is being built](https://github.blog/news-insights/octoverse/what-the-fastest-growing-tools-reveal-about-how-software-is-being-built/) appeared first on [The GitHub Blog](https://github.blog)."
}
