{
  "FeedLevelAuthor": "Archive: 2026 - GitHub Changelog",
  "Description": "We’ve shipped two improvements to help you enforce repository policies and gain better visibility into rule activity across your organization. Custom properties now support required explicit values Organization and enterprise…\n\nThe post [Custom properties and rule insights improvements](https://github.blog/changelog/2026-02-17-custom-properties-and-rule-insights-improvements) appeared first on [The GitHub Blog](https://github.blog).",
  "Tags": [
    "Improvement",
    "platform governance"
  ],
  "FeedUrl": "https://github.blog/changelog/feed/",
  "PubDate": "2026-02-17T15:35:22+00:00",
  "Author": "Allison",
  "ProcessedDate": "2026-02-17 16:15:54",
  "Title": "Custom properties and rule insights improvements",
  "FeedName": "The GitHub Blog",
  "EnhancedContent": "We’ve shipped two improvements to help you enforce repository policies and gain better visibility into rule activity across your organization.\n\n## Custom properties now support required explicit values\n\n![Screenshot of a custom property configuration with the \"Require explicit user-specified values\" option enabled](https://github.com/user-attachments/assets/e4bd09d6-d317-434c-9a61-f2b5f45d4a6f)\n\nOrganization and enterprise administrators can now require repository creators to explicitly select a value for custom properties, rather than relying on a default value.\n\nThis ensures repositories meet policy requirements from the moment they’re created, improving adoption of rulesets and the accuracy of property data across your organization.\n\nPreviously, the asterisk (`*` ) for custom properties on the repository creation page indicated a required property that accepted a default value. With this update, the asterisk now indicates properties that require an explicit selection so you’ll know exactly which properties need your attention before creating a repository.\n\nLearn more in [our documentation about managing custom properties](https://docs.github.com/organizations/managing-organization-settings/managing-custom-properties-for-repositories-in-your-organization).\n\n## Rule insights now feature enhanced filters with SHA support\n\n![Screenshot of the rule insights page with the new filter bar](https://github.com/user-attachments/assets/ecb96493-7c92-48ac-8e54-600f0cc6ef1a)\n\nWe’ve replaced the rule insights dropdown filters with a dynamic filter bar, delivering a more flexible and consistent filtering experience.\n\nYou can now filter rule insights by commit SHA on the repository-level rule insights page, making it easier to understand how specific commits interacted with rulesets.\n\nLearn more in [our documentation about viewing rule insights](https://docs.github.com/repositories/configuring-branches-and-merges-in-your-repository/managing-rulesets/managing-rulesets-for-a-repository).\n\nJoin the discussion within [GitHub Community](https://github.com/orgs/community/discussions/categories/repositories).",
  "Link": "https://github.blog/changelog/2026-02-17-custom-properties-and-rule-insights-improvements",
  "OutputDir": "_news"
}
