{
  "Tags": [
    "GitHub Policy",
    "News & insights",
    "Policy"
  ],
  "FeedName": "The GitHub Blog",
  "Author": "Mathias Schindler",
  "FeedUrl": "https://github.blog/feed/",
  "EnhancedContent": "At GitHub, we believe that open source is a primary driver of innovation, security, and economic competitiveness. The European Union is currently at a pivotal moment in defining how it supports this ecosystem, and it wants to hear from you, the builders.\n\nThe European Commission is planning to adopt an open source strategy called “[Towards European Open Digital Ecosystems](https://ec.europa.eu/info/law/better-regulation/have-your-say/initiatives/16213-European-Open-Digital-Ecosystems_en)“. This initiative is not about passing new laws; instead the EU is looking to develop a strategic framework and funding measures to help the EU open source sector scale up and become more competitive. This effort aims to strengthen the EU’s technological sovereignty by supporting open source software and hardware across critical sectors like AI, cloud computing, and cybersecurity.\n\nWe’ve been advocating for this kind of support for a long time. For instance, we previously highlighted the [need for a European Sovereign Tech Fund](https://github.blog/open-source/maintainers/we-need-a-european-sovereign-tech-fund/) to invest in the maintenance of critical basic open source technologies such as libraries or programming languages. This new strategy is a chance to turn those kinds of ideas into official EU policy.\n\nYou can read GitHub’s response to the European Commission [here](https://ec.europa.eu/info/law/better-regulation/have-your-say/initiatives/16213-European-Open-Digital-Ecosystems/F33367935_en).  Brand new data from GitHub Innovation Graph shows that the EU is a global open source powerhouse: There are now almost 25 million EU developers on GitHub, who made over 155 million contributions to public projects in the last year alone.\n\nThe EU wants to help European companies turn open source projects into successful businesses, which is an admirable goal with plenty of opportunities to achieve it. For example, the EU can create better conditions for open source businesses by making it easier for them to participate in public procurement and access the growth capital they need to turn great code into sustainable products. By supporting the business models and infrastructure that surround it, the EU can turn its massive developer talent into long-term economic leadership.\n\nIt is important to understand, though, that not all open source projects can be turned into commercial products—and that commercialization is not every developer’s goal. A successful EU open source policy should also support the long-term sustainability of non-commercially produced open source components that benefit us all.\n\nThat is why the European Commission needs to hear the full spectrum of experiences from the community—from individual maintainers, startups, companies, and researchers. Over 900 people have already shared their views, and we encourage you to join them. The European Commission is specifically looking for responses covering these five topics:\n\n1. **Strengths and weaknesses**: What is standing in the way of open source adoption and sustainable open source contributions in the EU?\n2. **Added value**: How does open source benefit the public and private sectors?\n3. **Concrete actions**: What should the EU do to support open source?\n4. **Priority areas**: Which technologies (e.g., AI, IoT, or Cloud) should be the focus?\n5. **Sector impact**: In which industries (e.g., automotive or manufacturing) could open source increase competitiveness and cybersecurity?\n\n## How to Participate\n\nThe “Call for Evidence” is your opportunity to help shape the future tech policy of the EU. It only takes a few minutes to provide your perspective. [Submit your feedback](https://ec.europa.eu/info/law/better-regulation/have-your-say/initiatives/16213-European-Open-Digital-Ecosystems_en) by February 3 (midnight CET). Your voice is essential to ensuring that the next generation of European digital policy is built with the needs of real developers in mind.\n\nAt GitHub Developer Policy, we are always open to feedback from developers. Please do not hesitate to [contact us](https://github.com/about/developer-policy/) as well.",
  "FeedLevelAuthor": "The GitHub Blog",
  "Title": "Help shape the future of open source in Europe",
  "Description": "Read GitHub’s position on the European Open Digital Ecosystem Strategy and learn how to participate.\n\nThe post [Help shape the future of open source in Europe](https://github.blog/news-insights/policy-news-and-insights/help-shape-the-future-of-open-source-in-europe/) appeared first on [The GitHub Blog](https://github.blog).",
  "ProcessedDate": "2026-01-27 15:06:10",
  "PubDate": "2026-01-27T14:16:04+00:00",
  "OutputDir": "_news",
  "Link": "https://github.blog/news-insights/policy-news-and-insights/help-shape-the-future-of-open-source-in-europe/"
}
