{
  "Title": "Hierarchy view now available in GitHub Projects",
  "Description": "Hierarchy view for GitHub Projects is now available in public preview. You can now view your full issue hierarchy directly in project table views, giving you clear visibility into complex…\n\nThe post [Hierarchy view now available in GitHub Projects](https://github.blog/changelog/2026-01-15-hierarchy-view-now-available-in-github-projects) appeared first on [The GitHub Blog](https://github.blog).",
  "Link": "https://github.blog/changelog/2026-01-15-hierarchy-view-now-available-in-github-projects",
  "FeedUrl": "https://github.blog/changelog/feed/",
  "ProcessedDate": "2026-01-15 21:02:45",
  "FeedName": "The GitHub Blog",
  "Tags": [
    "projects & issues",
    "Release"
  ],
  "OutputDir": "_news",
  "EnhancedContent": "Hierarchy view for GitHub Projects is now available in public preview. You can now view your full issue hierarchy directly in project table views, giving you clear visibility into complex work breakdowns without losing context or switching views.\n\n# 🔗 What is hierarchy view?\n\nHierarchy view lets you see the full nesting of sub-issues directly in GitHub Projects.\n\nWith hierarchy view enabled, you can:\n\n- Expand and collapse sub-issues up to eight levels deep.\n- Group, slice, sort, and filter while preserving hierarchy.\n- View and quickly add existing sub-issues that aren’t in the project yet.\n\n## Getting started\n\nTo enable hierarchy view, open the **View** menu and turn on **Show hierarchy**.\n\n## Coming soon\n\nWe’re continuing to invest in hierarchy view. Next up:\n\n- The ability to create and add sub-issues inline, directly from the project.\n- The ability to drag-and-drop reordering and reparenting of sub-issues.\n- A synced order between the sub-issue list on issues and the sub-issue list in projects.\n\n## Tell us what you think\n\nWe’d love your feedback. Join the conversation in [GitHub Community](https://github.com/orgs/community/discussions/184225), or select **Give feedback** from the projects `…` menu to share your thoughts.\n\n# 🚀 Additional improvements to issues and projects\n\n## Performance enhancements to issues\n\nWe’re continuing to make issues faster. This week, we shipped our first performance improvement focused on making recently viewed issues feel instant. Using load times of under 200ms as our benchmark for “instant,” this update increased the percentage of instantly loading issues from 2% to 12%.\n\nThis is the first of several performance improvements planned over the coming months to make working with issues consistently fast.\n\n## Other improvements\n\n- We’ve added a new **View** menu in projects to make it easier to find view display options.\n- There is a new REST API endpoint to [create project views](https://docs.github.com/rest/projects/views?apiVersion=2022-11-28).\n- Pull requests in the merge queue now display their merge queue state icon in projects.\n- You can now paste a pull request URL from the “Development” section of an issue to quickly link items.",
  "FeedLevelAuthor": "Archive: 2026 - GitHub Changelog",
  "PubDate": "2026-01-15T20:19:53+00:00",
  "Author": "Allison"
}
