{
  "Tags": [
    "enterprise management tools",
    "Improvement"
  ],
  "OutputDir": "_news",
  "Description": "Organizations now have more granular control over who can request GitHub Apps and OAuth apps. This enhancement helps you implement stricter governance policies while maintaining flexibility for your security posture.…\n\nThe post [Control who can request apps for your organization now in public preview](https://github.blog/changelog/2025-12-22-control-who-can-request-apps-for-your-organization) appeared first on [The GitHub Blog](https://github.blog).",
  "Author": "Allison",
  "FeedUrl": "https://github.blog/changelog/feed/",
  "ProcessedDate": "2025-12-22 16:02:55",
  "Title": "Control who can request apps for your organization now in public preview",
  "FeedName": "The GitHub Blog",
  "FeedLevelAuthor": "Archive: 2025 - GitHub Changelog",
  "EnhancedContent": "Organizations now have more granular control over who can request GitHub Apps and OAuth apps. This enhancement helps you implement stricter governance policies while maintaining flexibility for your security posture. This capability is now in public preview.\n\n### What’s changed\n\nPreviously, organizations could only disable app access requests from outside collaborators. Now, you can choose from three graduated control options:\n\n- **Members and outside collaborators**: Members and outside collaborators can request apps (existing default behavior).\n- **Members only**: Block outside collaborators from requesting apps while permitting organization members to do so.\n- **Disable app access requests**: Prevent both members and outside collaborators from requesting any apps.\n\n![Three options within an organization's settings page to choose who can request GitHub or OAuth apps](https://github.com/user-attachments/assets/086f553d-0dec-4f8a-aa6a-e513d6384c66)\n\nTo configure this change, navigate to your organization’s settings, select **Member Privileges**, and choose your preferred option under **App access requests**. This new control mechanism ensures all third-party apps go through proper approval channels and security reviews before being considered for installation.\n\nTo learn more, see [“Limiting app requests”](https://docs.github.com/organizations/managing-programmatic-access-to-your-organization/limiting-oauth-app-and-github-app-access-requests). This will be included in GHES 3.21.\n\n### How to give feedback\n\nIf you have any questions or feedback, visit the [GitHub Community](https://github.com/orgs/community/discussions).",
  "PubDate": "2025-12-22T15:02:08+00:00",
  "Link": "https://github.blog/changelog/2025-12-22-control-who-can-request-apps-for-your-organization"
}
