{
  "Author": "Visual Studio Code Team",
  "Tags": [
    "release"
  ],
  "FeedUrl": "https://code.visualstudio.com/feed.xml",
  "PubDate": "2026-01-08T17:00:00+00:00",
  "Description": "Learn what is new in the Visual Studio Code December 2025 Release (1.108).\n\n[Read the full article](https://code.visualstudio.com/updates/v1_108)",
  "FeedName": "Visual Studio Code Releases",
  "OutputDir": "_news",
  "EnhancedContent": "[Version 1.107](/updates) is now available! Read about the new features and fixes from November.\n\nDismiss this update\n\n# December 2025 (version 1.108)\n\n*Release date: January 08, 2026*\n\nDownloads: Windows: [x64](https://update.code.visualstudio.com/1.108.0/win32-x64-user/stable) [Arm64](https://update.code.visualstudio.com/1.108.0/win32-arm64-user/stable) | Mac: [Universal](https://update.code.visualstudio.com/1.108.0/darwin-universal/stable) [Intel](https://update.code.visualstudio.com/1.108.0/darwin/stable) [silicon](https://update.code.visualstudio.com/1.108.0/darwin-arm64/stable) | Linux: [deb](https://update.code.visualstudio.com/1.108.0/linux-deb-x64/stable) [rpm](https://update.code.visualstudio.com/1.108.0/linux-rpm-x64/stable) [tarball](https://update.code.visualstudio.com/1.108.0/linux-x64/stable) [Arm](https://code.visualstudio.com/docs/supporting/faq#_previous-release-versions) [snap](https://update.code.visualstudio.com/1.108.0/linux-snap-x64/stable)\n\nWelcome to the December 2025 release of Visual Studio Code.\n\n![Placeholder for release image](/assets/updates/1_108/release-highlights.webp)\n\nTraditionally, the month of December is a time where our team focuses on cleaning up GitHub issues and pull requests across our repositories. This year, we managed to reduce our open issues by nearly 6,000 and triaged over a thousand more.\n\nIn addition to our housekeeping efforts, we have also made several improvements and feature updates across various areas of VS Code.\n\nHappy Coding!\n\n>\n> If you'd like to read these release notes online, go to [Updates](https://code.visualstudio.com/updates) on [code.visualstudio.com](https://code.visualstudio.com).\n> >\n\n>\n> **Insiders: Want to try new features as soon as possible?**\n>\n> You can download the nightly Insiders build and try the latest updates as soon as they are available.\n>\n> [Download Insiders](https://code.visualstudio.com/insiders)\n> >\n\n## Agents\n\n### Agent Skills (Experimental)\n\n**Setting**: [chat.useAgentSkills](vscode://settings/chat.useAgentSkills)\n\nVS Code now supports **Agent Skills**, allowing you to teach the coding agent new capabilities and provide domain-specific knowledge. Agent Skills are folders of instructions, scripts, and resources that GitHub Copilot can load when relevant to perform specialized tasks.\n\nSkills are stored in directories with a `SKILL.md` file that defines the skill's behavior. VS Code automatically detects skills from the `.github/skills` folder in your workspace (or `.claude/skills/` for backwards compatibility). They are then loaded on-demand into the chat context when relevant for your request.\n\nEnable support for Agent Skills by enabling the [chat.useAgentSkills](vscode://settings/chat.useAgentSkills) setting.\n\nLearn more about creating and using skills in the [Agent Skills documentation](https://code.visualstudio.com/docs/copilot/customization/agent-skills).\n\n### Improvements to Agent Sessions view\n\nThis iteration, we further improved the Agent Sessions view with several enhancements:\n\n- Keyboard access support for actions such as archive, read state, opening a session\n- Grouping of sessions based on state and age when showing side-by-side\n- Provide information on changed files and associated PRs for a session\n- Support for archiving multiple sessions at once from the new group sections\n- General accessibility improvements\n\n![Screenshot of the Agent Sessions view showing changed files and associated pull requests for sessions.](/assets/updates/1_108/agentsessions.png)\n\n>\n> **Note**: [chat.viewSessions.orientation](vscode://settings/chat.viewSessions.orientation) no longer provides the `auto`\n> option. Use `sideBySide`\n> as alternative.\n> >\n\n## Chat\n\n### Chat picker is based on agent sessions\n\nThe Quick Pick for chat sessions is now based on the same information that drives the Agent Sessions view. You can access any previous chat session from there and perform actions like archiving, renaming or deletion.\n\n![Screenshot of the chat Quick Pick showing a list of agent sessions.](/assets/updates/1_108/agentpicker.png)\n\n>\n> **Note**: Agent sessions can also be accessed by typing `agent `\n> in the Quick Open control (⌘P (Windows, Linux Ctrl+P)).\n> >\n\n### Chat title improvements\n\nThe Chat view title control is now showing up, irrespective of how the Activity Bar is configured. Previously, it only showed up in the default Activity Bar configuration.\n\nTo quickly jump from one session to another, select the chat title to open the sessions Quick Pick and choose another session.\n\n![Screenshot of the chat title control.](/assets/updates/1_108/agentittle.png)\n\n### Open empty Chat on restart\n\n**Setting**: [chat.viewRestorePreviousSession](vscode://settings/chat.viewRestorePreviousSession)\n\nFrom now on, previous chat sessions are not automatically restored when VS Code is restarted. Instead, an empty Chat view is shown where you can then access previous sessions from the Agent Sessions control.\n\nModify this behavior with the [chat.viewRestorePreviousSession](vscode://settings/chat.viewRestorePreviousSession) setting.\n\n### Terminal tool auto approve default rules\n\n**Settings**: [chat.tools.terminal.enableAutoApprove](vscode://settings/chat.tools.terminal.enableAutoApprove), [chat.tools.terminal.autoApproveWorkspaceNpmScripts](vscode://settings/chat.tools.terminal.autoApproveWorkspaceNpmScripts)\n\nThe following commands are now auto approved by default when terminal auto approve is enabled ([chat.tools.terminal.enableAutoApprove](vscode://settings/chat.tools.terminal.enableAutoApprove)):\n\n- `git ls-files`\n- `git --no-pager <safe_subcommand>`\n- `git -C <dir> <safe_subcommand>`\n- `rg`\n(excluding `--pre` and `--hostname-bin` )\n- `sed`\n(excluding some args and usage patterns)\n- `Out-String`\n\nIn addition, npm scripts run through `npm` , `pnpm` or `yarn` are now auto approved by default when they are included within the `package.json` . We do this because using agents already requires Workspace Trust, and we protect agents from editing sensitive files like `package.json` . This can be disabled with [chat.tools.terminal.autoApproveWorkspaceNpmScripts](vscode://settings/chat.tools.terminal.autoApproveWorkspaceNpmScripts).\n\nTo improve transparency around auto approve, there is now an informational message when a rule was explicitly denied by either default or custom rules:\n\n![Auto approval denied by rule will show after a denial](/assets/updates/1_108/terminal-tool-deny.png)\n\n### Add session and workspace rules for future terminal tool commands\n\nThe allowed commands or command line entries in the Allow dropdown now have options a corresponding action to allow them for the current session or for the workspace.\n\n![Screenshot of the Allow dropdown in the Terminal tool showing options to allow commands for the current session or workspace.](/assets/updates/1_108/terminal-tool-allow-dropdown.png)\n\n### Terminal tool preventing adding to shell history\n\n**Setting**: [chat.tools.terminal.preventShellHistory](vscode://settings/chat.tools.terminal.preventShellHistory)\n\nWhen shell integration is enabled and working, commands that are run by the terminal tool are no longer included in shell history for bash, zsh, pwsh and fish. The method this uses differs for each shell, for bash for example `HISTCONTROL=ignorespace` is set and a space is added to the start of the command being run.\n\nIf you prefer to keep terminal tool commands in the shell history, configure this with the [chat.tools.terminal.preventShellHistory](vscode://settings/chat.tools.terminal.preventShellHistory) setting.\n\n## Accessibility\n\n### Streaming chat responses in Accessible View\n\nThe Accessible View now dynamically streams chat responses as they are generated. Previously, you needed to close and reopen the Accessible View to see updated content. Now, you can stay in the Accessible View and monitor output as it comes in, making it much easier to follow along with AI responses in real-time.\n\n### MCP server output excluded from Accessible View\n\nTo reduce noise, MCP (Model Context Protocol) server output is now excluded from the Accessible View by default. The standard chat output remains fully accessible, as it's presented in a text area that works well with screen readers.\n\n### Language ID variable in window title\n\nA new `${activeEditorLanguageId}` variable is now available for the [window.title](vscode://settings/window.title) setting. This variable displays the language identifier of the currently active editor, which is useful for accessibility tools like Talon that need to determine the current programming language to enable appropriate voice commands.\n\n``` \"window.title\": \"${activeEditorLanguageId} - ${activeEditorShort}\"\n\n```\n\n## Editor Experience\n\n### Import profile by drag and drop\n\nYou can now import a settings profile by dragging and dropping a `.code-profile` file into VS Code. This makes it easier to share profiles with teammates or quickly set up a new environment.\n\nWhen you drop the file, the Profiles editor opens and lets you preview and import the profile. This provides a similar experience to dragging and dropping a `.code-workspace` file to open a workspace.\n\n### Copy breadcrumbs path\n\n**Setting**: [breadcrumbs.symbolPathSeparator](vscode://settings/breadcrumbs.symbolPathSeparator)\n\nYou can now copy the breadcrumbs path to the clipboard by using the **Copy Breadcrumbs Path** command. This is useful when you need to share the exact location of a symbol with your team or for documentation purposes.\n\n![Screenshot of the Copy Breadcrumbs Path command.](/assets/updates/1_108/breadcrumbs_copy_path.png)\n\nThe [breadcrumbs.symbolPathSeparator](vscode://settings/breadcrumbs.symbolPathSeparator) setting enables you to customize the separator character used to join breadcrumb segments.\n\n### Go to Symbol in Workspace supports special characters in query\n\nThe **Go to Symbol in Workspace** (⌘T (Windows, Linux Ctrl+T)) feature no longer incorrectly filters out all results when the search query contains a `#` character.\n\nThis fix enables language extensions like rust-analyzer to use `#` as a modifier in symbol searches. For example, in rust-analyzer, appending `#` to a query like `main#` searches for functions in current workspace only.\n\n## Code Editing\n\n### New snippet tranformations\n\nThere are two new snippet transformations available: `snakecase` and `kebabcase` . This is how you can use them:\n\nFor snake\\_case transformation:\n\n``` ${TM_FILENAME/(.*)/${1:/snakecase}/}\n\n```\n\nThis transforms the filename to snake-case format. For example, from `MyFileName.txt` it makes `my_file_name.txt` . The kebab-case transformation would be `my-file-name.txt` .\n\n## Source Control\n\n### Git blame information settings\n\n**Settings**: [git.blame.ignoreWhitespace](vscode://settings/git.blame.ignoreWhitespace), [git.blame.editorDecoration.disableHover](vscode://settings/git.blame.editorDecoration.disableHover)\n\nThe new [git.blame.ignoreWhitespace](vscode://settings/git.blame.ignoreWhitespace) setting enables you to configure Git blame to ignore whitespace changes when determining which commit last modified a line. This is particularly useful when working with code that has been reformatted, as it helps you identify the commit that made the actual functional change rather than just whitespace adjustments.\n\nAdditionally, the [git.blame.editorDecoration.disableHover](vscode://settings/git.blame.editorDecoration.disableHover) setting lets you disable the hover tooltip that appears when you hover over a Git blame editor decoration. This can be useful if you prefer a cleaner editing experience and only want to see the inline blame annotations without the additional hover information.\n\n### Authoring commit messages using the editor\n\nSome time ago we added the capability to use the full editor to [author a commit message](https://code.visualstudio.com/docs/sourcecontrol/staging-commits#_use-the-editor-for-commit-messages) but the actions to commit or cancel were difficult to discover in the editor title toolbar. We improved the editor overlay control in the lower right-hand corner of the editor and moved these actions there to make them easier to use.\n\n### Worktrees in the Source Control Repositories view (Experimental)\n\n**Settings**: [scm.repositories.explorer](vscode://settings/scm.repositories.explorer), [scm.repositories.selectionMode](vscode://settings/scm.repositories.selectionMode)\n\nThis milestone, we have added a **Worktrees** node to the Source Control Repositories view. Under this node, you can see the list of the repository worktrees with an inline action to open the worktree in a new window. The context menu also contains an action to open the worktree in the current window, as well as an action to delete the worktree.\n\n![Screenshot showing the Worktrees node in the Source Control Repositories view with a list of worktrees](/assets/updates/1_108/repository-explorer-worktrees.png)\n\nYou can enable the experimental repository explorer by setting the [scm.repositories.selectionMode](vscode://settings/scm.repositories.selectionMode) and [scm.repositories.explorer](vscode://settings/scm.repositories.explorer) settings. Give it a try and let us know what other repository artifacts you would like to see in the Repositories explorer.\n\nLearn more about [using source control in VS Code](https://code.visualstudio.com/docs/sourcecontrol/overview).\n\n## Terminal\n\n### Terminal IntelliSense default UX rework\n\nDuring the past two releases, we rolled out terminal IntelliSense to all VS Code Stable users. While much of the feedback was positive, there was a segment of users (mostly terminal power users) that did not like the feature breaking their muscle memory. After a lot of discussion, we decided to switch some defaults, improve discoverability and allow easier inline configuration of the feature.\n\nThe feature itself is still enabled by default, but instead of showing the control automatically when typing (quick suggestions and suggest on trigger characters), it now needs to be explicitly triggered via Ctrl+Space.\n\nWe also improved the \"status bar\" on the bottom. Previously, it showed insert on the left and Learn more/Configure on the right with their associated keybindings. We got feedback that it's not clear that these can be interacted with, so we now show icons on the right and no longer show the keybindings. The left action now allows rotating through the options for \"selection mode\", which determines how Tab and Enter react when it's brought up. There's a new eye icon on the right, which enables quick suggestions and suggest on trigger characters again.\n\n![Screenshot of the suggest status bar showing buttons to configure selection mode and whether to show suggestions on type.](/assets/updates/1_108/terminal-suggest.png)\n\nFinally, to still make this powerful feature relatively discoverable without being overbearing, a hint shows when opening a terminal that explains how to show suggestions. The lifecycle of the hint is simplified and it's as easy as clicking \"don't show\" to get rid of it permanently, just like the similar feature in the editor.\n\n![Screenshot of the hint that shows when opening a terminal now explains how to trigger &quot;show suggestions&quot;.](/assets/updates/1_108/terminal-initial-hint.png)\n\nBeyond this UX rework, these improvements were also done to terminal IntelliSense:\n\n- We now show files with the executable bit on macOS/Linux\n- Improved completions for `npm`\nand `git`\n- Several fixes to the feature\n\n### Performance and stability improvements\n\nThe terminal saw several important performance and stability improvements this release:\n\n- [node-pty#831](https://github.com/microsoft/node-pty/pull/831): On macOS and Linux, pasting more than 50 characters at once or having Copilot run a large command is no longer throttled and should apply essentially instantly, scaling similarly to other terminals with KBs/MBs of data. This also fixed a crash that could happen on macOS when doing the same thing.\n- [vscode#285031](https://github.com/microsoft/vscode/issues/285031), [vscode#285032](https://github.com/microsoft/vscode/issues/285032), [xterm.js#5548](https://github.com/xtermjs/xterm.js/issues/5548): Fixed several layout thrashing issues that could cause the editor to get laggy.\n- [vscode#239541](https://github.com/microsoft/vscode/issues/239541): Fixed a crash that could occur when fonts such as CommitMono were configured in the terminal.\n\n### More comprehensive custom glyphs\n\nThe terminal's GPU accelerated renderer (on by default) has supported custom glyphs for some time for box drawing, block element, and a subset of powerline symbols. This means that you can see these characters without needing to configure a font and they also scale with line height, letter spacing, and should align with each other perfectly.\n\nIn this release, we expanded the number of characters supported to almost 800 by including the majority of custom glyphs supported by any other terminal. This includes ranges that are generally useful in a terminal, specifically these ranges:\n\n- Box Drawing (`U+2500`\n-`U+257F` )\n- Block Elements (`U+2580`\n-`U+259F` )\n- Braille Patterns (`U+2800`\n-`U+28FF` )\n- Powerline Symbols (`U+E0A0`\n-`U+E0D4` , Private Use Area)\n- Progress Indicators (`U+EE00`\n-`U+EE0B` , Private Use Area)\n- Git Branch Symbols (`U+F5D0`\n-`U+F60D` , Private Use Area)\n- Symbols for Legacy Computing (`U+1FB00`\n-`U+1FBFF` )\n\nHere's a visual of the complete set of glyphs:\n\n![Screenshot of the complete set of about 800 custom glyphs now rendered without needing a font.](/assets/updates/1_108/terminal-custom-glyphs.png)\n\n### Improved rendering of curly underlines\n\nVS Code has been able to parse and display [colored and styled underlines](https://sw.kovidgoyal.net/kitty/underlines/) for some time now, but the curly underline's rendering always left something to be desired. The curly underlines should now look very close to how they look in the editor.\n\n![Screenshot of the terminal curly underline which is a lot more vivid now and has a zigzag look like in the editor.](/assets/updates/1_108/terminal-curly-underline.png)\n\nYou can try this out for yourself by running this command in bash: `echo -e '\\x1b[4:3mCurly\\x1b[0m \\x1b[4:3m\\x1b[58;5;1mRed\\x1b[0m'`\n\n### Dimensions visual overlay on resize\n\nInspired by a feature in [ghostty](https://github.com/ghostty-org/ghostty), we added a brief overlay that shows the current terminal dimensions (columns x rows) when you resize the terminal. This is useful if you want to resize your terminal to a specific size for testing or other purposes.\n\n![Screenshot of the overlay that appears in the middle of the terminal with the current columns and rows when a terminal resize happens.](/assets/updates/1_108/terminal-resize-overlay.png)\n\n### New VT features\n\nThe terminal now supports the follow VT features/sequences:\n\n- [Synchronized output](https://github.com/microsoft/vscode/issues/284592): can be used by applications to pause rendering and batch updates in the terminal, which is particularly useful to prevent tearing when rewriting the buffer.\n\n- DECRQM (`CSI ? 2026 $ p`\n)\n- BSU (`CSI ? 2026 h`\n)\n- ESU (`CSI ? 2026 l`\n)\n- [XTVERSION](https://github.com/microsoft/vscode/issues/285138) (`CSI > 0 q`\n): allows applications to query details about the terminal, the response VS Code will give currently is the \"xterm.js\" and its version\n\n## Debug\n\n### Organize Breakpoints by File\n\nBreakpoints can now be shown as a tree, group by their file, using the setting [debug.breakpointsView.presentation](vscode://settings/debug.breakpointsView.presentation).\n\n![](/assets/updates/1_108/debug-bp-tree.png)\n\n## Testing\n\n### Navigate to uncovered regions\n\nWe've added navigation buttons to the test coverage toolbar that allow you to easily jump between regions of uncovered code.\n\n![](/assets/updates/1_108/coverage-navigation.png)\n\nYou can toggle the test coverage toolbar using the **Test: Show Coverage Toolbar** command.\n\n## Contributions to extensions\n\n### GitHub Pull Requests\n\nThere has been more progress on the [GitHub Pull Requests](https://marketplace.visualstudio.com/items?itemName=GitHub.vscode-pull-request-github) extension, which enables you to work on, create, and manage pull requests and issues. New features include:\n\n- Change a pull request's base branch from the pull request description webview.\n- Convert open pull requests to draft from the pull request description webview.\n- Generate a pull request description for an existing PR, not just new ones.\n\nReview the [changelog for the 0.126.0](https://github.com/microsoft/vscode-pull-request-github/blob/main/CHANGELOG.md#01260) release of the extension to learn about everything in the release.\n\n## Extension Authoring\n\n### New Quick Pick properties for prompts and resource URIs\n\nThe Quick Pick API includes two new properties for creating interactive selection interfaces.\n\nUse the `prompt` property on `QuickPick` to display persistent instructional text beneath the input box. The text remains visible while users type, which helps provide guidance or context.\n\n``` const quickPick = vscode.window.createQuickPick(); quickPick.prompt = 'Select a file to open'; quickPick.items = items; quickPick.show();\n\n```\n\nUse the `resourceUri` property on `QuickPickItem` to automatically derive item properties from a resource URI. When provided, VS Code derives:\n\n- The `label`\nfrom the file name (when set to an empty string)\n- The `description`\nfrom the file path (when set to `undefined` or an empty string)\n- The `icon`\nfrom the current file icon theme (when `iconPath` is set to `ThemeIcon.File` or `ThemeIcon.Folder` )\n\nThis is useful when building file or folder selection interfaces.\n\n``` const items: vscode.QuickPickItem[] = [ { label: '', resourceUri: vscode.Uri.file('/path/to/app.ts'), iconPath: vscode.ThemeIcon.File }, { label: '', resourceUri: vscode.Uri.file('/path/to/src'), iconPath: vscode.ThemeIcon.Folder } ];\n\n```\n\n## Engineering\n\n### Housekeeping\n\nAs part of our annual December housekeeping, we spent a majority of time cleaning up GitHub issues and pull requests across all our maintained repositories. This year, we managed to **reduce our open issues by 5,951 and triaged another 1,203 issues**.\n\n![Graph showing the overall issues for all VS Code managed repositories.](/assets/updates/1_108/combined-graph.png)\n\n![Graph showing the total amount of open issues closed during housekeeping.](/assets/updates/1_108/issue-reduction.png)\n\n![Graph showing the total amount of unknown issues triaged during housekeeping (excluding closed issues).](/assets/updates/1_108/unknown-reduction.png)\n\nBy using improved triage tooling and deduplication processes, we were able to close a significant number of stale and resolved issues. This has left us with a more manageble project, enabling us to move forward and develop the features that have the most impact for our users. In our core VS Code repository alone, we closed 2,872 issues and triaged another 1,697!\n\n![Issue graph for microsoft/vscode.](/assets/updates/1_108/vscode-graph.png)\n\nIn June of 2025, we also announced that Copilot had become Open Source! This meant that all related issues would also be filed in the microsoft/vscode repo, and that we had a backlog of issues remaining in microsoft/vscode-copilot-release to take care of. This month, we triaged every issue in the repository and closed 1,659 issues, leaving only 175 open to be migrated.\n\n![Issue graph for microsoft/vscode-copilot-release.](/assets/updates/1_108/vscode-copilot-release-graph.png)\n\nBelow is a graph that shows how our core vscode repository has grown over the years, and how many issues our amazing community has contributed over time. We appreciate everyone who has contributed issues to our repositories over the years and continued to engage with us. Your feedback is what has made VS Code the product that it is today! 🚀\n\n![Graph showing historical issue data for microsoft/vscode from 2018 to present.](/assets/updates/1_108/historical-vscode-graph.png)\n\n### Authoring extensions in TypeScript (Experimental)\n\nIt is now possible to author VS Code extensions directly in TypeScript without requiring a build step. This works... but there is still a bit of adventure involved! Many aspects are still untested, such as how to write and run tests, how to publish extensions, and other workflow considerations.\n\nLearn more about this experimental approach in [this GitHub comment](https://github.com/microsoft/vscode/issues/263558#issuecomment-3656380346).\n\n## Notable fixes\n\n- [vscode#283356](https://github.com/microsoft/vscode/issues/283356) - Fixed regression causing jumping around while scrolling past some chat output\n\n## Thank you\n\nContributions to `vscode` :\n\n- [@abhijit-chikane (Abhijit Chikane)](https://github.com/abhijit-chikane): fix: hover focus border cutting at the corners [PR #259548](https://github.com/microsoft/vscode/pull/259548)\n- [@alievilshat (Ilshat Aliyev)](https://github.com/alievilshat): Fixed wrong negation in the \\_shouldRenderHint logic. [PR #242479](https://github.com/microsoft/vscode/pull/242479)\n- [@Andarist (Mateusz Burzyński)](https://github.com/Andarist): Simplify `TestInstantiationService#stub`\noverloads [PR #282223](https://github.com/microsoft/vscode/pull/282223)\n- [@anki-code (Andy Kipp)](https://github.com/anki-code): Added Xonsh shell type [PR #284044](https://github.com/microsoft/vscode/pull/284044)\n- [@aryla (Arttu Ylä-Outinen)](https://github.com/aryla): Fix sticky scroll hover listeners piling up [PR #260020](https://github.com/microsoft/vscode/pull/260020)\n- [@AviVahl (Avi Vahl)](https://github.com/AviVahl): fix: ensure fallback to default system monospace font [PR #282747](https://github.com/microsoft/vscode/pull/282747)\n- [@BartolHrg](https://github.com/BartolHrg): fix copy with multiple cursors and empty selections [PR #256083](https://github.com/microsoft/vscode/pull/256083)\n- [@Beace (Beace)](https://github.com/Beace): fix: fix terminal webgl context memory leak [PR #279579](https://github.com/microsoft/vscode/pull/279579)\n- [@bibaswan-bhawal (Bibaswan Bhawal)](https://github.com/bibaswan-bhawal): fix(extensions): allow extensionButton.prominentBackground to take effect [PR #276788](https://github.com/microsoft/vscode/pull/276788)\n- [@chaitanyamedidar (Chaitanya Medidar)](https://github.com/chaitanyamedidar): Fix Swipe to navigate setting missing description #281997 [PR #282220](https://github.com/microsoft/vscode/pull/282220)\n- [@CyMad7001 (Cyril Madigan)](https://github.com/CyMad7001): #196344 - Fix installer hang issue [PR #228233](https://github.com/microsoft/vscode/pull/228233)\n- [@daiyam (Baptiste Augrain)](https://github.com/daiyam): fix: correctly pass extension's id when version is also provided [PR #279630](https://github.com/microsoft/vscode/pull/279630)\n- [@eidriahn (Adrian Luca)](https://github.com/eidriahn): fix: fixes icons not showing when hovering quick pick checkboxes [PR #285250](https://github.com/microsoft/vscode/pull/285250)\n- [@erezak (Erez Korn)](https://github.com/erezak): Chat: hide Apply in Editor from Command Palette [PR #283486](https://github.com/microsoft/vscode/pull/283486)\n- [@flying-sheep (Philipp A.)](https://github.com/flying-sheep): fix: set LANGUAGE for Git [PR #285410](https://github.com/microsoft/vscode/pull/285410)\n- [@gjsjohnmurray (John Murray)](https://github.com/gjsjohnmurray): Standardize the breadcrumb toggle option label (fix #257550) [PR #284486](https://github.com/microsoft/vscode/pull/284486)\n- [@hickford (M Hickford)](https://github.com/hickford): Reverse lines: apply to whole document when selection is single line [PR #257031](https://github.com/microsoft/vscode/pull/257031)\n- [@irengrig (Irina Chernushina)](https://github.com/irengrig): Fix memory leak with installing cursor change position listener [PR #267799](https://github.com/microsoft/vscode/pull/267799)\n- [@isksss (isksss)](https://github.com/isksss): Update: Fixed so that MARK can be used in vue files etc. [PR #283583](https://github.com/microsoft/vscode/pull/283583)\n- [@izolotarev (Igor)](https://github.com/izolotarev): Fix color detection in hsl saturation [PR #266720](https://github.com/microsoft/vscode/pull/266720)\n- [@jakebailey (Jake Bailey)](https://github.com/jakebailey): Replace old-style TS modules with namespaces [PR #282862](https://github.com/microsoft/vscode/pull/282862)\n- [@jcpetruzza (Daniel Gorin)](https://github.com/jcpetruzza): debug: Fix UI freezing on \"continue\" with high number of threads [PR #283635](https://github.com/microsoft/vscode/pull/283635)\n- [@JeffreyCA](https://github.com/JeffreyCA): Update Fig spec for Azure Developer CLI (azd) [PR #281127](https://github.com/microsoft/vscode/pull/281127)\n- [@joeriddles (Joe Riddle)](https://github.com/joeriddles): Add snakecase to snippets syntax [PR #237110](https://github.com/microsoft/vscode/pull/237110)\n- [@josephxiao8 (Joseph Xiao)](https://github.com/josephxiao8): Expected Final Selection After Running Delete Duplicate Lines [PR #234799](https://github.com/microsoft/vscode/pull/234799)\n- [@junhaoliao (Junhao Liao)](https://github.com/junhaoliao): Suppress unhandled errors in WordHighlighter's runDelayer triggers. [PR #285887](https://github.com/microsoft/vscode/pull/285887)\n- [@kheif (Mehmet Ege Aydın)](https://github.com/kheif): workbench: add commands to move editor to start and end [PR #284999](https://github.com/microsoft/vscode/pull/284999)\n- [@kortin99 (Kortin Zhou)](https://github.com/kortin99): feat(snippets): add support for kebab-case in snippets tmLanguage syntax [PR #222319](https://github.com/microsoft/vscode/pull/222319)\n- [@maynkxx (mayank choudhary)](https://github.com/maynkxx): docs: update Twitter branding to X in README [PR #280235](https://github.com/microsoft/vscode/pull/280235)\n- [@milanchahar (MILAN CHAHAR)](https://github.com/milanchahar): Fix terminal icon picker placement [PR #281275](https://github.com/microsoft/vscode/pull/281275)\n- [@mizdra (mizdra)](https://github.com/mizdra): Fix tests that failed in environments where `XDG_DATA_HOME`\nis set [PR #285402](https://github.com/microsoft/vscode/pull/285402)\n- [@MohamedEmirHajji (Mohamed Emir HAJJI)](https://github.com/MohamedEmirHajji)\n- Add more git log options to completions [PR #282311](https://github.com/microsoft/vscode/pull/282311)\n- Markdown preview: filter hidden elements from scroll sync (fix #281247) [PR #282506](https://github.com/microsoft/vscode/pull/282506)\n- [@murataslan1 (Murat Aslan)](https://github.com/murataslan1)\n- fix: avoid jumpy scrolling when navigating next/prev problem [PR #285634](https://github.com/microsoft/vscode/pull/285634)\n- Fix: Replace terminal tabbed view lifecycle hack with Event.once [PR #285657](https://github.com/microsoft/vscode/pull/285657)\n- Fix: Replace terminal view lifecycle hack with Event.once [PR #285661](https://github.com/microsoft/vscode/pull/285661)\n- [@NriotHrreion (Norcleeh)](https://github.com/NriotHrreion): fix: Latest input is not stored to the history when sending message to a new chat [PR #282633](https://github.com/microsoft/vscode/pull/282633)\n- [@odinGitGmail (odinsam)](https://github.com/odinGitGmail): fix(debug): support C# stack trace format in debug console links [PR #281536](https://github.com/microsoft/vscode/pull/281536)\n- [@przpl](https://github.com/przpl): fix(runSubagent): collect computed attachments [PR #283750](https://github.com/microsoft/vscode/pull/283750)\n- [@rducom (Raphael DUCOM)](https://github.com/rducom): Fix ReDoS in PowerShell prompt detection [PR #279853](https://github.com/microsoft/vscode/pull/279853)\n- [@RedCMD (RedCMD)](https://github.com/RedCMD)\n- Add TS/JS Template surrounding brackets [PR #255972](https://github.com/microsoft/vscode/pull/255972)\n- Fix php indenting #248229 [PR #258016](https://github.com/microsoft/vscode/pull/258016)\n- Fix FormatOnSave when `modificationsIfAvailable`\n[PR #283726](https://github.com/microsoft/vscode/pull/283726)\n- Support `# pragma`\nfolding markers in C [PR #284927](https://github.com/microsoft/vscode/pull/284927)\n- [@remcohaszing (Remco Haszing)](https://github.com/remcohaszing): Fix editor edge clicking [PR #262964](https://github.com/microsoft/vscode/pull/262964)\n- [@Riya-chandra (RIYA_CHANDRA)](https://github.com/Riya-chandra): Show command descriptions as tooltips in Command Palette [PR #284609](https://github.com/microsoft/vscode/pull/284609)\n- [@SalerSimo (Simone Salerno)](https://github.com/SalerSimo)\n- Exclude terminal editors from recently closed editors history [PR #282009](https://github.com/microsoft/vscode/pull/282009)\n- Refactor virtual model creation logic in MoveLinesCommand [PR #284785](https://github.com/microsoft/vscode/pull/284785)\n- [@SimonSiefke (Simon Siefke)](https://github.com/SimonSiefke)\n- fix: memory leak in terminal editor [PR #279088](https://github.com/microsoft/vscode/pull/279088)\n- fix: memory leak in terminal process [PR #279167](https://github.com/microsoft/vscode/pull/279167)\n- fix: memory leak in terminal process [PR #279172](https://github.com/microsoft/vscode/pull/279172)\n- fix: memory leak in accessibility signal [PR #279242](https://github.com/microsoft/vscode/pull/279242)\n- fix: memory leak in local process extension host [PR #279351](https://github.com/microsoft/vscode/pull/279351)\n- fix: memory leak in extension icon widget [PR #280566](https://github.com/microsoft/vscode/pull/280566)\n- fix: memory leak in markdown hover [PR #280745](https://github.com/microsoft/vscode/pull/280745)\n- fix: memory leak in debug session [PR #281767](https://github.com/microsoft/vscode/pull/281767)\n- fix: memory leak in status bar [PR #282246](https://github.com/microsoft/vscode/pull/282246)\n- fix: memory leak in ipc [PR #282253](https://github.com/microsoft/vscode/pull/282253)\n- fix: memory leak in chat list renderer [PR #282560](https://github.com/microsoft/vscode/pull/282560)\n- fix: memory leak in notebook code scrolling [PR #283452](https://github.com/microsoft/vscode/pull/283452)\n- fix: memory leak in terminal find widget [PR #283466](https://github.com/microsoft/vscode/pull/283466)\n- fix: memory leak in mainThreadLanguages [PR #283498](https://github.com/microsoft/vscode/pull/283498)\n- fix: memory leak in chat widget [PR #284288](https://github.com/microsoft/vscode/pull/284288)\n- fix: memory leak in terminal chat widget [PR #284325](https://github.com/microsoft/vscode/pull/284325)\n- fix: memory leak call stack widget [PR #286246](https://github.com/microsoft/vscode/pull/286246)\n- [@sudip-kumar-prasad (Sudip Kumar Prasad)](https://github.com/sudip-kumar-prasad): Fix: use codicon id for Command Prompt default profile icon [PR #280967](https://github.com/microsoft/vscode/pull/280967)\n- [@tamuratak (Takashi Tamura)](https://github.com/tamuratak)\n- fix: ensure finishedEditing is called in ChatWidget [PR #281763](https://github.com/microsoft/vscode/pull/281763)\n- include uppercase `-I`\nin sed in-place option detection [PR #284645](https://github.com/microsoft/vscode/pull/284645)\n- Fix context handling in ChatWidget while re-editing [PR #285099](https://github.com/microsoft/vscode/pull/285099)\n- [@ThanhNguyxn (Thanh Nguyen)](https://github.com/ThanhNguyxn): fix: Panel doesn't close when maximized and center-aligned (fixes #281772) [PR #281773](https://github.com/microsoft/vscode/pull/281773)\n- [@tharani-2006](https://github.com/tharani-2006): Terminal: show dimensions overlay while resizing [PR #284244](https://github.com/microsoft/vscode/pull/284244)\n- [@tt0mmy (Tommy)](https://github.com/tt0mmy): Fix duplicate description in terminal suggestion config [PR #279730](https://github.com/microsoft/vscode/pull/279730)\n- [@yavanosta (Dmitry Guketlev)](https://github.com/yavanosta)\n- Fix backward selection when EditContext is off [PR #273150](https://github.com/microsoft/vscode/pull/273150)\n- InlineEditsView: remove redeclaration of textModel [PR #281501](https://github.com/microsoft/vscode/pull/281501)\n- SingleUpdatedNextEdit: Correctly apply insertion changes [PR #281519](https://github.com/microsoft/vscode/pull/281519)\n\nContributions to `vscode-copilot-chat` :\n\n- [@AbdelrahmanAbouelenin (ababouelenin)](https://github.com/AbdelrahmanAbouelenin): Update system prompt for VSCModelB. [PR #2727](https://github.com/microsoft/vscode-copilot-chat/pull/2727)\n- [@bharatvansh (Ayush Singh)](https://github.com/bharatvansh): fix(byok): improve Gemini provider error handling and add tests [PR #2686](https://github.com/microsoft/vscode-copilot-chat/pull/2686)\n\nContributions to `vscode-js-profile-visualizer` :\n\n- [@xiaoxiangmoe (ZHAO Jin-Xiang)](https://github.com/xiaoxiangmoe): chore: remove useless package-lock.json files [PR #216](https://github.com/microsoft/vscode-js-profile-visualizer/pull/216)\n\n### Issue tracking\n\nContributions to our issue tracking:\n\n- [@gjsjohnmurray (John Murray)](https://github.com/gjsjohnmurray)\n- [@RedCMD (RedCMD)](https://github.com/RedCMD)\n- [@tamuratak (Takashi Tamura)](https://github.com/tamuratak)\n- [@IllusionMH (Andrii Dieiev)](https://github.com/IllusionMH)\n- [@albertosantini (Alberto Santini)](https://github.com/albertosantini)\n\nWe really appreciate people trying our new features as soon as they are ready, so check back here often and learn what's new.\n\n>\n> If you'd like to read release notes for previous VS Code versions, go to [Updates](https://code.visualstudio.com/updates) on [code.visualstudio.com](https://code.visualstudio.com).\n> >",
  "Title": "December 2025 (version 1.108)",
  "FeedLevelAuthor": "Visual Studio Code - Code Editing. Redefined.",
  "Link": "https://code.visualstudio.com/updates/v1_108",
  "ProcessedDate": "2026-01-08 19:03:26"
}
