{
  "Link": "https://code.visualstudio.com/blogs/2025/04/07/agentMode",
  "ProcessedDate": "2025-08-24 16:20:38",
  "PubDate": "2025-04-07T00:00:00+00:00",
  "FeedLevelAuthor": "Visual Studio Code - Code Editing. Redefined.",
  "Title": "Agent mode: available to all users and supports MCP",
  "FeedUrl": "https://code.visualstudio.com/feed.xml",
  "EnhancedContent": "Try [MCP servers](/mcp) to extend agent mode in VS Code!\n\nDismiss this update\n\n# Agent mode: available to all users and supports MCP\n\nApril 7th, 2025 by [Isidor Nikolic](https://github.com/isidorn)\n\nAgent mode is rolling out to all VS Code users! The agent acts as an autonomous pair programmer that performs multi-step coding tasks at your command, such as analyzing your codebase, proposing file edits, and running terminal commands. It responds to compile and lint errors, monitors terminal output, and auto-corrects in a loop until the task is completed. The agent can also use contributed tools, allowing it to interact with external MCP servers or VS Code extensions to perform a wide variety of tasks.\n\n## Available to all users\n\nOpen the Chat view, sign in to GitHub, set [chat.agent.enabled](vscode://settings/chat.agent.enabled) in your settings and select **Agent** in the Chat mode dropdown. If you do not see the setting, make sure to reload VS Code after updating to the latest version. In the following weeks, we are rolling it out by default to everyone - no setting will be required.\n\nAgent mode is great for scenarios where:\n\n- Your task involves multiple steps. The agent edits code, runs terminal commands, monitors for errors, and iterates to resolve any issues that arise.\n- You are unsure about the scope of the changes. The agent automatically determines the relevant files and context.\n- Your task requires interaction with external apps or data. The agent integrates with MCP servers and VS Code extensions.\n\nOn the other hand, use edit mode when the task has a well-defined scope, you want a quick turnaround, or you want finer control over the number of LLM requests.\n\nWe have created a unified chat experience, combining the Chat and Edits view, that brings benefits like session history, moving chat into a separate window, and simplification of the Working Set view. All of these are now also available in agent mode.\n\n![Agent mode with proposed changes in the editor](/assets/blogs/2025/04/07/agent_full.png)\n\nWe continue to receive fantastic user feedback ([please keep it coming!](http://github.com/microsoft/vscode/issues/)), which has inspired many of the improvements we have made. Most notably:\n\n- The undo action now reverts changes up to the last edit file tool call\n- Support for multiple agent sessions in the same workspace (best when editing sessions don't modify the same files)\n- The agent can now create and edit notebooks\n- The ability to auto-approve tool calls (terminal auto-approve coming in April)\n- A host of quality-of-life improvements and bug fixes\n\nBoth the ask and edit experiences are evolving towards an architecture that, like the agent, utilizes tools. We are making this change to unify ask/edit/agent modes to all be agentic, with the goal of smoothening the overall user experience. This allows the edit mode to use the `edit_file` tool for improved speed, and the edit and ask mode to use `#codebase` , an agentic codebase search. Consequently, language models with no tool calling support will no longer be available in edit mode.\n\nTo learn more about how the agent works, you can read our [previous post](https://code.visualstudio.com/blogs/2025/02/24/introducing-copilot-agent-mode).\n\n## Extensible: MCP servers and VS Code extensions\n\nJust as VS Code extensions enable you to customize your specific workflows, agent extensibility allows you to tailor the agent to your needs. With extensibility, the agent can perform browser actions (perform AI web debugging), connect to your chat and note-taking apps, interact with your databases, get context from your design system, get issues and repo context from GitHub and integrate with your cloud platforms. The power of agent mode is in the diversity of tools available and the flexibility to add and remove tools as a user. We are launching extensibility in preview and available to all users.\n\nAgent mode can use the following tools:\n\n- Built-in tools contributed by VS Code (blue in the diagram), which allow the agent to search the workspace, apply code changes, run terminal commands, capture compile or linting errors from the editor, fetch website content (`#fetch`\nto manually trigger), and more.\n- Tools contributed by MCP servers (green in the diagram).\n- Tools contributed by VS Code extensions (green in the diagram).\n\n![Diagram showing the inner works of agent mode and how it interacts with context, LLM and tools - including tools contributed by MCP servers and VS Code extensions](/assets/blogs/2025/04/07/diagram.png)\n\nWhen the VS Code team invented the [Language Server Protocol](https://microsoft.github.io/language-server-protocol/) (LSP) back in [2016](https://code.visualstudio.com/blogs/2016/06/27/common-language-protocol), our goal was to standardize how language servers communicate with development tools. We are proud that LSP has become a widely adopted standard and fulfilled our vision. Recently, the [ideas behind LSP](https://x.com/dsp_/status/1897821339332882617) inspired a new protocol: the [Model Context Protocol](https://modelcontextprotocol.io/introduction) (MCP), which standardizes how applications provide context to LLMs. With agent mode in VS Code using tools contributed by MCP servers, we have now come full circle back to VS Code.\n\n### It's about developer control\n\nNot every task needs all the tools you might have added to agent mode, and as with any AI workflow, being specific leads to better results. We recommend using the tools UI to manage and enable the tools needed for each scenario or explicitly referencing tools in your prompt by typing `#` .\n\n![Edit UI showing how to enable and disable tools](/assets/blogs/2025/04/07/tools-ui.png)\n\nTo give you full control, every tool invocation is transparently displayed in the UI and requires your approval (except for read-only built-in tools). You can allow a specific tool for the current session, workspace, or all future invocations. If you want to minimize interruptions by always allowing the agent to use all tools, while still maintaining security, consider using the [Dev Containers](https://marketplace.visualstudio.com/items?itemName=ms-vscode-remote.remote-containers) extension. This isolates all agent-driven changes within the container environment up to a point (for example, the agent could still push changes to remote if you allow it).\n\n![Chat UI showing a tool call](/assets/blogs/2025/04/07/tool-call.png)\n\n### Get started\n\nTo customize the agent for your workflows, select the **Tools** icon in the chat input and follow the **Add More Tools…** flow. Alternatively, read our [MCP server docs](https://aka.ms/vscode-add-mcp), which explain the configuration format, how to add an MCP server, or how to import MCP servers from an existing MCP client app like Claude Desktop. VS Code supports local standard input/output (`stdio` ) and server-sent events (`sse` ) for MCP server transport.\n\nMCP's [official server repository](https://github.com/modelcontextprotocol/servers) is a great starting point for official, and community-contributed servers that showcase MCP's versatility. To install extensions that contribute tools, open the Extensions view and search using the tag `@tag:language-model-tools` .\n\n![extension search showing extensions that contribute tools](/assets/blogs/2025/04/07/tool-extensions.png)\n\nAs a developer you can extend the agent by creating an MCP server, or if you are an extension author you can [contribute tools](https://marketplace.visualstudio.com/search?term=%40tag%3Alanguage-model-tools&amp;target=VSCode&amp;category=All%20categories&amp;sortBy=Relevance) to your VS Code extension. Refer to [these docs](https://code.visualstudio.com/docs/copilot/copilot-extensibility-overview) for guidance and best practices on writing tools.\n\n## What’s next\n\nAgent mode is improving every day, and to be among the first to benefit, consider installing [VS Code Insiders](https://code.visualstudio.com/insiders/). Using VS Code Insiders and providing feedback in [our repo](http://github.com/microsoft/vscode/issues/) is the best way to help us improve the product. Next, we plan to work on:\n\n- Support for custom modes with custom toolsets and [instructions](https://code.visualstudio.com/docs/copilot/copilot-customization)\n- A faster code-apply experience\n- Expand MCP support from tools to prompts, resources, and the latest spec updates\n- Streaming of edits limited to changed code blocks for improved speed\n- Checkpoints to easily go back to a specific step in your agent mode session\n- Overall performance and service quality improvements\n\nMake sure you are on the latest VS Code Stable, set [chat.agent.enabled](vscode://settings/chat.agent.enabled) in your settings and select **Agent** from the mode dropdown. Try it out today and let us know what you think! You can find the documentation [here](https://aka.ms/vscode-copilot-agent).\n\nHappy vibe coding (now with MCP and extensions)!\n\nIsidor and the VS Code team",
  "Tags": [
    "blog"
  ],
  "Description": "Agent mode is now available to all users and supports MCP.\n\n[Read the full article](https://code.visualstudio.com/blogs/2025/04/07/agentMode)",
  "OutputDir": "_news",
  "FeedName": "Visual Studio Code Releases",
  "Author": "Isidor Nikolic"
}
