{
  "Author": "Visual Studio Code Team",
  "Description": "Learn what is new in the Visual Studio Code November 2025 Release (1.107).\n\n[Read the full article](https://code.visualstudio.com/updates/v1_107)",
  "OutputDir": "_news",
  "FeedLevelAuthor": "Visual Studio Code - Code Editing. Redefined.",
  "ProcessedDate": "2025-11-24 23:02:40",
  "Link": "https://code.visualstudio.com/updates/v1_107",
  "FeedUrl": "https://code.visualstudio.com/feed.xml",
  "Title": "November 2025 Insiders (version 1.107)",
  "FeedName": "Visual Studio Code Releases",
  "EnhancedContent": "[Version 1.106](/updates) is now available! Read about the new features and fixes from October.\n\nDismiss this update\n\n[Edit](https://vscode.dev/github/microsoft/vscode-docs/blob/main/release-notes/v1_107.md)\n\n# November 2025 Insiders (version 1.107)\n\n![VS Code Insiders banner](/assets/updates/1_107/vscode-insiders-banner-medium.png)\n\n*Last updated: November 24, 2025*\n\nThese release notes cover the Insiders build of VS Code and continue to evolve as new features are added. To try the latest updates, [download Insiders](https://code.visualstudio.com/insiders). To read these release notes online, go to [code.visualstudio.com/updates](https://code.visualstudio.com/updates).\n\nYou can still track our progress in the [Commit log](https://github.com/Microsoft/vscode/commits/main) and our list of [Closed issues](https://github.com/Microsoft/vscode/issues?q=is%3Aissue+is%3Aclosed+milestone%3A%22November+2025%22).\n\n*These release notes were generated using GitHub Copilot and might contain inaccuracies.*\n\nHappy Coding!\n\n## November 23, 2025\n\n- Added command palette entry and editor toolbar button to create new Copilot CLI agent sessions, matching the workflow for local chat agents and eliminating the need to navigate through the Agent Session view. *[#273441](https://github.com/microsoft/vscode/issues/273441)*\n\n## November 22, 2025\n\n- Chat terminal output now renders using an embedded xterm.js terminal instance instead of plain HTML text, providing proper terminal formatting, ANSI color support, and accurate text rendering for command output. *[#276946](https://github.com/microsoft/vscode/issues/276946)*\n\n## November 21, 2025\n\n- Microsoft Authentication now supports the MSAL authentication broker on Linux x64 for enrolled machines that opt-in, enabling enhanced authentication security and compliance features on Linux platforms. *[#278688](https://github.com/microsoft/vscode/issues/278688)*\n- The Microsoft Authentication extension now supports MSAL Broker authentication on Intel-based Macs, enabling enhanced security through system-level credential management for enrolled devices that opt in to broker support. *[#278687](https://github.com/microsoft/vscode/issues/278687)*\n- Command Palette recently used commands can now be individually removed using an \"X\" button that appears next to each recently used command, allowing users to better curate their command history without affecting other command sections. *[#277311](https://github.com/microsoft/vscode/issues/277311)*\n- Custom chat modes now support keyboard shortcuts, allowing users to configure keybindings for extension-contributed chat modes through the keyboard shortcuts editor, matching the functionality previously available only for built-in modes. *[#270662](https://github.com/microsoft/vscode/issues/270662)*\n- Chat Sessions view now supports a unified single-view mode that displays all chat and agent sessions from different providers in one place, with enhanced capabilities for filtering, searching, and managing session state at a glance. *[#270945](https://github.com/microsoft/vscode/issues/270945)*\n- The \"Open Recent\" window picker now visually highlights workspaces and folders that are already open in other windows, making it easier to identify and switch to existing instances when working with multiple projects simultaneously. *[#268277](https://github.com/microsoft/vscode/issues/268277)*\n- Added a new \"Close Other Windows\" command that allows users to close all VS Code windows except the currently active one, improving window management when working with multiple open instances. *[#233635](https://github.com/microsoft/vscode/issues/233635)*\n- The fetch tool now supports fine-grained URL approval options, allowing you to automatically approve fetches based on specific URLs or domains (e.g., \"Always approve URLs from `bing.com`\n\"), providing more granular control similar to terminal command auto-approval instead of the previous session/workspace-level permissions. *[#265850](https://github.com/microsoft/vscode/issues/265850)*\n\n## November 20, 2025\n\n- The built-in GitHub extension now includes the GitHub MCP Server, providing Copilot with tools to interact with GitHub repositories, issues, pull requests, and organizations directly through chat. *[#254836](https://github.com/microsoft/vscode/issues/254836)*\n- Updated the Tree-sitter WASM library to the latest version, improving syntax parsing performance and capabilities for language grammars used in VS Code. *[#274547](https://github.com/microsoft/vscode/issues/274547)*\n- Upgraded the PowerShell tree-sitter grammar to improve parsing reliability and add support for `&&`\nand `||` operators in PowerShell 7, with enhanced command rewriting capabilities for both PowerShell 5 and 7. *[#274548](https://github.com/microsoft/vscode/issues/274548)*\n\n## November 18, 2025\n\n- GitHub Enterprise policies are now enforced when using VS Code in Codespaces, ensuring that organization-level security and compliance settings are properly applied in remote development environments. *[#278127](https://github.com/microsoft/vscode/issues/278127)*\n- The chat terminal tool now displays exit code, start time, and execution duration for terminal commands, making it easier to identify stuck or long-running commands during agent sessions. *[#272575](https://github.com/microsoft/vscode/issues/272575)*\n- The chat agent's `textSearch`\ntool now respects the `search.useIgnoreFiles` setting when searching code, allowing it to search files in .gitignore and other excluded directories when explicitly queried by the agent. *[#270857](https://github.com/microsoft/vscode/issues/270857)*\n\n## November 17, 2025\n\n- The default formatter dropdown in Settings now filters and prioritizes extensions that actually provide formatting capabilities, rather than listing all installed extensions indiscriminately. *[#277783](https://github.com/microsoft/vscode/issues/277783)*\n\n## November 15, 2025\n\n- Added `editor.inactiveLineHighlightBackground`\ntheme color to independently control the background color of the current line in unfocused editor groups, improving visual distinction between active and inactive editors in multi-editor workflows. *[#277272](https://github.com/microsoft/vscode/issues/277272)*\n- Terminal commands suggested by Copilot can now be allowed for the current chat session only, providing a temporary permission option alongside workspace-level settings for running riskier commands during specific tasks without permanently changing your configuration. *[#260819](https://github.com/microsoft/vscode/issues/260819)*\n\n## November 13, 2025\n\n- MCP server requests now include a proper User-Agent header (e.g., `VSCode/x.x.x (darwin arm64)`\n) instead of just `node` , enabling MCP server developers to distinguish VS Code traffic from other Node.js applications for analytics, monitoring, and debugging purposes. *[#264502](https://github.com/microsoft/vscode/issues/264502)*\n- Keybindings can now be configured to focus chat terminal sessions and expand their output, improving keyboard navigation accessibility when working with terminal commands executed by Copilot Chat. *[#274411](https://github.com/microsoft/vscode/issues/274411)*\n\n## November 12, 2025\n\n- URLs explicitly mentioned in chat messages are now automatically approved, eliminating the need for manual URL approval when users paste URLs directly into the chat interface. *[#276955](https://github.com/microsoft/vscode/issues/276955)*\n- Added keyboard shortcut support (Cmd/Ctrl+Enter) for the \"wait for task\" confirmation dialog in the terminal output monitor, improving consistency with other confirmation dialogs and enabling faster workflow when Copilot detects that tasks require user input. *[#276833](https://github.com/microsoft/vscode/issues/276833)*\n- Terminal command output is now serialized and persisted when using the chat terminal tool, allowing you to view command results even after the terminal instance has been closed or killed. *[#274870](https://github.com/microsoft/vscode/issues/274870)*\n- AI-related code actions (such as \"Generate Documentation\") are now shown directly in the Quick Fix menu (Ctrl/Cmd + .) and lightbulb hover by default, providing instant access to AI assistance features without requiring the Copilot extension to be installed first. *[#260136](https://github.com/microsoft/vscode/issues/260136)*\n- Comment thread gutter icons now display a distinct draft icon when the thread contains draft comments, improving visibility of unpublished feedback alongside existing resolved and unresolved comment indicators. *[#179162](https://github.com/microsoft/vscode/issues/179162)*\n- MCP servers can now return resources using `https://`\nURIs instead of embedding content as base64 blobs, reducing context size when serving images and other web-accessible resources. *[#259253](https://github.com/microsoft/vscode/issues/259253)*\n\n## November 11, 2025\n\n- A new **Go To Offset** command was added to improve discoverability of offset mode in the Quick Open picker, which pre-populates the input with `::`\n(similar to how Go To Line/Column pre-populates with `:` ) to help users navigate to a specific byte offset in a file. *[#275317](https://github.com/microsoft/vscode/issues/275317)*\n- Terminal inline output is now accessible to screen readers, with content rendered as text instead of HTML in screen reader mode to improve navigation and readability for users relying on assistive technologies. *[#274220](https://github.com/microsoft/vscode/issues/274220)*\n- When Copilot requests permission to edit sensitive files (like settings.json), an inline diff preview is now shown instead of raw JSON tool call data, making it easier to review proposed changes before approval. *[#266574](https://github.com/microsoft/vscode/issues/266574)*\n- The \"Move Editor into Previous Group\" command now automatically creates a new editor group to the left when invoked from the left-most group (if it contains multiple editors), mirroring the behavior of \"Move Editor into Next Group\" and improving keyboard-driven workflow for arranging editors. *[#262817](https://github.com/microsoft/vscode/issues/262817)*\n\n## November 10, 2025\n\n- The recently opened picker now visually indicates which folders and workspaces are currently open in other windows, making it easier to identify and manage multiple workspace instances. *[#276460](https://github.com/microsoft/vscode/issues/276460)*\n- Terminal suggest widget now groups argument suggestions separately from options and flags, making it easier to distinguish between command arguments and flags in the suggestions list. *[#272352](https://github.com/microsoft/vscode/issues/272352)*\n- You can now disable automatic hover popups while retaining the ability to trigger hover information on-demand using Ctrl+hover, reducing visual distractions during text selection while preserving quick access to contextual information when needed. *[#72025](https://github.com/microsoft/vscode/issues/72025)*\n\n## November 9, 2025\n\n- Re-instated the `workbench.editor.swipeToNavigate`\nsetting on macOS, enabling users to navigate between editor history using three-finger swipe gestures on trackpads. *[#204812](https://github.com/microsoft/vscode/issues/204812)*\n\n## November 7, 2025\n\n- Git Bash terminal profiles now display a dedicated Git Bash icon instead of the generic terminal icon, improving visual identification in the terminal dropdown and tabs. *[#275568](https://github.com/microsoft/vscode/issues/275568)*\n- The Settings editor now supports wildcard filtering using the `@id:`\nprefix, allowing you to filter settings by ID pattern using `@id:settingIdPrefix.*` syntax. *[#242231](https://github.com/microsoft/vscode/issues/242231)*\n\nWe really appreciate people trying our new features as soon as they are ready, so check back here often and learn what's new.",
  "Tags": [
    "release"
  ],
  "PubDate": "2025-12-10T17:00:00+00:00"
}
