{
  "Author": "Visual Studio Code Team",
  "Description": "Learn what is new in the Visual Studio Code February 2026 Release (1.110).\n\n[Read the full article](https://code.visualstudio.com/updates/v1_110)",
  "ProcessedDate": "2026-02-05 12:05:51",
  "FeedLevelAuthor": "Visual Studio Code - Code Editing. Redefined.",
  "PubDate": "2026-03-04T17:00:00+00:00",
  "OutputDir": "_news",
  "Link": "https://code.visualstudio.com/updates/v1_110",
  "FeedUrl": "https://code.visualstudio.com/feed.xml",
  "Title": "February 2026 Insiders (version 1.110)",
  "FeedName": "Visual Studio Code Releases",
  "Tags": [
    "release"
  ],
  "EnhancedContent": "[Version 1.109](/updates) is now available! Read about the new features and fixes from January.\n\nDismiss this update\n\n# February 2026 Insiders (version 1.110)\n\n![VS Code Insiders banner](/assets/updates/1_110/vscode-insiders-banner-medium.png)\n\n*Last updated: February 5, 2026*\n\nThese release notes cover the Insiders build of VS Code and continue to evolve as new features are added. To try the latest updates, [download Insiders](https://code.visualstudio.com/insiders). To read these release notes online, go to [code.visualstudio.com/updates](https://code.visualstudio.com/updates).\n\nYou can still track our progress in the [Commit log](https://github.com/Microsoft/vscode/commits/main) and our list of [Closed issues](https://github.com/Microsoft/vscode/issues?q=is%3Aissue+is%3Aclosed+milestone%3A%22February+2026%22).\n\n*These release notes were generated using GitHub Copilot and might contain inaccuracies.*\n\nHappy Coding!\n\n## February 5, 2026\n\n- Add setting to control the scroll behavior in the Settings editor, offering continuous or paginated. Paginated will restrict the settings shown to only those in that category. [#291391](https://github.com/microsoft/vscode/issues/291391)\n\n## February 4, 2026\n\n- Improved chat `askQuestion`\ncarousel now has improved accessibility. ARIA labels have been added, keyboard focus can be moved to the container, and focus no longer automatically moves to the first response. A new command and keybinding is available to focus the first response in screen reader mode. [#292917](https://github.com/microsoft/vscode/issues/292917)\n- Add support for the text blink attribute in the integrated terminal. [#292550](https://github.com/microsoft/vscode/issues/292550)\n- Add support for color scheme reporting in the integrated terminal, allowing programs to query the terminal's current color palette. [#290919](https://github.com/microsoft/vscode/issues/290919)\n- Populate the Find control input in the integrated browser's with the currently selected text on the page, matching standard browser behavior. [#291378](https://github.com/microsoft/vscode/issues/291378)\n- Show download progress information when downloading a VS Code update. [#277330](https://github.com/microsoft/vscode/issues/277330)\n\n## February 3, 2026\n\n- Terminal performance has been improved with updates to xterm.js, including optimizations for rendering and processing. [#292572](https://github.com/microsoft/vscode/issues/292572)\n- Respect session list filters in the agent sessions Quick Pick and welcome page. If you have specific agent types filtered out from the session list, they will also be excluded from the Quick Pick when switching sessions. [#291603](https://github.com/microsoft/vscode/issues/291603)\n\n## February 2, 2026\n\n- Improved screen reader accessibility for quick input dialogs. ARIA attributes are now dynamically set only when the list is active, preventing redundant announcements. The Go to Line dialog (`Ctrl+G`\n) now provides proper screen reader announcements for characters typed and list item navigation. [#292353](https://github.com/microsoft/vscode/issues/292353)\n- Selecting `Hidden terminal`\nin the terminal dropdown now directly opens the terminal when there is only one hidden terminal, instead of showing a quick pick menu. [#291884](https://github.com/microsoft/vscode/issues/291884)\n- Fixed an issue where the terminal output panel in chat would auto-collapse on command success even when manually expanded. The panel now respects the user's manual expand state and remains expanded after successful command completion. [#291120](https://github.com/microsoft/vscode/issues/291120)\n\n## January 30, 2026\n\n- The chat question carousel UI now uses a list-style selection interface similar to QuickPick instead of native radio buttons and checkboxes. This provides better visual consistency with other VS Code selection UIs across platforms. [#291328](https://github.com/microsoft/vscode/issues/291328)\n\nWe really appreciate people trying our new features as soon as they are ready, so check back here often and learn what's new."
}
