{
  "OutputDir": "_news",
  "Title": "What’s new with Azure Repos?",
  "FeedUrl": "https://devblogs.microsoft.com/devops/feed/",
  "FeedName": "Microsoft DevOps Blog",
  "PubDate": "2026-01-16T19:34:04+00:00",
  "Link": "https://devblogs.microsoft.com/devops/whats-new-with-azure-repos/",
  "FeedLevelAuthor": "Azure DevOps Blog",
  "ProcessedDate": "2026-01-16 20:02:00",
  "Description": "We thought it was a good time to check in and highlight some of the work happening in Azure Repos. In this post, we’ve covered several recent improvements, along with a preview of features that are coming soon. To stay up to date, be sure to visit the Azure DevOps Roadmap. These changes have either […]\n\nThe post [What’s new with Azure Repos?](https://devblogs.microsoft.com/devops/whats-new-with-azure-repos/) appeared first on [Azure DevOps Blog](https://devblogs.microsoft.com/devops).",
  "Tags": [
    "Azure & Cloud"
  ],
  "Author": "Dan Hellem",
  "EnhancedContent": "We thought it was a good time to check in and highlight some of the work happening in Azure Repos. In this post, we’ve covered several recent improvements, along with a preview of features that are coming soon. To stay up to date, be sure to visit the [Azure DevOps Roadmap](https://learn.microsoft.com/en-us/azure/devops/release-notes/features-timeline).\n\nThese changes have either already been released or are currently rolling out. Be sure to check the sprint release notes for full details.\n\n### Breaking Change: Disabling Obsolete TFVC Check-In Policies\n\nBack in April 2025, [we shared changes](https://devblogs.microsoft.com/devops/tfvc-policies-storage-updates) to how TFVC check-in policies are stored. These updates affect TFVC projects using policies such as Build (require the last build to succeed), Work Item (require an associated work item), Changeset Comments (require users to add a comment to their check-in), and similar rules.\n\nOver the past year, we’ve been guiding customers through migrating existing, obsolete policies to the new storage format and preventing the creation of new ones using the old model. With this release, any remaining check-in policies still using the obsolete format will be disabled. These policies will no longer function, and you’ll need to migrate them to the new format for check-in policies to continue working.\n\nFor full details and step-by-step migration guidance, be sure to review our earlier [blog post](https://devblogs.microsoft.com/devops/tfvc-policies-storage-updates).\n\n### Improved Comment Navigation from Pull Request Links\n\nWe’ve made improvements to how Azure DevOps handles deep links to pull request comments. When opening a pull request from a direct comment link, focus is now handled more reliably, especially for pull requests with a large number of comments.\n\nThis makes it easier to jump directly to the feedback you care about without losing context.\n\n### Pull Request Notification Improvements\n\nTo help teams better focus on meaningful pull request activity, we’ve updated Azure DevOps email notifications to reduce noise and improve clarity. Several low-value notifications, including draft state changes and auto-complete updates, have been removed entirely.\n\nFor the notifications that remain, we’ve simplified the content to highlight what actually changed, such as affected files, while removing redundant details like full reviewer and commit lists. The result is pull request emails that are easier to scan, more actionable, and better aligned with how teams collaborate during code reviews.\n\n### Pull Request Templates for Multi-Level Branches\n\n[Pull request templates](https://learn.microsoft.com/en-us/azure/devops/repos/git/pull-request-templates?view=azure-devops) now support nested folder structures that align with multi-level branch names. When you open a pull request targeting a branch like `feature/foo/december` , Azure DevOps will look for a matching template in the following order:\n\n1. `<pull request template path>/branches/feature/foo/december.md`\n2. `<pull request template path>/branches/feature/foo.md`\n3. `<pull request template path>/branches/feature.md`\n\nThe most specific template available will be applied automatically. This makes it easier to tailor guidance and requirements based on branching conventions without duplicating templates.\n\n### Azure DevOps MCP Server\n\nIf you haven’t checked it out yet, the [local Azure DevOps MCP Server](https://github.com/microsoft/azure-devops-mcp) continues to grow with new tools for working with Azure Repos. It enables you to interact with repositories, branches, commits, and pull requests directly from tools like VS Code and GitHub Copilot.\n\nFor example, you can fetch repository metadata, list branches, inspect file contents, and explore commit history without navigating the Azure DevOps UI, making it easier to build intelligent tooling and workflows on top of Azure DevOps.\n\nFor more information, check out the [Azure DevOps MCP Server](https://github.com/microsoft/azure-devops-mcp) repo.\n\n## 🎉 Coming Soon\n\n### Improved Git Policy Configuration API\n\nWe’re working on improvements to the Git policy configuration APIs to make it easier and more efficient to retrieve all policies that apply to a specific repository. This includes policies defined at the repository level as well as those applied to individual branches or refs.\n\nThese changes reduce unnecessary API calls and improve performance for services managing policies at scale, while preserving existing policy behavior.\n\nLearn more: [Policy Configurations – Get – REST API (Azure DevOps Git) | Microsoft Learn](https://learn.microsoft.com/en-us/rest/api/azure/devops/git/policy-configurations/get?view=azure-devops-rest-7.2)\n\n### More Pull Request Improvements Ahead\n\nWe have several pull request improvements planned for upcoming sprints, many of which are driven directly by feedback from the [Azure DevOps Community](https://developercommunity.visualstudio.com/AzureDevOps). We’re starting with reducing notification noise, as described above, but that’s just the beginning.\n\nWe’re also working on improvements such as highlighting pull requests with outstanding comments, allowing authors to reset a pull request back to a “ready for review” state, and adding the ability to filter pull requests by tags.\n\nTogether, these changes are focused on making it easier to understand what needs attention and keep reviews moving efficiently."
}
