{
  "ProcessedDate": "2025-10-14 16:03:19",
  "OutputDir": "_news",
  "Tags": [
    "Azure & Cloud"
  ],
  "Link": "https://devblogs.microsoft.com/devops/modernizing-authentication-for-legacy-visual-studio-clients/",
  "EnhancedContent": "As part of our ongoing commitment to security and modernization, we’re updating outdated authentication mechanisms used by older versions of clients reliant on our older Visual Studio client libraries.\n\nFor full details on all known impacted clients, refer to the official announcement we made in April 2024: **[End of Support for Microsoft products reliant on older Azure DevOps and Visual Studio authentication](https://devblogs.microsoft.com/devops/end-of-support-for-microsoft-products-reliant-on-older-azure-devops-authentication/)**.\n\nIn order to minimize disruption due to removing these legacy tokens, over the past few months, we’ve worked on seamlessly transitioning these legacy tokens to Entra-backed authentication when possible. This change enhances security and aligns with current identity standards—but it may also result in more frequent interactive reauthentication prompts, due to the 1-hour lifetime of Entra tokens.\n\nIf you’re still experiencing authentication issues, we strongly recommend upgrading to a supported version of your client or tool that relies on the legacy tokens. As a reminder, many of these older products are past end-of-support, so we’re unable to maintain compatibility with deprecated in-product authentication flows. Upgrading your clients to later versions that rely on modern authentication likely comes with additional security and product improvements.",
  "FeedUrl": "https://devblogs.microsoft.com/devops/feed/",
  "Author": "Angel Wong",
  "Title": "Modernizing Authentication for Legacy Visual Studio Clients",
  "Description": "As part of our ongoing commitment to security and modernization, we’re updating outdated authentication mechanisms used by older versions of clients reliant on our older Visual Studio client libraries. For full details on all known impacted clients, refer to the official announcement we made in April 2024: End of Support for Microsoft products reliant on […]\n\nThe post [Modernizing Authentication for Legacy Visual Studio Clients](https://devblogs.microsoft.com/devops/modernizing-authentication-for-legacy-visual-studio-clients/) appeared first on [Azure DevOps Blog](https://devblogs.microsoft.com/devops).",
  "FeedName": "Microsoft DevOps Blog",
  "FeedLevelAuthor": "Azure DevOps Blog",
  "PubDate": "2025-10-14T15:28:47+00:00"
}
