{
  "Tags": [
    ".NET",
    ".NET 10",
    ".NET MAUI",
    "AI",
    "ASP.NET Core",
    "Blazor",
    "C#",
    "conference",
    "Featured",
    "NuGet",
    "Visual Studio"
  ],
  "Description": ".NET Conf 2025 is over, but you can catch up with all the announcements and fun with video recordings, slides, demos, and more.\n\nThe post [.NET Conf 2025 Recap – Celebrating .NET 10, Visual Studio 2026, AI, Community, & More](https://devblogs.microsoft.com/dotnet/dotnet-conf-2025-recap/) appeared first on [.NET Blog](https://devblogs.microsoft.com/dotnet).",
  "FeedUrl": "https://devblogs.microsoft.com/dotnet/feed/",
  "Link": "https://devblogs.microsoft.com/dotnet/dotnet-conf-2025-recap/",
  "FeedLevelAuthor": ".NET Blog",
  "Author": ".NET Team",
  "Title": ".NET Conf 2025 Recap – Celebrating .NET 10, Visual Studio 2026, AI, Community, & More",
  "PubDate": "2025-12-04T18:05:00+00:00",
  "OutputDir": "_news",
  "ProcessedDate": "2025-12-04 19:03:35",
  "EnhancedContent": "At [.NET Conf 2025](https://www.dotnetconf.net/) we celebrated the official launch of [.NET 10](https://get.dot.net/10) and [Visual Studio 2026](https://visualstudio.com/download). The event provided a deeper dive into the world of .NET for developers worldwide and there were many announcements across the entire .NET ecosystem. Organized by Microsoft and the .NET community, the event was a huge success, providing .NET developers with 3 days of incredible, free .NET content, plus a special Student Zone on November 14th.\n\n## On-Demand Recordings\n\nIf you missed the event, feel free to catch up on the sessions via our on-demand playlists on [YouTube](https://aka.ms/dotnetconf25/OnDemand).\n\nThe conference kicked off with Scott Hanselman, .NET and Visual Studio product team members welcoming attendees and celebrating the incredible momentum of .NET. With over 7 million .NET developers using the Visual Studio family of products monthly and more than 23,000 pull requests merged to .NET 10 alone, the community continues to thrive. Since open-sourcing, .NET has received over 290,000 pull requests from the community, with more than 68,000 people contributing code and filing issues. Since 2020, .NET has been one of the highest velocity open-source projects tracked by the Cloud Native Computing Foundation (CNCF), and C# is consistently ranked in the top five programming languages on GitHub. Scott emphasized that the goal with .NET is to build “a complete development platform that developers love, that businesses trust” – a vision exemplified by how .NET powers many Microsoft products like Bing (running .NET 10 release candidates in production with noticeable P90 latency improvements), Xbox Gaming Copilot (using the entire .NET stack including Orleans and Aspire), and Copilot Studio (built as a Blazor WebAssembly app).\n\n![.NET Conf 2025 Keynote](https://devblogs.microsoft.com/dotnet/wp-content/uploads/sites/10/2025/12/keynote.webp)\n\nThe keynote also highlighted the incredible ecosystem of partners contributing to .NET’s success, including distro maintainers and security partners like Red Hat, Canonical, and IBM; software partners like Syncfusion and Uno Platform helping build .NET MAUI and its core components; hardware partners AMD and Intel contributing low-level hardware intrinsics for significant performance improvements in computationally intensive tasks like AI workloads; and Samsung working on instruction set architecture for RISC-V and ARM, preparing .NET for a bright future.\n\nCompanies all over the world trust .NET to power their businesses every day. Throughout the conference, we heard inspiring customer stories. Shoreless AI, built entirely in .NET, demonstrated how the platform enables developers to become AI architects. In collaboration with Texas A&M University’s Mays Business School, they powered the first-of-its-kind national AI pitch competition with over 100 applicants from 37 universities. FMG showcased the power of GitHub Copilot App Modernization by upgrading many of their applications to .NET 10 in just hours – a process that would typically take weeks.\n\nA huge thank you to everyone who contributed to .NET!\n\nThis year, we delivered an action-packed program featuring the .NET team and community members across 3 days of live content:\n\n- **Day 1: .NET 10 Launch (November 11)** featured the official release of .NET 10, including the keynote and sessions led by the .NET team to introduce new features and enhancements including C# 14, performance improvements, ASP.NET Core updates, Blazor enhancements, .NET MAUI, Aspire, AI-powered development, and Visual Studio 2026.\n- **Day 2: Azure, Cloud, and Deep Dives (November 12)** kicked off with the Azure Keynote and provided deeper dives into cloud-native development, Azure Container Apps, Azure Kubernetes Service, Azure Functions, AI services, and advanced topics including testing, containers, and security.\n- **Day 3: Community Day (November 13)** featured speakers from around the world sharing real-world experiences, advanced techniques, and innovative projects built with .NET. The day included live sessions followed by a YouTube Premiere track featuring even more community content.\n\nWe also extended .NET Conf’s reach to developers in China through localized broadcasts on WeChat and Bilibili, featuring Chinese subtitles and region-specific scheduling. This effort engaged the vibrant Chinese .NET developer community and demonstrated our commitment to supporting .NET developers worldwide. 你好，中国的 .NET 开发者朋友们！.NET 爱你们！ (Hello to our .NET developer friends in China! .NET loves you!)\n\n## .NET Conf 2025 Announcements\n\nAs part of the keynotes of .NET Conf 2025, we had exciting announcements from the teams at Microsoft:\n\n### .NET 10 is now available\n\nThe best version of .NET yet is now available! .NET 10 is released and ready to download today. This Long Term Support (LTS) release delivers a complete development platform that developers love and businesses trust, enabling you to build modern apps with a high-performance runtime, best-in-class programming languages, and powerful development tools. With updates across ASP.NET Core, .NET MAUI, WinForms, Blazor, C# 14, industry-leading performance improvements, enhanced security, and so much more, .NET 10 empowers you to meet the needs of tomorrow. As an LTS release, .NET 10 will be supported for three years until November 10, 2028.\n\n[Read the announcement](https://aka.ms/dotnet10) | [Download .NET 10](https://get.dot.net/10)\n\n### Visual Studio 2026 released\n\nVisual Studio 2026 is now available, delivering best-in-class development tools as part of the complete .NET development platform! This release includes full .NET 10 support, a modern look and feel with FluentUI, improved hot reload and Razor editing experiences, enhanced diagnostics, streamlined upgrade processes, and GitHub Copilot as your AI pair programmer. Together with .NET 10, Visual Studio 2026 provides the tools developers love to build the modern applications that businesses trust.\n\n![Visual Studio 2026 release announcement](https://devblogs.microsoft.com/dotnet/wp-content/uploads/sites/10/2025/12/keynote-visual-studio.webp)\n\n[Read the announcement](https://aka.ms/vs2026ga) | [Download Visual Studio 2026](https://visualstudio.com/download)\n\n### Aspire 13 is here\n\nAspire is now more than just .NET. Featuring a code-first experience to help you build applications with modular and extensible integrations with popular frameworks and tools, Aspire 13 gives you the flexibility to build and deploy applications your way.\n\n[Read the announcement](https://aka.ms/aspire/13/blog) | [Download Aspire](https://aka.ms/aspire/13/download)\n\n### GitHub Copilot app modernization\n\nYou can now use GitHub Copilot for app modernization! Quickly upgrade your .NET applications to the latest versions of .NET with the power of AI. Get code suggestions, end-to-end assessments and remediation assistance to help you modernize your applications and migrate to Azure.\n\n[Learn more](https://aka.ms/ghcp-appmod/net)\n\n### GitHub Copilot testing for .NET\n\nUse GitHub Copilot to improve your test coverage! Now in public preview, generate unit tests, cover more edge cases, accelerate your testing, and give yourself a productivity boost. Copilot can even suggest fixes when a test fails to help ensure your applications are working as expected.\n\n[Try the Learn module](https://aka.ms/ghcp-testing/learn)\n\n### Microsoft Agent Framework for .NET\n\nThe Microsoft Agent Framework for .NET is now available in public preview! As part of the complete .NET platform, the framework enables you to build intelligent AI-powered agents and assistants that can autonomously perform tasks, make decisions, and interact with users using natural language. The framework is designed to work seamlessly with the broader .NET ecosystem, including Microsoft.Extensions.AI and other .NET technologies.\n\n![.NET Conf 2025 Keynote - Agentic UI](https://devblogs.microsoft.com/dotnet/wp-content/uploads/sites/10/2025/12/agentic-ui.webp)\n\n[Learn more](https://github.com/microsoft/agent-framework)\n\n### MCP C# SDK\n\nThe Model Context Protocol (MCP) C# SDK is now available in public preview! MCP enables AI applications to connect with external tools and data sources, extending the capabilities of AI agents. Microsoft products are already leveraging this technology – both Xbox Gaming Copilot and Copilot Studio (a Blazor WebAssembly app) use the MCP C# SDK in production. The SDK provides a set of tools and libraries to help you build intelligent applications with extensible AI capabilities.\n\n[Learn more](https://modelcontextprotocol.github.io/csharp-sdk/)\n\n## Visual Studio 2026 – Faster, Smarter, More Productive\n\nVisual Studio 2026 shipped alongside .NET 10, bringing enhanced support for .NET development with improved performance, AI-powered development tools, and seamless compatibility with .NET 10 projects. The release includes full support for C# 14, improved debugging and profiling for .NET applications, and GitHub Copilot integration to accelerate your .NET development workflow.\n\nSeveral sessions at .NET Conf highlighted Visual Studio 2026’s capabilities for .NET developers:\n\n- [Welcome to .NET 10 & Visual Studio 2026!](https://www.youtube.com/watch?v=kbW7qHMBM6A) – The keynote with announcements and demos\n- [AI-Powered Development with GitHub Copilot in Visual Studio](https://www.youtube.com/watch?v=imTARwNQuA4) – AI-powered development workflow\n- [Visual Studio Debugger: Advanced Techniques](https://www.youtube.com/watch?v=6afeRSFQiw0) – Advanced debugging for .NET applications\n- [Real-World .NET Profiling with Visual Studio](https://www.youtube.com/watch?v=IjDRYqtRkWA) – Performance profiling and optimization\n- [AI-Powered Testing in Visual Studio](https://www.youtube.com/watch?v=Bkn78klGhtc) – AI-powered test generation\n- [.NET Diagnostic Tooling with AI](https://www.youtube.com/watch?v=HLNYCwgk5fU) – AI-powered diagnostics\n- [Modernizing .NET Applications for the Cloud](https://www.youtube.com/watch?v=vrxn-y0tFTI) – App modernization tools\n\nRead more in the [Visual Studio 2026 announcement blog post](https://devblogs.microsoft.com/visualstudio/visual-studio-2026-is-here-faster-smarter-and-a-hit-with-early-adopters/).\n\n## Explore Slides & Demo Code\n\nAccess the PowerPoint slide decks, source code, and more from our amazing speakers on the official [.NET Conf 2025 GitHub page](https://aka.ms/dotnetconf-slides). Plus, grab your [2025 Digital Swag](https://github.com/dotnetConf/2025/tree/main/swag)!\n\n## Key Features and Improvements in .NET 10\n\n### Unparalleled Performance\n\n.NET 10 is the fastest .NET yet with improvements across the runtime, workloads, and languages. Watch [Performance Improvements in .NET 10](https://www.youtube.com/watch?v=snnULnTWcNM) for a deep dive. Key improvements include:\n\n- **JIT compiler enhancements**: Better inlining, method devirtualization, and improved code generation\n- **Hardware acceleration**: AVX10.2 support for cutting-edge Intel silicon, Arm64 SVE for advanced vectorization\n- **NativeAOT improvements**: Smaller, faster ahead-of-time compiled apps\n- **Runtime optimizations**: Enhanced loop inversion and stack allocation strategies\n\n### Security & Cryptography\n\nWith quantum computing on the horizon, .NET 10 expands post-quantum cryptography support with Windows Cryptography API: Next Generation (CNG) support, ensuring your applications are prepared for the future of computing. Additional security enhancements throughout .NET 10 help protect your applications with hardened defaults and improved cryptographic capabilities.\n\nLearn more in [A Year in .NET Security (2024–2025)](https://www.youtube.com/watch?v=8lFm4wI1bPo) and [Security-First .NET: How GitHub’s Tools Protect Your Open-Source Projects](https://www.youtube.com/watch?v=nxUz7OQO3n8).\n\n### C# 14 & F# 10\n\nC# 14 introduces powerful features including field-backed properties, extension properties and methods, first-class `Span<T>` conversions, and partial properties and constructors. F# 10 focuses on clarity, consistency, and performance with scoped warning suppression, access modifiers on auto property accessors, and parallel compilation. Learn more in [What’s New in C# 14](https://www.youtube.com/watch?v=xy-HzFp0pbA) and [Smatterings of F#](https://www.youtube.com/watch?v=GcEHiY6Vp-8).\n\n### Cloud-Native Development with Aspire\n\nAspire 13 makes building observable, production-ready distributed apps straightforward with:\n\n- Modern development experience with CLI enhancements\n- Seamless build & deployment with built-in static file site support\n- Enterprise-ready infrastructure with flexible connection strings\n- Polyglot support for Python, JavaScript, and other languages\n\nWatch [Aspire: Cloud-Native Development Simplified](https://www.youtube.com/watch?v=aXouOsBh4ro), [Deep Dive: Extending and Customizing Aspire](https://www.youtube.com/watch?v=UQiL3nbQbtM), and [Aspire Unplugged with David and Maddy](https://www.youtube.com/watch?v=dJdXdRiIfDw) for more details.\n\n### Artificial Intelligence\n\n.NET 10 brings comprehensive AI capabilities:\n\n- **Microsoft Agent Framework**: Build intelligent multi-agent systems with sequential, concurrent, and handoff workflows\n- **Microsoft.Extensions.AI**: Unified abstractions for integrating AI services with any provider\n- **Model Context Protocol (MCP)**: Extend AI agents with external tools and services\n- **AG-UI Support**: Build rich agent user interfaces with the AG-UI protocol\n\nExplore these sessions: [Building Intelligent Apps with .NET](https://www.youtube.com/watch?v=N0DzWMkEnzk), [Understanding Agentic Development](https://www.youtube.com/watch?v=V_sIYwc9Tvs), [Model Context Protocol (MCP) for .NET Developers](https://www.youtube.com/watch?v=3swFQjBZDUA), [Building Remote MCP Servers](https://www.youtube.com/watch?v=b9cwTqr1cKo), [Build smarter agents with Redis, .NET and Agent Framework](https://www.youtube.com/watch?v=Pz3A3CCgEac), and [AI Foundry for .NET Developers](https://www.youtube.com/watch?v=eJfToDv8KH4).\n\n### ASP.NET Core Enhancements\n\nASP.NET Core in .NET 10 includes:\n\n- **Automatic Memory Pool Eviction**: Reduces memory footprint in long-running applications\n- **Enhanced Security**: Passkey support in Identity, hardened defaults, improved certificate handling, and enhanced security headers ensure your apps are secure by default\n- **Native AOT Enhancements**: OpenAPI support in the webapiaot template\n- **Blazor improvements**: Component state persistence, circuit state persistence, and improved form validation\n\nLearn more in [What’s New in ASP.NET Core](https://www.youtube.com/watch?v=LgUZB_rhyX4), [Build better web apps with Blazor in .NET 10](https://www.youtube.com/watch?v=V0Af7y7aMBE), and the [.NET Conf 2025 release roundup on ASP.NET Community Standup](https://www.youtube.com/watch?v=DqoxPIDNWfA).\n\n### .NET MAUI\n\n.NET MAUI continues to evolve with:\n\n- Android 16 and iOS 26.0 bindings\n- Enhanced HybridWebView with initialization events and JavaScript exception handling\n- Improved XAML with global namespaces and new XAML source generator\n- MediaPicker multi-file selection and automatic EXIF handling\n\nWatch [What’s New in .NET MAUI](https://www.youtube.com/watch?v=6kz3XWCVij0) for a complete overview, [Ship Faster with .NET MAUI: Real-World Pitfalls and How to Nuke Them](https://www.youtube.com/watch?v=iaU3lsvB_Ig) for practical tips, [Migrating from Xamarin.Forms to .NET MAUI: The Hard Parts](https://www.youtube.com/watch?v=UOsuWPy6RuI) for migration guidance, and [Uno Platform. Now with AI](https://www.youtube.com/watch?v=g4A_3ZCwwWg) to see how Uno Platform extends .NET MAUI capabilities. Also check out [What’s New in Windows Forms](https://www.youtube.com/watch?v=f0971pImtlw) and [Modern Windows Development with .NET](https://www.youtube.com/watch?v=IJ8s5OvbFdg) for desktop development updates.\n\n### Day Two Deep Dives\n\nDay Two provided advanced sessions on specialized topics:\n\n- [Microsoft.Testing.Platform](https://www.youtube.com/watch?v=QWi_bvQc4fc) – The new testing platform for .NET\n- [Container Optimizations](https://www.youtube.com/watch?v=IfhxdKKd4GU) – Best practices for containerized .NET applications\n- [NuGet Updates](https://www.youtube.com/watch?v=blGOP6adqa4) – Latest improvements to NuGet package management\n- [.NET Security Investigations](https://www.youtube.com/watch?v=8lFm4wI1bPo) – Security best practices and tooling\n\n### Community Day Highlights\n\nDay Three featured exceptional content from the .NET community, including the following top sessions:\n\n- [Clean Architecture with ASP.NET Core 10](https://www.youtube.com/watch?v=rjefnUC9Z90) with Ardalis – Principles of project organization and loosely-coupled, maintainable code\n- [Migrating from Xamarin.Forms to .NET MAUI: The Hard Parts](https://www.youtube.com/watch?v=UOsuWPy6RuI) with Iris Classon – Real-world migration guidance from a large Xamarin.Forms application\n- [Beyond Monitoring: Observability in .NET with OpenTelemetry](https://www.youtube.com/watch?v=7OahLUp8Yrk) with Yulia Samoylova – How logs, metrics, and traces provide complete application observability\n- [Old API, New Tricks: Add MCP to Existing .NET REST Endpoints](https://www.youtube.com/watch?v=K-ntHsFriuI) with Jonathan “J.” Tower – Adding Model Context Protocol capabilities to existing ASP.NET Web API endpoints\n- [C# Features you need: Habits you want](https://www.youtube.com/watch?v=yIswUU7lKpk) with Bill Wagner – Tour of C# improvements from C# 12 through C# 14\n- [High-Performance Terrain Simulations in .NET](https://www.youtube.com/watch?v=M98JKrUfyI4) with Dax Pandhi – Architectural techniques powering Gaea’s terrain engine used in Star Wars and Star Trek\n- [Going Passwordless – A Practical Guide to Passkeys in ASP.NET Core](https://www.youtube.com/watch?v=U4_KcjJOxOE) with Maarten Balliauw – Implementing passkey authentication in ASP.NET Core applications\n- [Nullable Reference Types: It’s Actually About Non-Nullable Reference Types](https://www.youtube.com/watch?v=7Sz4heIk_lM) with Shawn Wildermuth – Understanding why Nullable Reference Types exist and how they improve code\n\n## Student Zone – November 14th\n\nThe [Student Zone](https://www.youtube.com/watch?v=-c8r2fMi9cg) returned for .NET Conf 2025, providing a beginner-friendly virtual event featuring experts teaching students how to build amazing projects using C# and .NET. Topics covered AI, web development, mobile development, and game development, making it a perfect opportunity for students and newcomers to get started with .NET.\n\n## Local .NET Conf Events\n\nThe learning journey continues with community-run events. Join us in celebrating .NET around the globe! [Find an event near you](https://dotnetconf.net/local-events).\n\n## Join the Conversation\n\nShare your thoughts and favorite moments from .NET Conf 2025 in the comments below or on social media using #dotNETConf2025. Let’s keep the conversation going!\n\n🎥 Catch Up on Sessions: Watch all the sessions you missed or rewatch your favorites on [on-demand playlists](https://aka.ms/dotnetconf25/OnDemand).\n\n🚀 Get Started with .NET 10: [Download the latest release of .NET 10](https://aka.ms/get-dotnet-10) and explore the groundbreaking features it has to offer.\n\n📚 Upskill on Aspire: Begin your journey with Aspire by watching the beginner video series and earning the [Microsoft Learn credential](https://aka.ms/aspire-credential).\n\n🤖 Build AI Applications: Explore the new [Microsoft Agent Framework](https://devblogs.microsoft.com/dotnet/introducing-microsoft-agent-framework-preview/) and [Microsoft.Extensions.AI](https://devblogs.microsoft.com/dotnet/introducing-microsoft-extensions-ai-preview/) to build intelligent applications.\n\nLet’s continue building, innovating, and empowering developers with .NET!",
  "FeedName": "Microsoft .NET Blog"
}
