{
  "Link": "https://www.arresteddevops.com/digging-into-security/",
  "ProcessedDate": "2025-08-29 10:12:36",
  "OutputDir": "_blogs",
  "Tags": [],
  "Title": "Digging Into Security With Kat Cosgrove",
  "Description": "Kat Cosgrove is back to talk about everyone’s favorite party topic: security. From container vulnerabilities to the chaos of patching, Matty and Kat dig into why “never not hot” feels like security’s permanent brand. Tune in for equal parts practical insight and DevOps-flavored sarcasm.",
  "PubDate": "2025-08-25T17:22:54+00:00",
  "EnhancedContent": "# Digging Into Security With Kat Cosgrove\n\nPosted on Monday, Aug 25, 2025\n\n![](https://www.arresteddevops.com/episode/img/digging-into-security-banner.png)\n\nKat Cosgrove is back to talk about everyone’s favorite party topic: security. From container vulnerabilities to the chaos of patching, Matty and Kat dig into why “never not hot” feels like security’s permanent brand. Tune in for equal parts practical insight and DevOps-flavored sarcasm.\n\n## Show Notes\n\nSecurity: the one topic that’s guaranteed to turn any DevOps conversation into a mix of fear, eye rolls, and nervous laughter. In this episode of Arrested DevOps, Matty welcomes back Kat Cosgrove to talk about the “never not hot” world of security and why it’s always lurking just over your shoulder (like that one compliance auditor who swears they’re just “observing”).\n\nKat and Matty cover:\n\n- Why vulnerabilities never seem to stop showing up in your containers (spoiler: they don’t).\n- How teams can respond without spiraling into full-blown panic.\n- The realities of securing Kubernetes and containerized environments (without pretending there’s a magic “easy button.”)\n- Why security culture matters as much as the tools you’re using.\n\nAlong the way, expect the usual mix of snark, sarcasm, and the occasional tangent about how everything in tech eventually becomes a security problem.\n\nIf you’ve ever patched the same vulnerability three times in a week, or found yourself yelling at a CVE like it’s a personal enemy, this one’s for you.\n\n## Guests\n\n![Kat Cosgrove](https://www.arresteddevops.com/img/guests/kcosgrove2.jpg)\n\n## [Kat Cosgrove](https://www.arresteddevops.com/guest/kcosgrove2/)\n\nKat is the Head of Developer Advocacy at Minimus, focused on the growth and nurturing of open source through authentic contribution. In particular, her specialties are approachable 101-level content and deep dives on the history of technology, with a focus on DevOps and cloud native. She was the Kubernetes Release Lead for 1.30 Uwubernetes, and currently serves as both the Release Team subproject owner and SIG Docs tech lead.\n\nWhen she’s not at a conference, she spends her time playing video games, watching horror movies, or reading science fiction, but her current hyperfixation is film photography. She lives with her cat, Espresso, who is the real brains behind the operation and actually ghostwriting all of her tweets.\n\nhttps://twitter.com/Dixie3Flatlinehttps://github.com/katcosgrovehttps://www.linkedin.com/in/katcosgrove/\n\n## Hosts\n\n![Matt Stratton](https://www.arresteddevops.com/img/matt.png)\n\n## [Matt Stratton](https://www.arresteddevops.com/host/mstratton/) (he/him)\n\nMatty Stratton is a Solution Architect at [Turbot](https://turbot.com), a well-known member of the DevOps community, and a global organizer of the [DevOpsDays](https://www.devopsdays.org/) set of conferences.\n\nMatty has over 20 years of experience in IT operations and is a sought-after speaker internationally, presenting at Agile, DevOps, and cloud engineering focused events worldwide. Demonstrating his keen insight into the changing landscape of technology, he recently changed his license plate from `DEVOPS` to `KUBECTL` .\n\nHe lives in Chicago and has three awesome kids, whom he loves just a little bit more than he loves Diet Coke.\n\nhttp://www.mattstratton.com/https://twitter.com/mattstrattonhttps://github.com/mattstrattonhttps://www.linkedin.com/in/mattstratton/https://www.instagram.com/mattstrattonhttps://www.youtube.com/mugsy1274https://twitch.tv/themattstratton\n\n[![flyio](https://www.arresteddevops.com/img/sponsors/flyio.png)](https://fly.io/?utm_source=arresteddevops)",
  "FeedLevelAuthor": "Arrested DevOps",
  "FeedName": "Arrested DevOps",
  "Author": "Arrested DevOps",
  "FeedUrl": "https://www.arresteddevops.com/episode/index.xml"
}
