{
  "FeedName": "Microsoft Tech Community",
  "OutputDir": "_community",
  "Link": "https://techcommunity.microsoft.com/t5/azure-infrastructure-blog/announcing-microsoft-azure-network-adapter-mana-support-for/ba-p/4493279",
  "EnhancedContent": "As a leader in cloud infrastructure, Microsoft ensures that Azure’s IaaS customers always have access to the latest hardware. Our goal is to consistently deliver technology to support business critical workloads with world class efficiency, reliability, and security. Customers benefit from cutting-edge performance enhancements and features, helping them to future proof their workloads while maintaining business continuity.\n\nIn February 2026, Azure will be deploying the Microsoft Azure Network Adapter (MANA) for existing VM Size Families. The intent is to provide the benefits of new server hardware to customers of existing VM SKUs as they work towards migrating to newer SKUs. The deployments will be based on capacity needs and won’t be restricted by region. Once the hardware is available in a region, VMs can be deployed to it as needed.\n\nWorkloads on operating systems which fully support MANA will benefit from sub-second Network Interface Card (NIC) firmware upgrades, higher throughput, lower latency, increased Security and Azure Boost-enabled data path accelerations. If your workload doesn't support MANA today, you'll still be able to access Azure’s network on MANA enabled SKUs, but performance will be comparable to previous generation (non-MANA) hardware. Check out the [Azure Boost Overview](https://learn.microsoft.com/en-us/azure/azure-boost/overview) and the [Microsoft Azure Network Adapter (MANA) overview](https://learn.microsoft.com/en-us/azure/virtual-network/accelerated-networking-mana-overview) for more detailed information and OS compatibility.\n\nTo determine whether your VMs are impacted and what actions (if any) you should take, start with [MANA support for existing VM SKUs](https://aka.ms/manasupportforexistingvmfamilynva). This article provides additional information about which VM Sizes are eligible to be deployed on the new MANA-enabled hardware, what actions (if any) you should take, and how to determine if the workload has been deployed on MANA-enabled hardware.\n\nUpdated Feb 06, 2026\n\nVersion 1.0\n\n[azure hardware infrastructure](/tag/azure%20hardware%20infrastructure?nodeId=board%3AAzureInfrastructureBlog)\n\n[updates](/tag/updates?nodeId=board%3AAzureInfrastructureBlog)\n\n[!\\[ali_sheriff&#x27;s avatar\\](https://techcommunity.microsoft.com/t5/s/gxcuf89792/images/dS0zMzUzNjUyLXRhRjRHTQ?image-coordinates=0%2C0%2C834%2C833&amp;image-dimensions=50x50)](/users/ali_sheriff/3353652) [ali_sheriff](/users/ali_sheriff/3353652) ![Icon for Microsoft rank](https://techcommunity.microsoft.com/t5/s/gxcuf89792/images/cmstNC05WEo0blc?image-dimensions=100x16&amp;constrain-image=true)Microsoft\n\nJoined January 29, 2026\n\n[View Profile](/users/ali_sheriff/3353652)\n\n/category/azure/blog/azureinfrastructureblog [Azure Infrastructure Blog](/category/azure/blog/azureinfrastructureblog) Follow this blog board to get notified when there's new activity",
  "ProcessedDate": "2026-02-07 00:08:00",
  "PubDate": "2026-02-06T23:45:42+00:00",
  "FeedLevelAuthor": "rss.livelink.threads-in-node",
  "FeedUrl": "https://techcommunity.microsoft.com/t5/s/gxcuf89792/rss/Category?category.id=Azure",
  "Title": "Announcing Microsoft Azure Network Adapter (MANA) support for Existing VM SKUs",
  "Tags": [],
  "Author": "ali_sheriff",
  "Description": "As a leader in cloud infrastructure, Microsoft ensures that Azure’s IaaS customers always have access to the latest hardware. Our goal is to consistently deliver technology to support business critical workloads with world class efficiency, reliability, and security. Customers benefit from cutting-edge performance enhancements and features, helping them to future proof their workloads while maintaining business continuity.\n\nIn February 2026, Azure will be deploying the Microsoft Azure Network Adapter (MANA) for existing VM Size Families. The intent is to provide the benefits of new server hardware to customers of existing VM SKUs as they work towards migrating to newer SKUs. The deployments will be based on capacity needs and won’t be restricted by region. Once the hardware is available in a region, VMs can be deployed to it as needed.\n\nWorkloads on operating systems which fully support MANA will benefit from sub-second Network Interface Card (NIC) firmware upgrades, higher throughput, lower latency, increased Security and Azure Boost-enabled data path accelerations. If your workload doesn't support MANA today, you'll still be able to access Azure’s network on MANA enabled SKUs, but performance will be comparable to previous generation (non-MANA) hardware. Check out the [Azure Boost Overview](https://learn.microsoft.com/en-us/azure/azure-boost/overview) and the [Microsoft Azure Network Adapter (MANA) overview](https://learn.microsoft.com/en-us/azure/virtual-network/accelerated-networking-mana-overview) for more detailed information and OS compatibility.\n\nTo determine whether your VMs are impacted and what actions (if any) you should take, start with [MANA support for existing VM SKUs](https://aka.ms/manasupportforexistingvmfamilynva). This article provides additional information about which VM Sizes are eligible to be deployed on the new MANA-enabled hardware, what actions (if any) you should take, and how to determine if the workload has been deployed on MANA-enabled hardware."
}
