{
  "Tags": [],
  "Author": "Lakshya_Jalan",
  "FeedUrl": "https://techcommunity.microsoft.com/t5/s/gxcuf89792/rss/Category?category.id=Azure",
  "Link": "https://techcommunity.microsoft.com/t5/azure-storage-blog/azure-migrate-now-supporting-premium-ssd-v2-ultra-and-zrs-disks/ba-p/4495332",
  "ProcessedDate": "2026-02-18 17:24:13",
  "PubDate": "2026-02-18T17:22:53+00:00",
  "OutputDir": "_community",
  "EnhancedContent": "We are excited to announce that we have added assessment and migration support for [Premium SSD v2,](https://learn.microsoft.com/en-us/azure/virtual-machines/disks-types)[Ultra Disk](https://learn.microsoft.com/en-us/azure/virtual-machines/disks-types) and [ZRS Disks](https://learn.microsoft.com/en-us/azure/virtual-machines/disks-redundancy#zone-redundant-storage-for-managed-disks) as storage options in Azure Migrate, with [Premium SSD v2](https://learn.microsoft.com/en-us/azure/virtual-machines/disks-types) and [ZRS Disks](https://learn.microsoft.com/en-us/azure/virtual-machines/disks-redundancy#zone-redundant-storage-for-managed-disks) now Generally Available and [Ultra Disk](https://learn.microsoft.com/en-us/azure/virtual-machines/disks-types) in Public Preview. This further enhances the assessment and migration experience Azure Migrate offers and allows you to bring your mission critical workloads to these key Azure Storage offerings seamlessly.\n\n# What’s New\n\n## Additional Assessment targets:  Premium SSD v2 and Ultra Disks\n\nAs part of the migration journey to the cloud, Azure Migrate makes recommendations on what cloud resources to move your workloads to. Post successful discovery of on-prem workloads, Azure Migrate utilizes multiple parameters like size, IOPS, and throughput to make target recommendations in Azure. Instead of just static sizing, assessments can map actual performance demand to Azure VM and disk SKUs, optimizing performance, resiliency, and total cost of ownership to give you a tailored recommendation that fits your cloud migration journey.\n\nWith today’s announcement, we are adding more supported disks to Azure Migrate, providing you with improved guidance to ensure that you land on the resources in Azure that align with your goals.\n\nIf you are looking to migrate your demanding on-premises applications and workloads to Azure, you will benefit from these advanced disk options, which come with greater flexibility and enhanced performance. For example, Premium SSD v2 disks decouple capacity from performance, allowing you to dial IOPS and throughput precisely to your workload’s needs. For high-end scenarios, Ultra Disks offer the highest performance among Azure managed disks, while ZRS disks provide zonally redundant storage to further protect your data. With these included in Azure Migrate’s assessment engine, you end up with a right‑sized, data‑driven target configuration that aligns Azure storage choices with how workloads actually run.\n\nBelow is a snippet of how the assessment recommendations appear in Azure Migrate for Premium V2 SSD disks. Customers can get details on the disk type, provisioned IOPS, throughput, cost, and seamlessly migrate using the assessment to the recommended target.\n\nDetailed view of Azure Managed disk recommendations for source on-prem disks in an assessment.\n\n## Migrating to Premium SSD v2 and Ultra Disks in Azure Migrate\n\nWhen Premium SSD v2 or Ultra disks are identified as the optimal targets based on workload characteristics during the assessment phase, they can be auto-populated seamlessly into the migration process. This workflow accelerates the lift-and-shift of on-prem disks to Azure’s high performance managed disks. Below is a snippet from the replication step during migration:\n\n## Assessing and Migrating to ZRS Disks in Azure Migrate\n\nAzure Migrate also has enhanced resiliency by supporting migration to ZRS Disks during Migration. [Zone-Redundant Storage (ZRS) for Azure Disks](https://learn.microsoft.com/en-us/azure/virtual-machines/disks-redundancy#zone-redundant-storage-for-managed-disks) synchronously replicates data across three physically separate availability zones within a region - each with independent power, cooling, and networking - enhancing Disk availability and resiliency.\n\nWhile creating Assessments in Azure Migrate, you can configure a range of target preferences, including the newly introduced option to enable zone-redundant storage (ZRS). You can opt-in to enable ZRS Disk recommendations by editing the Server (Machine) default settings in the Advanced settings blade.\n\nSince the preview announcement for these capabilities, recommendations for Ultra, Premium v2 and ZRS Disks have led to petabytes of data being successfully migrated into Azure. Below is a quote from our Premium v2 (Pv2) customer that was provided during the preview:\n\n*\"Through this preview, we have Pv2 disks recommendations in place of Pv1, which is beneficial for our estate during migration in terms of both cost and performance. We are now awaiting General Availability \"*\n\n*– Yogesh Patil, Cloud Enterprise Architect, Tata Consultancy Services (TCS)*\n\nWith these added capabilities, Azure Migrate and Azure disk storage are more ready than ever for migrating your most demanding and mission-critical workloads. Learn more about [Azure Migrate](https://azure.microsoft.com/migration) and for expert migration help, please try [Azure Accelerate.](https://azure.microsoft.com/en-us/solutions/azure-accelerate/) You can also contact your preferred partner or [Microsoft field](https://oneask.microsoft.com/) for next steps. Get started in [Azure](https://ms.portal.azure.com/#view/Microsoft_Azure_Migrate/AmhManageMigrateProjects.ReactView) today!\n\nPublished Feb 18, 2026\n\nVersion 1.0\n\n[azure](/tag/azure?nodeId=board%3AAzureStorageBlog)\n\n[azure disks](/tag/azure%20disks?nodeId=board%3AAzureStorageBlog)\n\n[azure migrate](/tag/azure%20migrate?nodeId=board%3AAzureStorageBlog)\n\n[managed disks](/tag/managed%20disks?nodeId=board%3AAzureStorageBlog)\n\n[!\\[Lakshya_Jalan&#x27;s avatar\\](https://techcommunity.microsoft.com/t5/s/gxcuf89792/m_assets/avatars/default/avatar-5.svg?image-dimensions=50x50)](/users/lakshya_jalan/3335140) [Lakshya_Jalan](/users/lakshya_jalan/3335140) ![Icon for Microsoft rank](https://techcommunity.microsoft.com/t5/s/gxcuf89792/images/cmstNC05WEo0blc?image-dimensions=100x16&amp;constrain-image=true)Microsoft\n\nJoined January 14, 2026\n\n[View Profile](/users/lakshya_jalan/3335140)\n\n/category/azure/blog/azurestorageblog [Azure Storage Blog](/category/azure/blog/azurestorageblog) Follow this blog board to get notified when there's new activity",
  "Title": "Azure Migrate: Now Supporting Premium SSD V2, Ultra and ZRS Disks as Targets",
  "Description": "We are excited to announce that we have added assessment and migration support for [Premium SSD v2,](https://learn.microsoft.com/en-us/azure/virtual-machines/disks-types)[Ultra Disk](https://learn.microsoft.com/en-us/azure/virtual-machines/disks-types) and [ZRS Disks](https://learn.microsoft.com/en-us/azure/virtual-machines/disks-redundancy#zone-redundant-storage-for-managed-disks) as storage options in Azure Migrate, with [Premium SSD v2](https://learn.microsoft.com/en-us/azure/virtual-machines/disks-types) and [ZRS Disks](https://learn.microsoft.com/en-us/azure/virtual-machines/disks-redundancy#zone-redundant-storage-for-managed-disks) now Generally Available and [Ultra Disk](https://learn.microsoft.com/en-us/azure/virtual-machines/disks-types) in Public Preview. This further enhances the assessment and migration experience Azure Migrate offers and allows you to bring your mission critical workloads to these key Azure Storage offerings seamlessly.\n\n# What’s New\n\n## Additional Assessment targets: Premium SSD v2 and Ultra Disks\n\nAs part of the migration journey to the cloud, Azure Migrate makes recommendations on what cloud resources to move your workloads to. Post successful discovery of on-prem workloads, Azure Migrate utilizes multiple parameters like size, IOPS, and throughput to make target recommendations in Azure. Instead of just static sizing, assessments can map actual performance demand to Azure VM and disk SKUs, optimizing performance, resiliency, and total cost of ownership to give you a tailored recommendation that fits your cloud migration journey.\n\nWith today’s announcement, we are adding more supported disks to Azure Migrate, providing you with improved guidance to ensure that you land on the resources in Azure that align with your goals.\n\nIf you are looking to migrate your demanding on-premises applications and workloads to Azure, you will benefit from these advanced disk options, which come with greater flexibility and enhanced performance. For example, Premium SSD v2 disks decouple capacity from performance, allowing you to dial IOPS and throughput precisely to your workload’s needs. For high-end scenarios, Ultra Disks offer the highest performance among Azure managed disks, while ZRS disks provide zonally redundant storage to further protect your data. With these included in Azure Migrate’s assessment engine, you end up with a right‑sized, data‑driven target configuration that aligns Azure storage choices with how workloads actually run.\n\nBelow is a snippet of how the assessment recommendations appear in Azure Migrate for Premium V2 SSD disks. Customers can get details on the disk type, provisioned IOPS, throughput, cost, and seamlessly migrate using the assessment to the recommended target.\n\n![]()Detailed view of Azure Managed disk recommendations for source on-prem disks in an assessment.\n\n## Migrating to Premium SSD v2 and Ultra Disks in Azure Migrate\n\nWhen Premium SSD v2 or Ultra disks are identified as the optimal targets based on workload characteristics during the assessment phase, they can be auto-populated seamlessly into the migration process. This workflow accelerates the lift-and-shift of on-prem disks to Azure’s high performance managed disks. Below is a snippet from the replication step during migration:\n\n![]()\n\n## Assessing and Migrating to ZRS Disks in Azure Migrate\n\nAzure Migrate also has enhanced resiliency by supporting migration to ZRS Disks during Migration. [Zone-Redundant Storage (ZRS) for Azure Disks](https://learn.microsoft.com/en-us/azure/virtual-machines/disks-redundancy#zone-redundant-storage-for-managed-disks) synchronously replicates data across three physically separate availability zones within a region - each with independent power, cooling, and networking - enhancing Disk availability and resiliency.\n\nWhile creating Assessments in Azure Migrate, you can configure a range of target preferences, including the newly introduced option to enable zone-redundant storage (ZRS). You can opt-in to enable ZRS Disk recommendations by editing the Server (Machine) default settings in the Advanced settings blade.\n\n![]()\n\nSince the preview announcement for these capabilities, recommendations for Ultra, Premium v2 and ZRS Disks have led to petabytes of data being successfully migrated into Azure. Below is a quote from our Premium v2 (Pv2) customer that was provided during the preview:\n\n*\"Through this preview, we have Pv2 disks recommendations in place of Pv1, which is beneficial for our estate during migration in terms of both cost and performance. We are now awaiting General Availability \"*\n\n*– Yogesh Patil, Cloud Enterprise Architect, Tata Consultancy Services (TCS)*\n\nWith these added capabilities, Azure Migrate and Azure disk storage are more ready than ever for migrating your most demanding and mission-critical workloads. Learn more about [Azure Migrate](https://azure.microsoft.com/migration) and for expert migration help, please try [Azure Accelerate.](https://azure.microsoft.com/en-us/solutions/azure-accelerate/) You can also contact your preferred partner or [Microsoft field](https://oneask.microsoft.com/) for next steps. Get started in [Azure](https://ms.portal.azure.com/#view/Microsoft_Azure_Migrate/AmhManageMigrateProjects.ReactView) today!",
  "FeedName": "Microsoft Tech Community",
  "FeedLevelAuthor": "rss.livelink.threads-in-node"
}
