{
  "FeedUrl": "https://techcommunity.microsoft.com/t5/s/gxcuf89792/rss/Category?category.id=Azure",
  "Title": "Azure NetApp Files Elastic ZRS service level - File Storage High Availability Made Easy",
  "Link": "https://techcommunity.microsoft.com/t5/azure-architecture-blog/azure-netapp-files-elastic-zrs-service-level-file-storage-high/ba-p/4484235",
  "FeedName": "Microsoft Tech Community",
  "OutputDir": "_community",
  "EnhancedContent": "# Table of Contents\n\nAbstract\n\nIntroduction\n\nWhy it matters\n\nHow it works\n\nWhat are we enabling?\n\nUse Cases\n\nConclusion\n\nNext steps\n\nLearn more\n\n# Abstract\n\nThis article introduces Azure NetApp Files Elastic zone-redundant storage service level (Azure NetApp Files Elastic ZRS), a high-availability solution that synchronously replicates data across multiple Azure Availability Zones within a region. Leveraging Azure’s ZRS architecture to ensure zero data loss and minimal downtime by automatically redirecting traffic during outages while maintaining a single volume interface. Features include support for NFS/SMB protocols, snapshots, clones, encryption, and backups, providing seamless multi-AZ redundancy and operational simplicity. Real-world use cases include supporting mission-critical applications in sectors like finance, healthcare, and government, as well as SAP shared files, general file shares, financial services platforms, Kubernetes workloads, and compliance applications.\n\n**Co-authors:**\n\n- [Rich Crofford](https://www.linkedin.com/in/richard-crofford-05135b8/), Azure NetApp Files Technical Marketing Engineer\n\n# Introduction\n\nModern organizations increasingly require robust in-region resilience for their critical applications and data. Even a single Availability Zone outage must not disrupt business operations or cause data loss.  Prior to the introduction of the Azure NetApp Files Elastic zone‑redundant storage service level or Elastic ZRS for short achieving this level of resiliency often required workarounds such as maintaining duplicate volumes in another zone, setting up asynchronous cross‑zone or file‑based replication, or, worse, deploying pacemaker file‑server clusters.  Those approaches provided additional protection but came with significant complexity, potential latency impacts, and added cost (for example, paying for idle standby capacity), all while needing to adhere to strict data residency requirements.\n\nAzure NetApp Files Elastic ZRS was introduced to address these challenges by building multi-AZ high availability directly into the Azure NetApp Files service. It is a new (“zone-redundant”) service level that you can select when creating an Azure NetApp Files capacity pool. With Azure NetApp Files Elastic ZRS, high availability becomes a built-in feature of the storage service rather than an external architectural concern. You simply provision and mount your file volume as usual with no special configuration beyond choosing the new service level, and Azure handles the rest behind the scenes. The platform synchronously replicates your data to multiple zones and coordinates rapid failover if needed, presenting a single logical volume to your applications that’s always up to date and highly available. This turnkey multi-AZ redundancy ensures you can meet the most demanding uptime requirements and compliance mandates without deploying custom solutions or altering your application code. It’s especially valuable for industries like finance, healthcare, and government that demand both single-region data sovereignty and the highest level of availability for their workloads.\n\nDiscover how Azure NetApp Files Elastic zone‑redundant storage elevates mission‑critical data protection. This Quick Bytes video offers a brief, visual overview before diving into the details below.\n\n# Why it matters\n\nDowntime or data loss in the cloud can be extremely costly and not just in dollars, but in lost user trust and business continuity. Azure NetApp Files Elastic ZRS directly addresses the need for robust in-region resiliency for mission-critical applications. Below are some key reasons to consider Azure NetApp Files Elastic ZRS:\n\n- **Protects Against AZ Failures:** An Availability Zone outage, while rare, can happen (due to power loss, network issues, natural disasters, etc.). Azure NetApp Files Elastic ZRS ensures even this worst-case scenario does not take down your application. Your storage stays online with no loss of committed data, greatly mitigating a major cloud risk.\n- **Continuous Operation**: For businesses that run 24x7 services such as e-commerce sites, financial trading platforms, or healthcare systems, even minutes of downtime can violate SLAs or regulatory requirements. Azure NetApp Files Elastic ZRS volumes provide a Recovery Point Objective (RPO) of zero, and a Recovery Time Objective (RTO) of near zero. This keeps critical systems running through infrastructure hiccups that would otherwise cause outages.\n- **No Application Changes:** You can achieve this high availability without changing your application architecture. There is no need for applications to implement custom scripts or clustering at the storage layer. The storage infrastructure itself provides the HA, so apps see a single volume and mount point before, during, and after failover. This transparency makes adoption easier and reduces complexity in application design.\n- **Rich Enterprise Data Management capabilities:** Instant, space-efficient snapshots, writable clones, encryption at rest, and integrated backups are available. Migration assistant will soon simplify data movement from on-premises or other ONTAP® systems, and many more Azure NetApp Files features are planned.\n- **Cost-effective high availability:**Achieving multi-AZ redundancy with Azure NetApp Files Elastic ZRS is more economical than maintaining identical standby volumes or complex pacemaker file server clusters. All storage capacity in an Azure NetApp Files Elastic ZRS volume is actively used (no idle secondary instances), so you pay for one resilient volume instead of two. This improves your storage utilization and can lower the total cost of ownership for HA. You avoid the extra egress or administrative costs associated with external replication solutions, making always-on storage more affordable.\n- **Metadata Performance:** Beyond consistent throughput, Azure NetApp Files Elastic ZRS redefines performance for metadata-heavy workloads. This capability is critical for SAP shared files and similar environments where metadata operations drive application responsiveness. Its shared QoS architecture dynamically allocates IOPS across volumes to maintain low-latency, metadata-intensive operations consistently even across multiple availability zones.\n- **Region of choice for Cross-Region Replication:**Soon, Azure NetApp Files Elastic ZRS will offer the flexibility to choose custom region pairs for cross-region replication, meeting strict compliance and disaster recovery requirements for large enterprise customers. This capability ensures business continuity while aligning with unique geographic or regulatory needs.\n- **Zone Flexibility for Resilience:** With Azure NetApp Files Elastic ZRS, you can choose your preferred Azure Availability Zone for primary deployment while benefiting from synchronous replication across zones. This gives you control over workload placement without compromising high availability or disaster recovery.\n\n# How it works\n\nAzure NetApp Files Elastic ZRS, built on Azure’s Zone-redundant storage (ZRS) architecture and compute infrastructure, uses synchronous replication across multiple availability zones and automated failover at the storage platform level. This approach ensures your data remains consistent and available, while the underlying architecture maintains consistent performance (especially for metadata-heavy workloads) and operational simplicity.\n\n**Synchronous Multi-AZ Replication:** The cornerstone of Azure NetApp Files Elastic ZRS is synchronous replication across zones. When your application writes data, Azure NetApp Files simultaneously writes that data across availability zones within one region before acknowledging the write back to the client. This simultaneous mirroring guarantees that each zone’s copy is always identical. If AZ-1 is your primary and it fails mid-transaction, the writes in AZ-2 and AZ-3 already went through, so there’s no gap or data inconsistency in other words, RPO = 0 (zero data loss).\n\n**Transparent Failover:** If one availability zone goes offline, Azure NetApp Files Elastic ZRS automatically detects it and triggers a storage failover. The failover is transparent to your applications, and the volumes mount target IP remains the same, so clients do not need to remount or change anything. I/O is simply redirected to one of the healthy zone copies, and operations continue. This allows for a Recovery Time Objective (RTO) near zero for zone failures. Applications might experience a brief pause during the switchover, but not a prolonged outage. Thanks to this automated failover, critical workloads can ride through an AZ outage with minimal disruption.\n\nDescription:\n\n- The application writes to the primary zone (AZ 1)\n- Data is synchronously replicated to AZ 2 and AZ 3\n- If AZ 1 fails (marked with a red “X”), the application’s I/O is automatically redirected to AZ 2\n- Failover is transparent and requires no manual intervention\n\n**Zero Complexity**: Perhaps one of the biggest operational benefits is how simple Azure NetApp Files Elastic ZRS is to use. To enable multi-AZ redundancy, you do not need to architect anything special like clustering or custom scripts. You just choose “Zone-redundant” as the service level when creating a new capacity pool, then create volumes in that pool normally. Azure takes care of provisioning and coordinating synchronization. All the replication and failover are fully managed by the platform. This significantly reduces the operational burden and chance of error. By eliminating the need for DIY solutions (like maintaining dual volumes and manual failover procedures), organizations can cut administrative overhead by an estimated ~65% with Azure NetApp Files Elastic ZRS. High availability becomes essentially a one-click feature, rather than a complex project.\n\n**Optimized latency for reads:** Azure NetApp Files Elastic ZRS enables alignment of a volumes primary zone with the compute zone, ensuring read operations are served directly from the copy in the local zone. This approach minimizes application read latency by eliminating the need for data to cross availability zone boundaries under normal conditions. Co-locating storage and compute enhances performance for applications requiring high throughput, while maintaining robust cross-zone protection.\n\n# What are we enabling?\n\nWith Azure NetApp Files Elastic ZRS, organizations are now positioned to reliably meet stringent uptime objectives and regulatory mandates, including requirements for single-region data residency. This new service level enables uninterrupted operations within a single region, even in the event of a datacenter-level outage. As a result, enterprises can confidently deploy critical and demanding workloads, assured that the underlying storage infrastructure will maintain service continuity during Availability Zone disruptions.\n\nBeyond enhanced resiliency, Azure NetApp Files Elastic ZRS offers significant flexibility in storage provisioning and utilization. Support for volumes as small as 1 GiB allows for precise resource allocation, allowing organizations to tailor storage to the specific needs of each workload. This ensures that both small-scale applications and development or test environments can take advantage of zone-redundant protection without unnecessary over-provisioning, while large-scale enterprise datasets continue to benefit from seamless multi-AZ redundancy. The ability to deploy right-sized volumes ensures efficient use of resources and cost control, making highly available storage practical for a broad range of scenarios.\n\nShared QoS adds another layer of efficiency and performance optimization. In a shared QoS capacity pool, all volumes draw from a common throughput pool rather than fixed per-volume limits. Throughput scales linearly with capacity pool size for example, a zone-redundant capacity pool provides 32 MiB/s per TiB of provisioned capacity (a 128 TiB pool offers 4,096 MiB/s total). Volumes can consume throughput on demand up to the capacity pool’s total limit, allowing dynamic allocation without manual tuning. Azure NetApp Files manages this intelligently to ensure each volume meets its performance targets for throughput and latency while staying within the pool’s overall budget. This flexible, shared performance model is unique to the Elastic zone-redundant storage service level, making it easy to optimize throughput for workloads that are heavy on metadata or require a mix of different file operations.\n\nWith Azure NetApp Files Elastic ZRS, you can ensure strong data availability and smooth operations. The platform removes the need for manual failover and extra standby resources, making management simpler and improving how resources are used. This enables technology leaders to focus on driving business goals, knowing that reliable, high-performance storage will be maintained even if zone-level failures occur.\n\nCurious to see how it all comes together? The following walkthrough takes you inside the Azure portal to see Azure NetApp Files Elastic ZRS in action and how zone‑level resilience is handled automatically by the platform.\n\n# Use Cases\n\nBecause of its always-on design and ease of use, Azure NetApp Files Elastic ZRS is ideal for a variety of mission-critical and data-intensive workloads that require zone-redundant storage. Here are several real-world use cases where Azure NetApp Files Elastic ZRS provides significant value:\n\n| **Use Case** | **How Azure NetApp Files Elastic ZRS Helps** | | --- | --- | | **SAP shared files** | Delivers zero data loss and fast failover for SAP clusters meeting strict HA demands and keeping SAP shared files workloads online with ease. | | **General file shares** | Corporate user data including home directories or departmental file shares, remain accessible even during zone outages, ensuring seamless employee productivity and business continuity. | | **Financial Services & Trading Platforms** | Delivers zero data loss and nonstop trading even in a zone outage, so financial apps stay compliant, and customers stay confident. | | **Kubernetes/Containerized Applications** | Keeps Kubernetes and container workloads running even during zone outages by instantly synchronizing data across zones and enabling rapid, automated failover. Your stateful apps stay online with zero data loss and minimal downtime. | | **Business-Critical Applications** | Ensure nonstop access to tax and compliance apps even if an AZ fails as data stays online with zero outages or lost transactions. |\n\n# Conclusion\n\nAzure NetApp Files Elastic ZRS establishes a new benchmark for simple, reliable, and highly available file storage in the cloud. By integrating Azure’s redundant infrastructure with Azure NetApp Files’ enterprise-grade storage capabilities, it ensures uninterrupted access to data while reducing complexity.\n\nIf you have mission-critical data in Azure that needs to stay available through any single AZ failure, Azure NetApp Files Elastic ZRS is an option to seriously consider.\n\n# Next steps\n\n- **Check Region Availability:** Azure NetApp Files Elastic ZRS is initially available in select Azure regions including Australia East, Central US, South Central US, Canada Central, West US 3, and West Europe, with more regions coming soon. Verify that your region supports [Azure NetApp Files zone-redundant storage service level](https://learn.microsoft.com/azure/azure-netapp-files/elastic-zone-redundant-concept#supported-regions).\n- **Enable the Service:** At the time of writing, Azure NetApp Files Elastic ZRS is in public preview. You will need to [register](https://learn.microsoft.com/azure/azure-netapp-files/elastic-account#register-for-the-elastic-zone-redundant-storage) for the preview. Once enabled, create an “NetApp Elastic” account, then create a new capacity pool with the “Zone redundant” service level, then create volumes in that pool as you normally would.\n- **Stay Informed:** Keep an eye on the [Azure NetApp Files documentation](https://learn.microsoft.com/azure/azure-netapp-files/) and the “[What’s New](https://learn.microsoft.com/azure/azure-netapp-files/whats-new)” announcements for updates on Azure NetApp Files Elastic ZRS general availability and new region support. As the service level evolves toward GA, final performance profiles and pricing will be confirmed (preview pricing is subject to change).\n\nBy implementing Azure NetApp Files Elastic ZRS, you can significantly harden your cloud storage against zone-level failures with minimal effort. For cloud solution architects and IT managers, it offers a compelling way to meet uptime commitments and protect critical data all while using Azure-native tooling and familiar Azure NetApp Files workflows. In summary, Azure NetApp Files Elastic ZRS brings highly available storage into Azure as a first-class capability. It allows you to run your most important applications with confidence that your data is safe, continuously available, and ready for whatever comes next.\n\n# Learn more\n\n- [What's new in Azure NetApp Files | January 2025](https://learn.microsoft.com/azure/azure-netapp-files/whats-new#january-2026)\n- [Understand Azure NetApp Files Elastic zone-redundant service level](https://learn.microsoft.com/azure/azure-netapp-files/elastic-zone-redundant-concept)\n- [Create a NetApp Elastic account](https://learn.microsoft.com/azure/azure-netapp-files/elastic-account)\n- [Set up an elastic capacity pool](https://learn.microsoft.com/azure/azure-netapp-files/elastic-capacity-pool-task)\n- [Azure NetApp Files resource limits](https://learn.microsoft.com/azure/azure-netapp-files/azure-netapp-files-resource-limits)\n\nUpdated Jan 27, 2026\n\nVersion 1.0\n\n[application](/tag/application?nodeId=board%3AAzureArchitectureBlog)\n\n[infrastructure](/tag/infrastructure?nodeId=board%3AAzureArchitectureBlog)\n\n[integration](/tag/integration?nodeId=board%3AAzureArchitectureBlog)\n\n[sap on azure](/tag/sap%20on%20azure?nodeId=board%3AAzureArchitectureBlog)\n\n[well architected](/tag/well%20architected?nodeId=board%3AAzureArchitectureBlog)\n\n[!\\[GeertVanTeylingen&#x27;s avatar\\](https://techcommunity.microsoft.com/t5/s/gxcuf89792/images/dS0yMjI4NTMtMzI1MjMwaTVERUE2NzdCRkJBNjkxQzg?image-dimensions=50x50)](/users/geertvanteylingen/222853) [GeertVanTeylingen](/users/geertvanteylingen/222853) ![Icon for Microsoft rank](https://techcommunity.microsoft.com/t5/s/gxcuf89792/images/cmstNC05WEo0blc?image-dimensions=100x16&amp;constrain-image=true)Microsoft\n\nJoined October 04, 2018\n\n[View Profile](/users/geertvanteylingen/222853)\n\n/category/azure/blog/azurearchitectureblog [Azure Architecture Blog](/category/azure/blog/azurearchitectureblog) Follow this blog board to get notified when there's new activity",
  "Tags": [],
  "ProcessedDate": "2026-01-29 18:09:10",
  "Author": "GeertVanTeylingen",
  "PubDate": "2026-01-29T17:55:00+00:00",
  "FeedLevelAuthor": "rss.livelink.threads-in-node",
  "Description": "# Table of Contents\n\nAbstract\n\nIntroduction\n\nWhy it matters\n\nHow it works\n\nWhat are we enabling?\n\nUse Cases\n\nConclusion\n\nNext steps\n\nLearn more\n\n# Abstract\n\nThis article introduces Azure NetApp Files Elastic zone-redundant storage service level (Azure NetApp Files Elastic ZRS), a high-availability solution that synchronously replicates data across multiple Azure Availability Zones within a region. Leveraging Azure’s ZRS architecture to ensure zero data loss and minimal downtime by automatically redirecting traffic during outages while maintaining a single volume interface. Features include support for NFS/SMB protocols, snapshots, clones, encryption, and backups, providing seamless multi-AZ redundancy and operational simplicity. Real-world use cases include supporting mission-critical applications in sectors like finance, healthcare, and government, as well as SAP shared files, general file shares, financial services platforms, Kubernetes workloads, and compliance applications.\n\n**Co-authors:**\n\n- [Rich Crofford](https://www.linkedin.com/in/richard-crofford-05135b8/), Azure NetApp Files Technical Marketing Engineer\n\n# Introduction\n\nModern organizations increasingly require robust in-region resilience for their critical applications and data. Even a single Availability Zone outage must not disrupt business operations or cause data loss. Prior to the introduction of the Azure NetApp Files Elastic zone‑redundant storage service level or Elastic ZRS for short achieving this level of resiliency often required workarounds such as maintaining duplicate volumes in another zone, setting up asynchronous cross‑zone or file‑based replication, or, worse, deploying pacemaker file‑server clusters. Those approaches provided additional protection but came with significant complexity, potential latency impacts, and added cost (for example, paying for idle standby capacity), all while needing to adhere to strict data residency requirements.\n\n![]()\n\nAzure NetApp Files Elastic ZRS was introduced to address these challenges by building multi-AZ high availability directly into the Azure NetApp Files service. It is a new (“zone-redundant”) service level that you can select when creating an Azure NetApp Files capacity pool. With Azure NetApp Files Elastic ZRS, high availability becomes a built-in feature of the storage service rather than an external architectural concern. You simply provision and mount your file volume as usual with no special configuration beyond choosing the new service level, and Azure handles the rest behind the scenes. The platform synchronously replicates your data to multiple zones and coordinates rapid failover if needed, presenting a single logical volume to your applications that’s always up to date and highly available. This turnkey multi-AZ redundancy ensures you can meet the most demanding uptime requirements and compliance mandates without deploying custom solutions or altering your application code. It’s especially valuable for industries like finance, healthcare, and government that demand both single-region data sovereignty and the highest level of availability for their workloads.\n\nDiscover how Azure NetApp Files Elastic zone‑redundant storage elevates mission‑critical data protection. This Quick Bytes video offers a brief, visual overview before diving into the details below.\n\n# Why it matters\n\nDowntime or data loss in the cloud can be extremely costly and not just in dollars, but in lost user trust and business continuity. Azure NetApp Files Elastic ZRS directly addresses the need for robust in-region resiliency for mission-critical applications. Below are some key reasons to consider Azure NetApp Files Elastic ZRS:\n\n- **Protects Against AZ Failures:** An Availability Zone outage, while rare, can happen (due to power loss, network issues, natural disasters, etc.). Azure NetApp Files Elastic ZRS ensures even this worst-case scenario does not take down your application. Your storage stays online with no loss of committed data, greatly mitigating a major cloud risk.\n- **Continuous Operation**: For businesses that run 24x7 services such as e-commerce sites, financial trading platforms, or healthcare systems, even minutes of downtime can violate SLAs or regulatory requirements. Azure NetApp Files Elastic ZRS volumes provide a Recovery Point Objective (RPO) of zero, and a Recovery Time Objective (RTO) of near zero. This keeps critical systems running through infrastructure hiccups that would otherwise cause outages.\n- **No Application Changes:** You can achieve this high availability without changing your application architecture. There is no need for applications to implement custom scripts or clustering at the storage layer. The storage infrastructure itself provides the HA, so apps see a single volume and mount point before, during, and after failover. This transparency makes adoption easier and reduces complexity in application design.\n- **Rich Enterprise Data Management capabilities:** Instant, space-efficient snapshots, writable clones, encryption at rest, and integrated backups are available. Migration assistant will soon simplify data movement from on-premises or other ONTAP® systems, and many more Azure NetApp Files features are planned.\n- **Cost-effective high availability:** Achieving multi-AZ redundancy with Azure NetApp Files Elastic ZRS is more economical than maintaining identical standby volumes or complex pacemaker file server clusters. All storage capacity in an Azure NetApp Files Elastic ZRS volume is actively used (no idle secondary instances), so you pay for one resilient volume instead of two. This improves your storage utilization and can lower the total cost of ownership for HA. You avoid the extra egress or administrative costs associated with external replication solutions, making always-on storage more affordable.\n- **Metadata Performance:** Beyond consistent throughput, Azure NetApp Files Elastic ZRS redefines performance for metadata-heavy workloads. This capability is critical for SAP shared files and similar environments where metadata operations drive application responsiveness. Its shared QoS architecture dynamically allocates IOPS across volumes to maintain low-latency, metadata-intensive operations consistently even across multiple availability zones.\n- **Region of choice for Cross-Region Replication:** Soon, Azure NetApp Files Elastic ZRS will offer the flexibility to choose custom region pairs for cross-region replication, meeting strict compliance and disaster recovery requirements for large enterprise customers. This capability ensures business continuity while aligning with unique geographic or regulatory needs.\n- **Zone Flexibility for Resilience:** With Azure NetApp Files Elastic ZRS, you can choose your preferred Azure Availability Zone for primary deployment while benefiting from synchronous replication across zones. This gives you control over workload placement without compromising high availability or disaster recovery.\n\n# How it works\n\nAzure NetApp Files Elastic ZRS, built on Azure’s Zone-redundant storage (ZRS) architecture and compute infrastructure, uses synchronous replication across multiple availability zones and automated failover at the storage platform level. This approach ensures your data remains consistent and available, while the underlying architecture maintains consistent performance (especially for metadata-heavy workloads) and operational simplicity.\n\n**Synchronous Multi-AZ Replication:** The cornerstone of Azure NetApp Files Elastic ZRS is synchronous replication across zones. When your application writes data, Azure NetApp Files simultaneously writes that data across availability zones within one region before acknowledging the write back to the client. This simultaneous mirroring guarantees that each zone’s copy is always identical. If AZ-1 is your primary and it fails mid-transaction, the writes in AZ-2 and AZ-3 already went through, so there’s no gap or data inconsistency in other words, RPO = 0 (zero data loss).\n\n![]()\n\n**Transparent Failover:** If one availability zone goes offline, Azure NetApp Files Elastic ZRS automatically detects it and triggers a storage failover. The failover is transparent to your applications, and the volumes mount target IP remains the same, so clients do not need to remount or change anything. I/O is simply redirected to one of the healthy zone copies, and operations continue. This allows for a Recovery Time Objective (RTO) near zero for zone failures. Applications might experience a brief pause during the switchover, but not a prolonged outage. Thanks to this automated failover, critical workloads can ride through an AZ outage with minimal disruption.\n\n![]()\n\nDescription:\n\n- The application writes to the primary zone (AZ 1)\n- Data is synchronously replicated to AZ 2 and AZ 3\n- If AZ 1 fails (marked with a red “X”), the application’s I/O is automatically redirected to AZ 2\n- Failover is transparent and requires no manual intervention\n\n**Zero Complexity**: Perhaps one of the biggest operational benefits is how simple Azure NetApp Files Elastic ZRS is to use. To enable multi-AZ redundancy, you do not need to architect anything special like clustering or custom scripts. You just choose “Zone-redundant” as the service level when creating a new capacity pool, then create volumes in that pool normally. Azure takes care of provisioning and coordinating synchronization. All the replication and failover are fully managed by the platform. This significantly reduces the operational burden and chance of error. By eliminating the need for DIY solutions (like maintaining dual volumes and manual failover procedures), organizations can cut administrative overhead by an estimated ~65% with Azure NetApp Files Elastic ZRS. High availability becomes essentially a one-click feature, rather than a complex project.\n\n**Optimized latency for reads:** Azure NetApp Files Elastic ZRS enables alignment of a volumes primary zone with the compute zone, ensuring read operations are served directly from the copy in the local zone. This approach minimizes application read latency by eliminating the need for data to cross availability zone boundaries under normal conditions. Co-locating storage and compute enhances performance for applications requiring high throughput, while maintaining robust cross-zone protection.\n\n# What are we enabling?\n\nWith Azure NetApp Files Elastic ZRS, organizations are now positioned to reliably meet stringent uptime objectives and regulatory mandates, including requirements for single-region data residency. This new service level enables uninterrupted operations within a single region, even in the event of a datacenter-level outage. As a result, enterprises can confidently deploy critical and demanding workloads, assured that the underlying storage infrastructure will maintain service continuity during Availability Zone disruptions.\n\nBeyond enhanced resiliency, Azure NetApp Files Elastic ZRS offers significant flexibility in storage provisioning and utilization. Support for volumes as small as 1 GiB allows for precise resource allocation, allowing organizations to tailor storage to the specific needs of each workload. This ensures that both small-scale applications and development or test environments can take advantage of zone-redundant protection without unnecessary over-provisioning, while large-scale enterprise datasets continue to benefit from seamless multi-AZ redundancy. The ability to deploy right-sized volumes ensures efficient use of resources and cost control, making highly available storage practical for a broad range of scenarios.\n\nShared QoS adds another layer of efficiency and performance optimization. In a shared QoS capacity pool, all volumes draw from a common throughput pool rather than fixed per-volume limits. Throughput scales linearly with capacity pool size for example, a zone-redundant capacity pool provides 32 MiB/s per TiB of provisioned capacity (a 128 TiB pool offers 4,096 MiB/s total). Volumes can consume throughput on demand up to the capacity pool’s total limit, allowing dynamic allocation without manual tuning. Azure NetApp Files manages this intelligently to ensure each volume meets its performance targets for throughput and latency while staying within the pool’s overall budget. This flexible, shared performance model is unique to the Elastic zone-redundant storage service level, making it easy to optimize throughput for workloads that are heavy on metadata or require a mix of different file operations.\n\nWith Azure NetApp Files Elastic ZRS, you can ensure strong data availability and smooth operations. The platform removes the need for manual failover and extra standby resources, making management simpler and improving how resources are used. This enables technology leaders to focus on driving business goals, knowing that reliable, high-performance storage will be maintained even if zone-level failures occur.\n\nCurious to see how it all comes together? The following walkthrough takes you inside the Azure portal to see Azure NetApp Files Elastic ZRS in action and how zone‑level resilience is handled automatically by the platform.\n\n# Use Cases\n\nBecause of its always-on design and ease of use, Azure NetApp Files Elastic ZRS is ideal for a variety of mission-critical and data-intensive workloads that require zone-redundant storage. Here are several real-world use cases where Azure NetApp Files Elastic ZRS provides significant value:\n\n| **Use Case** | **How Azure NetApp Files Elastic ZRS Helps** | | --- | --- | | **SAP shared files** | Delivers zero data loss and fast failover for SAP clusters meeting strict HA demands and keeping SAP shared files workloads online with ease. | | **General file shares** | Corporate user data including home directories or departmental file shares, remain accessible even during zone outages, ensuring seamless employee productivity and business continuity. | | **Financial Services & Trading Platforms** | Delivers zero data loss and nonstop trading even in a zone outage, so financial apps stay compliant, and customers stay confident. | | **Kubernetes/Containerized Applications** | Keeps Kubernetes and container workloads running even during zone outages by instantly synchronizing data across zones and enabling rapid, automated failover. Your stateful apps stay online with zero data loss and minimal downtime. | | **Business-Critical Applications** | Ensure nonstop access to tax and compliance apps even if an AZ fails as data stays online with zero outages or lost transactions. |\n\n# Conclusion\n\nAzure NetApp Files Elastic ZRS establishes a new benchmark for simple, reliable, and highly available file storage in the cloud. By integrating Azure’s redundant infrastructure with Azure NetApp Files’ enterprise-grade storage capabilities, it ensures uninterrupted access to data while reducing complexity.\n\nIf you have mission-critical data in Azure that needs to stay available through any single AZ failure, Azure NetApp Files Elastic ZRS is an option to seriously consider.\n\n# Next steps\n\n- **Check Region Availability:** Azure NetApp Files Elastic ZRS is initially available in select Azure regions including Australia East, Central US, South Central US, Canada Central, West US 3, and West Europe, with more regions coming soon. Verify that your region supports [Azure NetApp Files zone-redundant storage service level](https://learn.microsoft.com/azure/azure-netapp-files/elastic-zone-redundant-concept#supported-regions).\n- **Enable the Service:** At the time of writing, Azure NetApp Files Elastic ZRS is in public preview. You will need to [register](https://learn.microsoft.com/azure/azure-netapp-files/elastic-account#register-for-the-elastic-zone-redundant-storage) for the preview. Once enabled, create an “NetApp Elastic” account, then create a new capacity pool with the “Zone redundant” service level, then create volumes in that pool as you normally would.\n- **Stay Informed:** Keep an eye on the [Azure NetApp Files documentation](https://learn.microsoft.com/azure/azure-netapp-files/) and the “[What’s New](https://learn.microsoft.com/azure/azure-netapp-files/whats-new)” announcements for updates on Azure NetApp Files Elastic ZRS general availability and new region support. As the service level evolves toward GA, final performance profiles and pricing will be confirmed (preview pricing is subject to change).\n\nBy implementing Azure NetApp Files Elastic ZRS, you can significantly harden your cloud storage against zone-level failures with minimal effort. For cloud solution architects and IT managers, it offers a compelling way to meet uptime commitments and protect critical data all while using Azure-native tooling and familiar Azure NetApp Files workflows. In summary, Azure NetApp Files Elastic ZRS brings highly available storage into Azure as a first-class capability. It allows you to run your most important applications with confidence that your data is safe, continuously available, and ready for whatever comes next.\n\n# Learn more\n\n- [What's new in Azure NetApp Files | January 2025](https://learn.microsoft.com/azure/azure-netapp-files/whats-new#january-2026)\n- [Understand Azure NetApp Files Elastic zone-redundant service level](https://learn.microsoft.com/azure/azure-netapp-files/elastic-zone-redundant-concept)\n- [Create a NetApp Elastic account](https://learn.microsoft.com/azure/azure-netapp-files/elastic-account)\n- [Set up an elastic capacity pool](https://learn.microsoft.com/azure/azure-netapp-files/elastic-capacity-pool-task)\n- [Azure NetApp Files resource limits](https://learn.microsoft.com/azure/azure-netapp-files/azure-netapp-files-resource-limits)"
}
