{
  "Description": "Recently, we [announced](https://techcommunity.microsoft.com/blog/analyticsonazure/serverless-workspaces-are-live-in-azure-databricks/4474712) that Serverless Workspaces in public preview. Today, we are excited to share that Serverless Workspaces are generally available in Azure Databricks. Azure Databricks now offers two workspace models: Serverless and Classic.\n\nWith Serverless, Azure Databricks operates and maintains the entire environment on your behalf. You still configure governance elements like Unity Catalog, identity federation, and workspace-level policies, but the heavy lifting of infrastructure setup disappears. As a result, teams can start building immediately instead of waiting on networking or compute provisioning.\n\nClassic workspaces take the opposite approach. When creating a Classic workspace, you must design and deploy the full networking layout, determine how compute should be managed, establish storage patterns, and configure all inbound and outbound connectivity. These decisions are critical and have benefits in heavily regulated or secure industries, but they may create overhead for teams who simply want to start working with data.\n\nA Serverless Workspace eliminates that overhead entirely. Once created, it’s ready for use—no virtual network design, no storage configuration, and no cluster management. Serverless workspaces use serverless compute and default storage. Unity Catalog is automatically provisioned so that the same governance model applies.\n\n**Key capabilities and consideration of Serverless workspaces**\n\nStorage: Each Serverless workspace includes fully managed object storage called default storage. You can build managed catalogs, volumes, and tables without supplying your own storage accounts or credentials. Features like multi-key projection and restricted object-store access ensure that only authorized users can work with the data. Classic compute cannot interact with data assets in default storage.\n\nIf you already have an Azure Blob Storage account (likely with hierarchical namespace enabled) or if your organization requires using your own storage due to security or compliance requirements, you can also [create a connection between your storage account and Serverless Workspace](https://learn.microsoft.com/en-us/azure/databricks/connect/unity-catalog/cloud-storage/).\n\nCompute: Workloads run on automatically provisioned serverless compute—no need to build or maintain clusters. Azure Databricks handles scaling and resource optimization so users can focus purely on data and analytics.\n\nNetwork: There’s no requirement to deploy NAT gateways, firewalls, or Private Link endpoints. Instead, you define serverless egress rules and serverless Private Link controls that apply uniformly to all workloads in the workspace.\n\nUnity Catalog access: Governed data remains accessible from the new workspace with existing permissions intact. Your data estate stays consistent and secure.\n\n**Choosing between Serverless and Classic**\n\nAzure Databricks supports both workspace types so organizations can select what best matches their needs.\n\n- Use Serverless when rapid workspace creation, minimal configuration, and reduced operational overhead are priorities. It’s the fastest path to a fully governed environment.\n\n- Use Classic when you require a custom VNet design, specific network topologies, finer grain security controls, or features that are not yet available in the serverless model. Some organizations also simply prefer to manage Azure resources directly, making Classic workspaces a suitable option.\n\n![]()\n\nNote that Azure Databricks serverless workspaces are only available in [regions that support serverless compute](https://learn.microsoft.com/en-us/azure/databricks/resources/supported-regions). To learn get started [create your Serverless workspace](https://learn.microsoft.com/en-us/azure/databricks/admin/workspace/serverless-workspaces) today!",
  "Tags": [],
  "FeedName": "Microsoft Tech Community",
  "Author": "AnaviNahar",
  "Link": "https://techcommunity.microsoft.com/t5/analytics-on-azure-blog/serverless-workspaces-are-generally-available-in-azure/ba-p/4491314",
  "FeedUrl": "https://techcommunity.microsoft.com/t5/s/gxcuf89792/rss/Category?category.id=Azure",
  "OutputDir": "_community",
  "PubDate": "2026-02-02T17:15:00+00:00",
  "EnhancedContent": "Recently, we [announced](https://techcommunity.microsoft.com/blog/analyticsonazure/serverless-workspaces-are-live-in-azure-databricks/4474712) that Serverless Workspaces in public preview. Today, we are excited to share that Serverless Workspaces are generally available in Azure Databricks. Azure Databricks now offers two workspace models: Serverless and Classic.\n\nWith Serverless, Azure Databricks operates and maintains the entire environment on your behalf. You still configure governance elements like Unity Catalog, identity federation, and workspace-level policies, but the heavy lifting of infrastructure setup disappears. As a result, teams can start building immediately instead of waiting on networking or compute provisioning.\n\nClassic workspaces take the opposite approach. When creating a Classic workspace, you must design and deploy the full networking layout, determine how compute should be managed, establish storage patterns, and configure all inbound and outbound connectivity. These decisions are critical and have benefits in heavily regulated or secure industries, but they may create overhead for teams who simply want to start working with data.\n\nA Serverless Workspace eliminates that overhead entirely. Once created, it’s ready for use—no virtual network design, no storage configuration, and no cluster management. Serverless workspaces use serverless compute and default storage. Unity Catalog is automatically provisioned so that the same governance model applies.\n\n**Key capabilities and consideration of Serverless workspaces**\n\nStorage: Each Serverless workspace includes fully managed object storage called default storage. You can build managed catalogs, volumes, and tables without supplying your own storage accounts or credentials. Features like multi-key projection and restricted object-store access ensure that only authorized users can work with the data. Classic compute cannot interact with data assets in default storage.\n\nIf you already have an Azure Blob Storage account (likely with hierarchical namespace enabled) or if your organization requires using your own storage due to security or compliance requirements, you can also [create a connection between your storage account and Serverless Workspace](https://learn.microsoft.com/en-us/azure/databricks/connect/unity-catalog/cloud-storage/).\n\nCompute: Workloads run on automatically provisioned serverless compute—no need to build or maintain clusters. Azure Databricks handles scaling and resource optimization so users can focus purely on data and analytics.\n\nNetwork: There’s no requirement to deploy NAT gateways, firewalls, or Private Link endpoints. Instead, you define serverless egress rules and serverless Private Link controls that apply uniformly to all workloads in the workspace.\n\nUnity Catalog access: Governed data remains accessible from the new workspace with existing permissions intact. Your data estate stays consistent and secure.\n\n**Choosing between Serverless and Classic**\n\nAzure Databricks supports both workspace types so organizations can select what best matches their needs.\n\n- Use Serverless when rapid workspace creation, minimal configuration, and reduced operational overhead are priorities. It’s the fastest path to a fully governed environment.\n\n- Use Classic when you require a custom VNet design, specific network topologies, finer grain security controls, or features that are not yet available in the serverless model. Some organizations also simply prefer to manage Azure resources directly, making Classic workspaces a suitable option.\n\nNote that Azure Databricks serverless workspaces are only available in [regions that support serverless compute](https://learn.microsoft.com/en-us/azure/databricks/resources/supported-regions). To learn get started [create your Serverless workspace](https://learn.microsoft.com/en-us/azure/databricks/admin/workspace/serverless-workspaces) today!\n\nUpdated Feb 01, 2026\n\nVersion 1.0\n\n[analytics](/tag/analytics?nodeId=board%3AAnalyticsonAzure)\n\n[azure databricks](/tag/azure%20databricks?nodeId=board%3AAnalyticsonAzure)\n\n[!\\[AnaviNahar&#x27;s avatar\\](https://techcommunity.microsoft.com/t5/s/gxcuf89792/images/dS04MDM5OTktQlh3V0lu?image-coordinates=0%2C64%2C670%2C735&amp;image-dimensions=50x50)](/users/anavinahar/803999) [AnaviNahar](/users/anavinahar/803999) ![Icon for Microsoft rank](https://techcommunity.microsoft.com/t5/s/gxcuf89792/images/cmstNC05WEo0blc?image-dimensions=100x16&amp;constrain-image=true)Microsoft\n\nJoined September 22, 2020\n\n[View Profile](/users/anavinahar/803999)\n\n/category/azure/blog/analyticsonazure [Analytics on Azure Blog](/category/azure/blog/analyticsonazure) Follow this blog board to get notified when there's new activity",
  "FeedLevelAuthor": "rss.livelink.threads-in-node",
  "Title": "Serverless Workspaces are generally available in Azure Databricks",
  "ProcessedDate": "2026-02-02 18:10:39"
}
