{
  "FeedLevelAuthor": "rss.livelink.threads-in-node",
  "FeedName": "Microsoft Tech Community",
  "PubDate": "2026-02-24T12:28:38+00:00",
  "Description": "The original [announcement](https://techcommunity.microsoft.com/blog/telecommunications-industry-blog/introducing-microsoft%E2%80%99s-network-operations-agent-%E2%80%93-a-telco-framework-for-autonom/4471185) of the **Network Operations Agent (NOA) Framework** outlined a bold mission: provide telecom operators with a modular, multiagent foundation to accelerate the journey toward autonomous networks. NOA combined intelligent agents, unified data access, and strong governance to help operators modernize complex, cloud scale environments.\n\nA follow-up is timely. Over the past year, customer deployments, industry collaboration, and Microsoft’s own internal learnings have fueled a rapid evolution of the framework. Telecom operators face skyrocketing event volumes, rising operational costs, and a deepening skills gap—conditions echoed in the challenges documented by Microsoft’s own NetAI. Against this backdrop, NOA’s enhancements are designed to deliver more automation, more intelligence, and more resilience—while maintaining safety and human oversight.\n\n# What’s New: Key Enhancements in NOA v2\n\n**Adoption of NetAI Concepts and Best Practices**\n\nAlthough NOA is **not** [NetAI](https://techcommunity.microsoft.com/blog/telecommunications-industry-blog/reimagining-network-operations-how-microsoft-netai-tackles-hyperscale-challenges/4470572), its latest iteration incorporates proven architectural principles and operational practices from the NetAI program—including intelligent agents, curated context, engineered prompts, and deterministic workflows. NetAI’s focus on scaling automation without scaling headcount, and its multi‑agent roles such as diagnostics and fiber repair, informed several NOA improvements.\n\nThis infusion strengthens NOA’s ability to support autonomous incident detection, diagnosis, and remediation while preserving telco-grade safety and predictability. And the partnership is symbiotic, as NetAI is leveraging NOA’s modern, Foundry based architecture in future iterations.\n\n**The UI for AI: Deep Integration with Microsoft 365 Copilot and Teams**\n\nNOA now embraces Microsoft Teams, Outlook, and Copilot as the **primary user interface** for AI agents—turning everyday collaboration tools into a real-time operations cockpit.\n\nOperations engineers can ask questions such as *“What’s causing the latency spike in region X?”* directly in Teams and receive agent generated diagnostics, summaries, or recommended actions. Agents proactively post alerts, help draft incident summaries, and allow supervisor approvals—merging human and AI workflows seamlessly.\n\nThis “UI for AI” approach dramatically reduces friction, shortens response cycles, and boosts adoption across operations teams.\n\n**Migration to Microsoft Foundry & the Microsoft Agent Framework**\n\nA cornerstone update is NOA’s full alignment with **Microsoft Foundry** technology, including:\n\n- **Microsoft Agent Framework** – An extensible, open‑source orchestration layer providing standardized agent communication, tool use (via MCP), A2A, observability, and hybrid deployment options.\n- **Foundry Agent Service** – A secure runtime for deploying and scaling NOA’s multi‑agent workflows.\n- **Foundry Observability** – Built-in memory, traceability, and monitoring for every action and interaction.\n- **Foundry IQ** – Intelligence services enabling context retrieval, semantic grounding, and safe decision-making.\n\nThese enhancements give NOA a more deterministic, governed, and auditable operational backbone—crucial for regulated telco environments.\n\n**Integration of TM Forum Open APIs via MCP**\n\nThe NOA Framework’s alignment with TM Forum standards has expanded significantly since the initial release. In addition to its broader support for TM Forum’s Autonomous Network principles, NOA now incorporates **TM Forum Open APIs for trouble ticketing**, delivered through the Model Context Protocol (MCP) integration layer.\n\nA key enhancement is the explicit support for the TMF621 Trouble Ticket Management API, the industry standard interface for creating, updating, querying, and resolving trouble tickets in OSS/BSS environments. By exposing TMF621 operations through NOA agents and MCP toolchains, the framework enables:\n\n- Automated creation of standardized TMF621‑compliant trouble tickets\n- Agent driven correlation of telemetry, diagnostics, and ticket history\n- Seamless interoperability with existing OSS/BSS and service desk systems\n- Consistent, vendor neutral workflows for incident lifecycle management\n\nThis deeper TMF621 alignment ensures NOA agents can participate directly in ticket-driven operational processes while maintaining full compliance with telco grade open standards.\n\n**Strengthened Security, Governance, and Compliance Controls**\n\nNOA’s governance model has been expanded with:\n\n- **Read-only defaults and restricted permissions**, enforced through managed identities and RBAC\n- **Detailed action logging** for auditability\n- **Operator defined policy gates** requiring human approval for sensitive tasks\n- Support for **hybrid and multi-cloud deployments** with consistent identity and compliance\n\nThis ensures telcos can deploy autonomous agents without compromising regulatory responsibilities or operational safety.\n\n# Real-World Impact: How Azure Accelerates Autonomous Operations\n\nNOA’s evolution is driven not only by design, but by field usage across operators and large‑scale networks.\n\n**Microsoft’s internal Azure Networking success**\n\nMicrosoft used [NetAI](https://techcommunity.microsoft.com/blog/telecommunications-industry-blog/reimagining-network-operations-how-microsoft-netai-tackles-hyperscale-challenges/4470572) to automate fiber incident management across the global Azure backbone—achieving:\n\n- **60% reduction** in time-to-detect fiber issues\n- **25% improvement** in repair times\nThese measurable gains demonstrate the potential of agentic operations at hyperscale.\n\nThese learnings, best practices, concepts, and designs are at the core of NOA.\n\n**Alignment with broader telco transformations**\n\n**Far EasTone Telecom** (FET) exemplifies how leading operators are turning this architecture into real operational impact. FET is leveraging the NOA framework to redefine cloud native network operations by embedding agentic AI across its NOC and change management workflows. Today, nearly 60% of its NOC operations are AI-assisted, with about 10,500 operational tasks executed per month, including incident summaries, automated ticket closure, network checks, and proactive voice notifications. AI agents now handle largescale alarm correlation and root cause analysis in seconds, supporting nearly 7,000 monthly operational queries with an average response time of 16 seconds, and enabling most maintenance actions to complete within one minute. This shift has significantly reduced human error, accelerated recovery times, and allowed engineers to focus on higher value work. Built on Azure cloud native and hybrid data principles, FET can scale network intelligence securely across on premises and cloud environments, deploying capabilities closer to customers while maintaining carrier grade reliability, performance, and regulatory confidence—demonstrating how adaptive cloud and AI can turn network operations into a strategic advantage.\n\n**Vodafone** is working with Microsoft to apply a proven AI‑powered blueprint for autonomous network operations across transport infrastructure and field‑force management. The collaboration combines Vodafone’s deep network expertise with Microsoft Foundry and the NOA framework to modernize how large‑scale telecom networks are operated.\n\nThis blueprint is built on Microsoft’s own experience running autonomous agents across its global Azure transport network, where AI continuously monitors performance, identifies root causes, and autonomously manages more than 65% of fibre‑break field dispatches—improving time to repair by up to 25% and accelerating root‑cause analysis by 80%. By applying these proven capabilities to Vodafone’s transport network, the two companies are accelerating the shift toward intelligent, automated transport network operations across the telecom industry.\n\n> >\n> “*By working with Microsoft, we’re combining deep network expertise with proven AI‑powered operations to create something greater than either could achieve alone. Together, we’re building intelligent, automated transport network operations that empower our teams and deliver faster, more resilient connectivity networks for our customers*.”\n> > >\n> *—Alberto Ripepi, Chief Network Officer, Vodafone*\n> >\n\nOther operators, including [AT&T](https://www.microsoft.com/en/customers/story/25679-at-and-t-azure), [T-Mobile](https://www.microsoft.com/en/customers/story/25253-tmobile-azure-data-explorer), [Telefónica](https://www.microsoft.com/en/customers/story/21150-telefonica-group-spain-azure-ai-and-machine-learning), and MEO, are adopting Microsoft Foundry as a blueprint for scaling agentic AI across complex, multi-vendor networks.\n\nCase studies from global operators leveraging **Foundry** and **Azure AI** capabilities—though not NOA specific—demonstrate similar patterns of AI driven operational gains:\n\n- [**AT&T**](https://www.microsoft.com/en/customers/story/20384-att-azure-databricks) unifies and analyzes massive volumes of network data with Microsoft Azure—particularly Azure Databricks, Power BI, and cloud-scale AI analytics—in a secure lakehouse architecture, enabling faster AI-driven insights, improved network-informed decision-making, and more efficient, scalable operations across its telecom network.\n- [**T‑Mobile**](https://www.microsoft.com/en/customers/story/25253-tmobile-azure-data-explorer) leverages Microsoft Azure, data, and AI analytics platform—combining services like Azure Data Explorer, Azure Databricks, and AI-driven analytics—to ingest and analyze trillions of network data points in near real time, giving teams deep visibility into network performance, proactively identifying and resolving issues, and continuously optimizing the customer experience across its nationwide network.\n- [**Telefónica España**](https://www.microsoft.com/en/customers/story/21150-telefonica-group-spain-azure-ai-and-machine-learning) applies Microsoft Azure’s big data, AI, and automation capabilities—such as Azure Data Explorer and Azure Databricks—to analyze massive volumes of network data in real time, detect anomalies, and enable self‑optimizing 4G/5G networks that improve performance, reliability, and customer experience while reducing operational costs.\n- **MEO** uses Microsoft AI systems to improve technician efficiency and transparency in operational processes.\n\nThese customer achievements reinforce the architectural direction taken with the NOA Framework, leveraging Azure data and AI capabilities like Azure Databricks, Fabric, and Foundry to operate world-class networks.\n\n# Architecture & Key Components\n\n![]()\n\nBased on the latest Foundry capabilities, the NOA reference architecture emphasizes four key subsystems, detailed in the next sections.\n\n### UI for AI\n\nThe **UI for AI** is the human interaction layer through which operators engage with the NOA system using natural language. In the NOA architecture, this UI is delivered through familiar enterprise surfaces—**the WebApp, Microsoft Teams, and Microsoft 365 Copilot**—allowing users to initiate workflows, review agent findings, approve actions, and observe outcomes without switching tools or learning new interfaces. Teams based agent interactions and supervisor controls now form a key architectural pillar.\n\n![]()\n\n**What it enables**\n\n- Conversational interaction with the NOC Manager and specialist agents\n- Human-in-the-loop approvals for diagnostics, remediation, and ticket actions\n- Consistent experience across web, Teams, and Copilot while preserving enterprise identity and permissions\n\n### Agentic Governance\n\n**Agentic Governance** is the policy, safety, and control layer that enforces **Responsible AI**, security, compliance, and observability across all NOA agents and workflows. In the NOA architecture, this governance is provided by the **Foundry Control Plane** and associated guardrails, evaluations, audit logs, and operator views.\n\n**What it enables**\n\n- Runtime guardrails for content safety, PII protection, prompt injection, and tool misuse\n- Human-in-the-loop escalation and approval controls\n- Auditability, compliance reporting, and policy enforcement across all deployed agents\n\n**Foundry Control Plane**\n\nFoundry Control Plane functions as the **governance + observability + safety enforcement layer** that sits above the multi-agent system, ensuring agent workflows can run in production with the right controls. It is where governance, observability, security, and Responsible AI controls are enforced for agent workflows. It’s presented as the mechanism that turns the solution into a **scalable, governed, and enterprise-ready** operations framework.\n\n![]()\n\nConcretely, the Foundry Control Plane provides:\n\n- **Guardrails (safety controls)**: a central place to apply and manage protections against harmful content, PII leakage, prompt injection, and off-topic drift—plus the ability to create custom guardrails tailored to telecom needs (e.g., restricting sensitive config exposure or limiting high-risk tool calls during incidents).\n- **Evaluations (quality and readiness checks)**: benchmarking agents via “evaluation runs” using built-in evaluators (accuracy, safety, coherence, domain quality), helping validate integrations (like MCP / Fabric) and catch regressions before rollout.\n- **Operator view for fleet monitoring**: centralized monitoring across deployed agents/channels, including fleet health (uptime, errors, sessions), performance (latency, token usage, throughput), and compliance signals (guardrail violations, policy alerts).\n- **Asset inventory and lifecycle management**: a unified inventory of deployed agents, models, and tools (e.g., MCP servers, Fabric Data Agents), supporting versioning, staging/rollback, usage analytics, credential rotation, and model policy enforcement.\n- **Compliance management**: centralized management of guardrails, policy templates, audit logs, and risk dashboards to produce audit-ready governance across the agent estate.\n\nFoundry Control Plane is the control-and-monitoring system that makes autonomous, multi-agent incident workflows safe, auditable, and operable at enterprise scale.\n\n**Agent 365**\n\nAgent 365 functions as the **enterprise management plane for AI agents**—the place where agents are registered, controlled, observed, and secured at scale. Agent 365 is positioned as the **central control plane** that provides:\n\n- **Unified registry / inventory** of AI agents (a single place to manage what agents exist across the enterprise).\n- **Access control** so only the right users/roles can use particular agents and tools.\n- **Observability** to monitor agent usage and behavior across deployments.\n- **Enterprise security controls** applied consistently across agents and where they run.\n\nIn short, Agent 365 is the “management hub” for governing and operating the organization’s agent estate, complementing (and working alongside) the Foundry Control Plane’s runtime guardrails/evaluations and the broader multi-agent orchestration.\n\n### Agentic Framework\n\nThe **Agentic Framework** is the orchestration layer that enables **stateful, multi‑agent workflows** within the NOA system. Built on the **Microsoft Agent Framework**, it allows a **NOC Manager (Niobe)** to coordinate specialized agents (e.g., Troubleshooting, Telemetry, Ticketing, Field Ops) through delegated tasks, shared context, and ordered execution.\n\n**What it enables**\n\n- Vertical orchestration of specialized agents under a single supervisory control\n- Durable workflows spanning diagnosis, remediation, validation, and ticketing\n- Agent-to-Agent (A2A) communication and integration with external agents (e.g., ServiceNow)\n\n**Microsoft Agent Framework**\n\nThe Microsoft Agent Framework functions as the **foundation layer for building the Telco NOA solution’s stateful, multi-agent system**, providing the structure for how agents are defined, orchestrated, and operated end-to-end.\n\nSpecifically, the Microsoft Agent Framework enables:\n\n- **Stateful, multi-agent workflows for NOC operations**: it underpins the NOA platform, letting agents collaborate across a single incident while retaining shared context over time (not just one-off prompts).\n- A **centrally orchestrated (“vertically orchestrated”) model**: a **NOC Manager (Niobe)** manages task delegation, sequencing, and shared context across the workflow, while specialized agents (Troubleshooting, Incident Management, Field Ops, SONiC, Security & Compliance) execute domain-specific tasks.\n- **Secure cross-platform agent collaboration via A2A (agent-to-agent) communication**: external agents (example given: ServiceNow Now Assist) can plug into the ecosystem through A2A to enable coordinated actions across platforms.\n- **Operationalization of multi-agent systems with durable workflows**: an open-source SDK used for designing, orchestrating, and operationalizing multiagent systems with durable, stateful workflows.\n\nAll of that positions Microsoft Agent Framework as the **core multi-agent runtime/SDK layer** that makes the NOA incident flow (supervisor + specialist agents + external A2A agents) possible and maintainable as a workflow-driven system.\n\n**Foundry Workflows**\n\nFoundry Workflows function as the orchestration layer that defines, executes, and governs the end-to-end sequence of multiagent actions required to resolve network incidents in the Telco NOA Framework. The workflow models how tasks flow across agents—from initial intent capture through diagnostics, remediation, ticketing, verification, and closure—under the supervision of a central orchestrator agent.\n\n![]()\n\nSpecifically, the workflow encodes the ordered handoffs and decision logic between agents such as the Supervisor Agent (Niobe), Network Telemetry Analyzer, Troubleshooting Agent (Pal Locke), SONiC Agent, Field Ops Agent, and Ticketing Agent. Rather than relying on static scripts or point integrations, the workflow graph visually and operationally represents how the Supervisor dynamically delegates tasks, routes context, and coordinates execution across specialized agents.\n\nFoundry Workflows also provide a testable and observable execution environment. Workflows can be previewed in a sandbox mode, allowing presenters to simulate real incident flows, trigger agent interactions via natural language prompts, and validate that tool calls (for example, MCP-based ServiceNow or TM Forum APIs) execute correctly before production deployment.\n\nDuring execution, the workflow enables full traceability and auditability. Debug and conversation detail views expose each step in the workflow, including routing decisions by the Supervisor, tool invocations, intermediate responses, and final outputs. This makes workflows not just an automation mechanism, but a governance artifact that supports troubleshooting, cost analysis, and compliance review.\n\nFinally, Foundry Workflows act as the deployment unit for operationalizing agentic solutions. Once validated, the same workflow can be published with one click to Microsoft Teams or Microsoft 365 Copilot, preserving guardrails, evaluations, RBAC, and monitoring. This allows the exact same orchestrated logic to run consistently across chat, Copilot, and custom channels without re‑engineering.\n\n### Telco IQ\n\nTelco IQ is the intelligence layer that grounds agent reasoning in telecom specific operational knowledge. In the NOA architecture, this intelligence is delivered through Foundry IQ and Fabric IQ, which provide retrieval augmented reasoning across structured telemetry, operational data, and unstructured domain knowledge.\n\n**What it enables**\n\n- Telecom aware reasoning using KPIs, SOPs, policies, and historical incidents\n- Multi-hop retrieval and citation backed answers\n- Reduced hallucinations through grounded, policy aware context\n\n**Fabric IQ**\n\nFabric IQ functions as the semantic intelligence layer that helps agents make better decisions by organizing operational + analytical data into business concepts, so the agents can reason over it more effectively (not just retrieve raw records). This dramatically simplifies connecting to data while improving the quality of the results.\n\n**Foundry IQ**\n\nFoundry IQ functions as the unified knowledge and retrieval layer that grounds the NOC agents with relevant, policy-aware context during incident troubleshooting. Foundry IQ is described as:\n\n- A **Foundry Knowledge Base** (built on Azure AI Search) that unifies content such as network security policies, troubleshooting guides, and SOP knowledge articles across sources including Microsoft 365/SharePoint, Fabric IQ/OneLake, Azure Blob Storage, ADLS Gen2, ServiceNow tables, and the web.\n- The capability that **automates key RAG pipeline steps**—including query planning, multi-hop reasoning, and answer synthesis with citations—so each agent doesn’t have to rebuild chunking, indexing, and connector logic per project.\n- A mechanism for **enterprise-grade security and governance**, explicitly leveraging Entra ID governance and respecting Microsoft Purview sensitivity labels, while reducing hallucinations through grounded retrieval.\n- The **knowledge backbone agents** rely on in the workflow: for example, the NOC Agent leverages the Foundry IQ knowledge base to retrieve operational insights and summarize likely causes, and other specialized agents (e.g., troubleshooting and security compliance).\n\n### Universal Data Access\n\n**Universal Data Access** is the data foundation that unifies real-time, structured, and unstructured data sources into a single, governable knowledge fabric for NOA agents. The architecture explicitly combines Microsoft Fabric Eventhouse, Azure Cosmos DB, ADLS Gen2, Azure Blob Storage, ServiceNow tables, and Microsoft 365 sources, all accessed through governed tools and identity passthrough.\n\n**What it enables**\n\n- Real‑time telemetry access for diagnostics and validation\n- Persistent conversational memory and incident history\n- Secure, identity aware access across enterprise and operational systems\n\n> >\n> **NOTE:** While the NOA Framework sample implementation and demo utilize this specific data architecture, the Framework can integrate into any existing data environment. The focus of NOA is to simplify and accelerate the development of network AI agents by leveraging your existing data estate.\n> >\n\nWith the included Microsoft Fabric connectors and OneLake virtualization, NOA can reason over:\n\n- Real‑time telemetry\n- OSS/BSS data\n- Ticketing systems\n- Multi-cloud or on-prem data stores\n\nThese updates collectively make NOA more scalable, more open, and easier to operationalize across diverse network environments.\n\n# Meet the Agents\n\nThe following agents are the core “cast” of the NOA. Each one represents a specialized capability (telemetry analysis, troubleshooting, device interaction, compliance validation, ticketing, and field operations) coordinated by a central supervisor.\n\n![]()\n\n**NOC Manager Agent (Niobe)**\n\nThe central orchestrator and human interface: manages task delegation, sequencing, and shared context across workflows; coordinates the other specialized agents through Foundry’s runtime. This agent flags/triages critical tickets, coordinates with connected agents, and uses Foundry IQ to retrieve operational insights and summarize likely causes for the operator.\n\n**Network Telemetry Analyzer Agent**\n\nAnalyzes network performance metrics (e.g., packet loss, throughput) and uses the Fabric Data Agent to generate/execute KQL queries against the Fabric (Eventhouse/KQL DB) to support diagnostics and post-mitigation verification.\n\n**Network Troubleshooting Agent (Pal Locke)**\n\nRuns diagnostic playbooks and remediation steps; retrieves insights from Foundry IQ and proposes fixes via the SONiC Agent for device-level commands.\n\n**SONiC Agent**\n\nInterfaces directly with the network elements (e.g. SW-TOR-05 device) to execute commands and retrieve system-level data/telemetry (e.g., OS details, PFC watchdog stats, logs).\n\n**Network Security Compliance Agent**\n\nValidates post-mitigation QoS/SLA metrics (e.g. latency and jitter) using Foundry IQ, ensuring fixes remain within defined SLAs.\n\n**Ticketing Agent**\n\nManages incident tickets and documentation: creates/updates tickets, logs agent actions, supports auditing/handovers, and integrates via an MCP server exposing ServiceNow tools and TM Forum Trouble Ticket Open API to retrieve history for accurate categorization and updates.\n\n**Field Ops Agent (Miles Dyson)**\n\nHandles physical/field issues (e.g. fiber cuts) and collaborates with the appropriate teams via email.\n\n# Building the Autonomous Network Ecosystem\n\nNOA is intentionally designed as a **partner-extensible framework**, not a closed product. As a result, many partners are adopting NOA as a reference implementation for agentic operations—then integrating it into their existing agent framework, OSS/BSS, assurance, and automation portfolios to deliver differentiated autonomous network solutions for operators.\n\n### How partners are adopting NOA\n\n- **Starting point for agentic architecture**: using NOA’s supervisor + specialist agent pattern as the baseline for incident, problem, and change workflows.\n- **Accelerator for telco-grade governance**: adopting the guardrails, approvals, observability, and auditability concepts to meet operator safety and compliance expectations.\n- **Reference integration blueprint**: mapping NOA’s tool and API-driven approach (MCP, TM Forum Open APIs) onto their own integration adapters and connectors.\n- **Blueprint for the “UI for AI” in operations**: embedding agents into Teams/Copilot experiences to reduce swivel-chair work and drive practitioner adoption.\n- **Foundation for packaged offerings**: creating repeatable solution bundles (templates, playbooks, and connectors) that can be deployed across multiple operators with configuration, not re-engineering.\n\n### Integrating NOA into existing autonomous network solutions\n\nMost partners integrate NOA by keeping their domain platforms (assurance, orchestration, inventory, ticketing, observability) as the **systems of record**, while positioning NOA as the **agentic orchestration and experience layer** that coordinates people, tools, and workflows end-to-end. Practically, this integration typically follows a repeatable sequence:\n\n1. **Choose the first high-value workflow** (for example: P1 incident triage, RAN anomaly investigation, transport fault isolation, or trouble ticket enrichment) and define clear success metrics (MTTD/MTTR reduction, ticket quality, deflection rate).\n2. **Connect tools through MCP and Open APIs**, exposing partner and operator capabilities (queries, actions, validations) as governed tools the agents can call deterministically.\n3. **Ground agents in partner/operator knowledge** by connecting SOPs, topology, inventory, prior incidents, and KPI definitions via retrieval and curated context.\n4. **Implement policy gates and RBAC** so that high-risk actions (config changes, mass remediation, ticket closure) require explicit human approval and are fully logged.\n5. **Operationalize with testing and observability**, using evaluation runs, traces, and runbooks to validate correctness and monitor agent behavior in production.\n\n### Where partners extend NOA to differentiate\n\nPartners extend NOA to differentiate on top of an open agentic foundation by combining Microsoft’s orchestration with deep domain expertise and proprietary IP. Packaged solutions, multi‑vendor interoperability, and a consistent Teams/Copilot‑based operations experience ensure scalability while preserving a familiar NOC workflow.\n\n- **Domain-specialized agents**: adding RAN, core, transport, edge, and security agents tailored to vendor-specific telemetry, counters, and remediation procedures.\n- **Proprietary reasoning and models**: incorporating partner algorithms (anomaly detection, RCA graphs, topology analytics) and selecting models suited to latency/cost/regulatory needs.\n- **Closed-loop automation**: integrating with orchestration/controllers to move from “recommend” to “execute” in bounded, policy-approved scenarios (for example, self-healing with automatic rollback).\n- **Vertical solution packaging**: delivering repeatable “packs” (connectors + prompts + workflows + dashboards) for specific operator pain points.\n- **Multi-vendor interoperability**: normalizing data and actions across heterogeneous network domains using TM Forum Open APIs and partner mediation layers.\n- **Operations experience**: embedding NOA into partner portals and NOC tooling while maintaining a consistent Teams/Copilot experience for daily operations.\n\n### Co-innovation and operating model\n\nSuccessful partner implementations treat NOA as a **living operations capability** that is improved continuously—not a one-time integration. Partners typically establish a shared lifecycle with operators that covers solution design, governance, deployment, and ongoing optimization.\n\n- **Clear RACI**: which actions agents may take autonomously vs. which require NOC supervisor approval vs. which must be escalated to engineering.\n- **Evaluation and release management**: versioned prompts/workflows, pre-production evaluation runs, and rollback plans aligned to telco change-control practices.\n- **Safety-by-design**: read-only defaults, least-privilege tool access, and explicit policy gates around configuration, customer impact, and data handling.\n- **Observability as a first-class requirement**: tracing, action logging, and dashboards for quality, latency, and cost—plus incident reviews that include agent performance and tool outcomes.\n- **Knowledge ops**: continuously curating SOPs, updating topology/inventory context, and incorporating learnings from resolved incidents to reduce repeat failures.\n\nTaken together, these adoption patterns show how NOA is becoming a **common architectural baseline** that partners can integrate into their portfolios and extend with domain expertise—helping operators move faster toward safe, scalable autonomy while preserving differentiation where it matters most.\n\n### Partner Solutions\n\nMicrosoft is actively working with a number of GSI and ISV partners on integrating NOA concepts into their solutions. Partners include:\n\n**Global Systems Integrators**\n\nProvide professional services to build, connect and ground you agent orchestration and data modernisation with Microsoft Fabric and Microsoft Foundry.\n\n![]()\n\n**Independent Software Vendors**\n\nTurnkey, packaged solutions that include RAN & Core optimization agents, telco ontologies, or network insights which integrate or leverage the NOA architecture.\n\n![]()\n\n**Kenmei** [announced its collaboration with Microsoft](https://aka.ms/KenmeiANAnnouncement) to help operators accelerate their path toward autonomous networks by combining Kenmei’s telecom intelligence offer with Azure and [Microsoft Fabric](https://www.microsoft.com/en-us/microsoft-fabric) to enable scalable analytics and agentic AI–powered operations. Already in use at leading operators like Telefónica and etisalat (e&), this collaboration brings proven deployments into a broader cloud and AI ecosystem designed to reduce manual effort, speed decision‑making, and unlock new levels of network automation.\n\n# Advancing the Journey\n\nLooking ahead, Microsoft remains committed to advancing telco autonomy through:\n\n**Continued expansion of agent capabilities**\n\nFuture releases will bring additional agent roles, deeper coordination patterns, and broader integration with OSS/BSS systems—reflecting the trajectory of NetAI’s evolving multi‑agent ecosystem.\n\n**Accelerated partner and customer enablement**\n\nA **downloadable NOA Framework accelerator**, combining reference architectures, prompt libraries, agent templates, and deployment assets, will be made available in **April 2026**.\n\n**Reinforcement of openness**\n\nNOA will continue to support:\n\n- Third-party agent onboarding\n- Interoperability via MCP and TM Forum Open APIs\n- Hybrid network environments\n- Open‑source extensibility through Foundry components\n\nThis ensures operators retain maximum flexibility while adopting autonomous operations.\n\n# Closing: The Road to Autonomous Networks\n\nAs telcos navigate increasing complexity and rising expectations, the enhanced NOA Framework provides a practical, modular, and secure path toward autonomous operations.\n\nBy combining the intelligence of multi‑agent systems, the familiarity of Teams and Copilot, the power of Microsoft Foundry, and the safety of strong governance, NOA helps operators boost reliability, reduce MTTR, and simplify operations at scale.\n\nWe invite you to explore the documentation, demos, and community resources at **Mobile World Congress 2026** to learn how NOA can accelerate your autonomous network journey.",
  "Title": "Evolving the Network Operations Agent Framework: Driving the Next Wave of Autonomous Networks",
  "EnhancedContent": "## Autonomous networks are no longer a future ambition—they’re an operational necessity. The Network Operations Agent (NOA) Framework is evolving to meet that reality, bringing together agentic AI, governed automation, and familiar collaboration tools to transform how telecom networks are run at scale.\n\nThe original [announcement](https://techcommunity.microsoft.com/blog/telecommunications-industry-blog/introducing-microsoft%E2%80%99s-network-operations-agent-%E2%80%93-a-telco-framework-for-autonom/4471185) of the **Network Operations Agent (NOA) Framework** outlined a bold mission: provide telecom operators with a modular, multiagent foundation to accelerate the journey toward autonomous networks. NOA combined intelligent agents, unified data access, and strong governance to help operators modernize complex, cloud scale environments.\n\nA follow-up is timely. Over the past year, customer deployments, industry collaboration, and Microsoft’s own internal learnings have fueled a rapid evolution of the framework. Telecom operators face skyrocketing event volumes, rising operational costs, and a deepening skills gap—conditions echoed in the challenges documented by Microsoft’s own NetAI. Against this backdrop, NOA’s enhancements are designed to deliver more automation, more intelligence, and more resilience—while maintaining safety and human oversight.\n\n# What’s New: Key Enhancements in NOA v2\n\n**Adoption of NetAI Concepts and Best Practices**\n\nAlthough NOA is **not** [NetAI](https://techcommunity.microsoft.com/blog/telecommunications-industry-blog/reimagining-network-operations-how-microsoft-netai-tackles-hyperscale-challenges/4470572), its latest iteration incorporates proven architectural principles and operational practices from the NetAI program—including intelligent agents, curated context, engineered prompts, and deterministic workflows. NetAI’s focus on scaling automation without scaling headcount, and its multi‑agent roles such as diagnostics and fiber repair, informed several NOA improvements.\n\nThis infusion strengthens NOA’s ability to support autonomous incident detection, diagnosis, and remediation while preserving telco-grade safety and predictability. And the partnership is symbiotic, as NetAI is leveraging NOA’s modern, Foundry based architecture in future iterations.\n\n**The UI for AI: Deep Integration with Microsoft 365 Copilot and Teams**\n\nNOA now embraces Microsoft Teams, Outlook, and Copilot as the **primary user interface** for AI agents—turning everyday collaboration tools into a real-time operations cockpit.\n\nOperations engineers can ask questions such as *“What’s causing the latency spike in region X?”* directly in Teams and receive agent generated diagnostics, summaries, or recommended actions. Agents proactively post alerts, help draft incident summaries, and allow supervisor approvals—merging human and AI workflows seamlessly.\n\nThis “UI for AI” approach dramatically reduces friction, shortens response cycles, and boosts adoption across operations teams.\n\n**Migration to Microsoft Foundry & the Microsoft Agent Framework**\n\nA cornerstone update is NOA’s full alignment with **Microsoft Foundry** technology, including:\n\n- **Microsoft Agent Framework** – An extensible, open‑source orchestration layer providing standardized agent communication, tool use (via MCP), A2A, observability, and hybrid deployment options.\n- **Foundry Agent Service** – A secure runtime for deploying and scaling NOA’s multi‑agent workflows.\n- **Foundry Observability** – Built-in memory, traceability, and monitoring for every action and interaction.\n- **Foundry IQ** – Intelligence services enabling context retrieval, semantic grounding, and safe decision-making.\n\nThese enhancements give NOA a more deterministic, governed, and auditable operational backbone—crucial for regulated telco environments.\n\n**Integration of TM Forum Open APIs via MCP**\n\nThe NOA Framework’s alignment with TM Forum standards has expanded significantly since the initial release. In addition to its broader support for TM Forum’s Autonomous Network principles, NOA now incorporates **TM Forum Open APIs for trouble ticketing**, delivered through the Model Context Protocol (MCP) integration layer.\n\nA key enhancement is the explicit support for the TMF621 Trouble Ticket Management API, the industry standard interface for creating, updating, querying, and resolving trouble tickets in OSS/BSS environments. By exposing TMF621 operations through NOA agents and MCP toolchains, the framework enables:\n\n- Automated creation of standardized TMF621‑compliant trouble tickets\n- Agent driven correlation of telemetry, diagnostics, and ticket history\n- Seamless interoperability with existing OSS/BSS and service desk systems\n- Consistent, vendor neutral workflows for incident lifecycle management\n\nThis deeper TMF621 alignment ensures NOA agents can participate directly in ticket-driven operational processes while maintaining full compliance with telco grade open standards.\n\n**Strengthened Security, Governance, and Compliance Controls**\n\nNOA’s governance model has been expanded with:\n\n- **Read-only defaults and restricted permissions**, enforced through managed identities and RBAC\n- **Detailed action logging** for auditability\n- **Operator defined policy gates** requiring human approval for sensitive tasks\n- Support for **hybrid and multi-cloud deployments** with consistent identity and compliance\n\nThis ensures telcos can deploy autonomous agents without compromising regulatory responsibilities or operational safety.\n\n# Real-World Impact: How Azure Accelerates Autonomous Operations\n\nNOA’s evolution is driven not only by design, but by field usage across operators and large‑scale networks.\n\n**Microsoft’s internal Azure Networking success**\n\nMicrosoft used [NetAI](https://techcommunity.microsoft.com/blog/telecommunications-industry-blog/reimagining-network-operations-how-microsoft-netai-tackles-hyperscale-challenges/4470572) to automate fiber incident management across the global Azure backbone—achieving:\n\n- **60% reduction** in time-to-detect fiber issues\n- **25% improvement** in repair times\nThese measurable gains demonstrate the potential of agentic operations at hyperscale.\n\nThese learnings, best practices, concepts, and designs are at the core of NOA.\n\n**Alignment with broader telco transformations**\n\n**Far EasTone Telecom** (FET) exemplifies how leading operators are turning this architecture into real operational impact. FET is leveraging the NOA framework to redefine cloud native network operations by embedding agentic AI across its NOC and change management workflows. Today, nearly 60% of its NOC operations are AI-assisted, with about 10,500 operational tasks executed per month, including incident summaries, automated ticket closure, network checks, and proactive voice notifications. AI agents now handle largescale alarm correlation and root cause analysis in seconds, supporting nearly 7,000 monthly operational queries with an average response time of 16 seconds, and enabling most maintenance actions to complete within one minute. This shift has significantly reduced human error, accelerated recovery times, and allowed engineers to focus on higher value work. Built on Azure cloud native and hybrid data principles, FET can scale network intelligence securely across on premises and cloud environments, deploying capabilities closer to customers while maintaining carrier grade reliability, performance, and regulatory confidence—demonstrating how adaptive cloud and AI can turn network operations into a strategic advantage.\n\n**Vodafone** is working with Microsoft to apply a proven AI‑powered blueprint for autonomous network operations across transport infrastructure and field‑force management. The collaboration combines Vodafone’s deep network expertise with Microsoft Foundry and the NOA framework to modernize how large‑scale telecom networks are operated.\n\nThis blueprint is built on Microsoft’s own experience running autonomous agents across its global Azure transport network, where AI continuously monitors performance, identifies root causes, and autonomously manages more than 65% of fibre‑break field dispatches—improving time to repair by up to 25% and accelerating root‑cause analysis by 80%. By applying these proven capabilities to Vodafone’s transport network, the two companies are accelerating the shift toward intelligent, automated transport network operations across the telecom industry.\n\n> >\n> “*By working with Microsoft, we’re combining deep network expertise with proven AI‑powered operations to create something greater than either could achieve alone. Together, we’re building intelligent, automated transport network operations that empower our teams and deliver faster, more resilient connectivity networks for our customers*.”\n> > >\n> *—Alberto Ripepi, Chief Network Officer, Vodafone*\n> >\n\nOther operators, including [AT&T](https://www.microsoft.com/en/customers/story/25679-at-and-t-azure), [T-Mobile](https://www.microsoft.com/en/customers/story/25253-tmobile-azure-data-explorer), [Telefónica](https://www.microsoft.com/en/customers/story/21150-telefonica-group-spain-azure-ai-and-machine-learning), and MEO, are adopting Microsoft Foundry as a blueprint for scaling agentic AI across complex, multi-vendor networks.\n\nCase studies from global operators leveraging **Foundry** and **Azure AI** capabilities—though not NOA specific—demonstrate similar patterns of AI driven operational gains:\n\n- [**AT&T**](https://www.microsoft.com/en/customers/story/20384-att-azure-databricks) unifies and analyzes massive volumes of network data with Microsoft Azure—particularly Azure Databricks, Power BI, and cloud-scale AI analytics—in a secure lakehouse architecture, enabling faster AI-driven insights, improved network-informed decision-making, and more efficient, scalable operations across its telecom network.\n- [**T‑Mobile**](https://www.microsoft.com/en/customers/story/25253-tmobile-azure-data-explorer) leverages Microsoft Azure, data, and AI analytics platform—combining services like Azure Data Explorer, Azure Databricks, and AI-driven analytics—to ingest and analyze trillions of network data points in near real time, giving teams deep visibility into network performance, proactively identifying and resolving issues, and continuously optimizing the customer experience across its nationwide network.\n- [**Telefónica España**](https://www.microsoft.com/en/customers/story/21150-telefonica-group-spain-azure-ai-and-machine-learning) applies Microsoft Azure’s big data, AI, and automation capabilities—such as Azure Data Explorer and Azure Databricks—to analyze massive volumes of network data in real time, detect anomalies, and enable self‑optimizing 4G/5G networks that improve performance, reliability, and customer experience while reducing operational costs.\n- **MEO** uses Microsoft AI systems to improve technician efficiency and transparency in operational processes.\n\nThese customer achievements reinforce the architectural direction taken with the NOA Framework, leveraging Azure data and AI capabilities like Azure Databricks, Fabric, and Foundry to operate world-class networks.\n\n# Architecture & Key Components\n\nBased on the latest Foundry capabilities, the NOA reference architecture emphasizes four key subsystems, detailed in the next sections.\n\n### UI for AI\n\nThe **UI for AI** is the human interaction layer through which operators engage with the NOA system using natural language. In the NOA architecture, this UI is delivered through familiar enterprise surfaces—**the WebApp, Microsoft Teams, and Microsoft 365 Copilot**—allowing users to initiate workflows, review agent findings, approve actions, and observe outcomes without switching tools or learning new interfaces. Teams based agent interactions and supervisor controls now form a key architectural pillar.\n\n**What it enables**\n\n- Conversational interaction with the NOC Manager and specialist agents\n- Human-in-the-loop approvals for diagnostics, remediation, and ticket actions\n- Consistent experience across web, Teams, and Copilot while preserving enterprise identity and permissions\n\n### Agentic Governance\n\n**Agentic Governance** is the policy, safety, and control layer that enforces **Responsible AI**, security, compliance, and observability across all NOA agents and workflows. In the NOA architecture, this governance is provided by the **Foundry Control Plane** and associated guardrails, evaluations, audit logs, and operator views.\n\n**What it enables**\n\n- Runtime guardrails for content safety, PII protection, prompt injection, and tool misuse\n- Human-in-the-loop escalation and approval controls\n- Auditability, compliance reporting, and policy enforcement across all deployed agents\n\n**Foundry Control Plane**\n\nFoundry Control Plane functions as the **governance + observability + safety enforcement layer** that sits above the multi-agent system, ensuring agent workflows can run in production with the right controls. It is where governance, observability, security, and Responsible AI controls are enforced for agent workflows. It’s presented as the mechanism that turns the solution into a **scalable, governed, and enterprise-ready** operations framework.\n\nConcretely, the Foundry Control Plane provides:\n\n- **Guardrails (safety controls)**: a central place to apply and manage protections against harmful content, PII leakage, prompt injection, and off-topic drift—plus the ability to create custom guardrails tailored to telecom needs (e.g., restricting sensitive config exposure or limiting high-risk tool calls during incidents).\n- **Evaluations (quality and readiness checks)**: benchmarking agents via “evaluation runs” using built-in evaluators (accuracy, safety, coherence, domain quality), helping validate integrations (like MCP / Fabric) and catch regressions before rollout.\n- **Operator view for fleet monitoring**: centralized monitoring across deployed agents/channels, including fleet health (uptime, errors, sessions), performance (latency, token usage, throughput), and compliance signals (guardrail violations, policy alerts).\n- **Asset inventory and lifecycle management**: a unified inventory of deployed agents, models, and tools (e.g., MCP servers, Fabric Data Agents), supporting versioning, staging/rollback, usage analytics, credential rotation, and model policy enforcement.\n- **Compliance management**: centralized management of guardrails, policy templates, audit logs, and risk dashboards to produce audit-ready governance across the agent estate.\n\nFoundry Control Plane is the control-and-monitoring system that makes autonomous, multi-agent incident workflows safe, auditable, and operable at enterprise scale.\n\n**Agent 365**\n\nAgent 365 functions as the **enterprise management plane for AI agents**—the place where agents are registered, controlled, observed, and secured at scale.  Agent 365 is positioned as the **central control plane** that provides:\n\n- **Unified registry / inventory** of AI agents (a single place to manage what agents exist across the enterprise).\n- **Access control** so only the right users/roles can use particular agents and tools.\n- **Observability** to monitor agent usage and behavior across deployments.\n- **Enterprise security controls** applied consistently across agents and where they run.\n\nIn short, Agent 365 is the “management hub” for governing and operating the organization’s agent estate, complementing (and working alongside) the Foundry Control Plane’s runtime guardrails/evaluations and the broader multi-agent orchestration.\n\n### Agentic Framework\n\nThe **Agentic Framework** is the orchestration layer that enables **stateful, multi‑agent workflows** within the NOA system. Built on the **Microsoft Agent Framework**, it allows a **NOC Manager (Niobe)** to coordinate specialized agents (e.g., Troubleshooting, Telemetry, Ticketing, Field Ops) through delegated tasks, shared context, and ordered execution.\n\n**What it enables**\n\n- Vertical orchestration of specialized agents under a single supervisory control\n- Durable workflows spanning diagnosis, remediation, validation, and ticketing\n- Agent-to-Agent (A2A) communication and integration with external agents (e.g., ServiceNow)\n\n**Microsoft Agent Framework**\n\nThe Microsoft Agent Framework functions as the **foundation layer for building the Telco NOA solution’s stateful, multi-agent system**, providing the structure for how agents are defined, orchestrated, and operated end-to-end.\n\nSpecifically, the Microsoft Agent Framework enables:\n\n- **Stateful, multi-agent workflows for NOC operations**: it underpins the NOA platform, letting agents collaborate across a single incident while retaining shared context over time (not just one-off prompts).\n- A **centrally orchestrated (“vertically orchestrated”) model**: a **NOC Manager (Niobe)** manages task delegation, sequencing, and shared context across the workflow, while specialized agents (Troubleshooting, Incident Management, Field Ops, SONiC, Security & Compliance) execute domain-specific tasks.\n- **Secure cross-platform agent collaboration via A2A (agent-to-agent) communication**: external agents (example given: ServiceNow Now Assist) can plug into the ecosystem through A2A to enable coordinated actions across platforms.\n- **Operationalization of multi-agent systems with durable workflows**: an open-source SDK used for designing, orchestrating, and operationalizing multiagent systems with durable, stateful workflows.\n\nAll of that positions Microsoft Agent Framework as the **core multi-agent runtime/SDK layer** that makes the NOA incident flow (supervisor + specialist agents + external A2A agents) possible and maintainable as a workflow-driven system.\n\n**Foundry Workflows**\n\nFoundry Workflows function as the orchestration layer that defines, executes, and governs the end-to-end sequence of multiagent actions required to resolve network incidents in the Telco NOA Framework. The workflow models how tasks flow across agents—from initial intent capture through diagnostics, remediation, ticketing, verification, and closure—under the supervision of a central orchestrator agent.\n\nSpecifically, the workflow encodes the ordered handoffs and decision logic between agents such as the Supervisor Agent (Niobe), Network Telemetry Analyzer, Troubleshooting Agent (Pal Locke), SONiC Agent, Field Ops Agent, and Ticketing Agent. Rather than relying on static scripts or point integrations, the workflow graph visually and operationally represents how the Supervisor dynamically delegates tasks, routes context, and coordinates execution across specialized agents.\n\nFoundry Workflows also provide a testable and observable execution environment. Workflows can be previewed in a sandbox mode, allowing presenters to simulate real incident flows, trigger agent interactions via natural language prompts, and validate that tool calls (for example, MCP-based ServiceNow or TM Forum APIs) execute correctly before production deployment.\n\nDuring execution, the workflow enables full traceability and auditability. Debug and conversation detail views expose each step in the workflow, including routing decisions by the Supervisor, tool invocations, intermediate responses, and final outputs. This makes workflows not just an automation mechanism, but a governance artifact that supports troubleshooting, cost analysis, and compliance review.\n\nFinally, Foundry Workflows act as the deployment unit for operationalizing agentic solutions. Once validated, the same workflow can be published with one click to Microsoft Teams or Microsoft 365 Copilot, preserving guardrails, evaluations, RBAC, and monitoring. This allows the exact same orchestrated logic to run consistently across chat, Copilot, and custom channels without re‑engineering.\n\n### Telco IQ\n\nTelco IQ is the intelligence layer that grounds agent reasoning in telecom specific operational knowledge. In the NOA architecture, this intelligence is delivered through Foundry IQ and Fabric IQ, which provide retrieval augmented reasoning across structured telemetry, operational data, and unstructured domain knowledge.\n\n**What it enables**\n\n- Telecom aware reasoning using KPIs, SOPs, policies, and historical incidents\n- Multi-hop retrieval and citation backed answers\n- Reduced hallucinations through grounded, policy aware context\n\n**Fabric IQ**\n\nFabric IQ functions as the semantic intelligence layer that helps agents make better decisions by organizing operational + analytical data into business concepts, so the agents can reason over it more effectively (not just retrieve raw records). This dramatically simplifies connecting to data while improving the quality of the results.\n\n**Foundry IQ**\n\nFoundry IQ functions as the unified knowledge and retrieval layer that grounds the NOC agents with relevant, policy-aware context during incident troubleshooting. Foundry IQ is described as:\n\n- A **Foundry Knowledge Base** (built on Azure AI Search) that unifies content such as network security policies, troubleshooting guides, and SOP knowledge articles across sources including Microsoft 365/SharePoint, Fabric IQ/OneLake, Azure Blob Storage, ADLS Gen2, ServiceNow tables, and the web.\n- The capability that **automates key RAG pipeline steps**—including query planning, multi-hop reasoning, and answer synthesis with citations—so each agent doesn’t have to rebuild chunking, indexing, and connector logic per project.\n- A mechanism for **enterprise-grade security and governance**, explicitly leveraging Entra ID governance and respecting Microsoft Purview sensitivity labels, while reducing hallucinations through grounded retrieval.\n- The **knowledge backbone agents** rely on in the workflow: for example, the NOC Agent leverages the Foundry IQ knowledge base to retrieve operational insights and summarize likely causes, and other specialized agents (e.g., troubleshooting and security compliance).\n\n### Universal Data Access\n\n**Universal Data Access** is the data foundation that unifies real-time, structured, and unstructured data sources into a single, governable knowledge fabric for NOA agents. The architecture explicitly combines Microsoft Fabric Eventhouse, Azure Cosmos DB, ADLS Gen2, Azure Blob Storage, ServiceNow tables, and Microsoft 365 sources, all accessed through governed tools and identity passthrough.\n\n**What it enables**\n\n- Real‑time telemetry access for diagnostics and validation\n- Persistent conversational memory and incident history\n- Secure, identity aware access across enterprise and operational systems\n\n> >\n> **NOTE:** While the NOA Framework sample implementation and demo utilize this specific data architecture, the Framework can integrate into any existing data environment. The focus of NOA is to simplify and accelerate the development of network AI agents by leveraging your existing data estate.\n> >\n\nWith the included Microsoft Fabric connectors and OneLake virtualization, NOA can reason over:\n\n- Real‑time telemetry\n- OSS/BSS data\n- Ticketing systems\n- Multi-cloud or on-prem data stores\n\nThese updates collectively make NOA more scalable, more open, and easier to operationalize across diverse network environments.\n\n# Meet the Agents\n\nThe following agents are the core “cast” of the NOA. Each one represents a specialized capability (telemetry analysis, troubleshooting, device interaction, compliance validation, ticketing, and field operations) coordinated by a central supervisor.\n\n**NOC Manager Agent (Niobe)**\n\nThe central orchestrator and human interface: manages task delegation, sequencing, and shared context across workflows; coordinates the other specialized agents through Foundry’s runtime. This agent flags/triages critical tickets, coordinates with connected agents, and uses Foundry IQ to retrieve operational insights and summarize likely causes for the operator.\n\n**Network Telemetry Analyzer Agent**\n\nAnalyzes network performance metrics (e.g., packet loss, throughput) and uses the Fabric Data Agent to generate/execute KQL queries against the Fabric (Eventhouse/KQL DB) to support diagnostics and post-mitigation verification.\n\n**Network Troubleshooting Agent (Pal Locke)**\n\nRuns diagnostic playbooks and remediation steps; retrieves insights from Foundry IQ and proposes fixes via the SONiC Agent for device-level commands.\n\n**SONiC Agent**\n\nInterfaces directly with the network elements (e.g. SW-TOR-05 device) to execute commands and retrieve system-level data/telemetry (e.g., OS details, PFC watchdog stats, logs).\n\n**Network Security Compliance Agent**\n\nValidates post-mitigation QoS/SLA metrics (e.g. latency and jitter) using Foundry IQ, ensuring fixes remain within defined SLAs.\n\n**Ticketing Agent**\n\nManages incident tickets and documentation: creates/updates tickets, logs agent actions, supports auditing/handovers, and integrates via an MCP server exposing ServiceNow tools and TM Forum Trouble Ticket Open API to retrieve history for accurate categorization and updates.\n\n**Field Ops Agent (Miles Dyson)**\n\nHandles physical/field issues (e.g. fiber cuts) and collaborates with the appropriate teams via email.\n\n# Building the Autonomous Network Ecosystem\n\nNOA is intentionally designed as a **partner-extensible framework**, not a closed product. As a result, many partners are adopting NOA as a reference implementation for agentic operations—then integrating it into their existing agent framework, OSS/BSS, assurance, and automation portfolios to deliver differentiated autonomous network solutions for operators.\n\n### How partners are adopting NOA\n\n- **Starting point for agentic architecture**: using NOA’s supervisor + specialist agent pattern as the baseline for incident, problem, and change workflows.\n- **Accelerator for telco-grade governance**: adopting the guardrails, approvals, observability, and auditability concepts to meet operator safety and compliance expectations.\n- **Reference integration blueprint**: mapping NOA’s tool and API-driven approach (MCP, TM Forum Open APIs) onto their own integration adapters and connectors.\n- **Blueprint for the “UI for AI” in operations**: embedding agents into Teams/Copilot experiences to reduce swivel-chair work and drive practitioner adoption.\n- **Foundation for packaged offerings**: creating repeatable solution bundles (templates, playbooks, and connectors) that can be deployed across multiple operators with configuration, not re-engineering.\n\n### Integrating NOA into existing autonomous network solutions\n\nMost partners integrate NOA by keeping their domain platforms (assurance, orchestration, inventory, ticketing, observability) as the **systems of record**, while positioning NOA as the **agentic orchestration and experience layer** that coordinates people, tools, and workflows end-to-end. Practically, this integration typically follows a repeatable sequence:\n\n1. **Choose the first high-value workflow** (for example: P1 incident triage, RAN anomaly investigation, transport fault isolation, or trouble ticket enrichment) and define clear success metrics (MTTD/MTTR reduction, ticket quality, deflection rate).\n2. **Connect tools through MCP and Open APIs**, exposing partner and operator capabilities (queries, actions, validations) as governed tools the agents can call deterministically.\n3. **Ground agents in partner/operator knowledge** by connecting SOPs, topology, inventory, prior incidents, and KPI definitions via retrieval and curated context.\n4. **Implement policy gates and RBAC** so that high-risk actions (config changes, mass remediation, ticket closure) require explicit human approval and are fully logged.\n5. **Operationalize with testing and observability**, using evaluation runs, traces, and runbooks to validate correctness and monitor agent behavior in production.\n\n### Where partners extend NOA to differentiate\n\nPartners extend NOA to differentiate on top of an open agentic foundation by combining Microsoft’s orchestration with deep domain expertise and proprietary IP. Packaged solutions, multi‑vendor interoperability, and a consistent Teams/Copilot‑based operations experience ensure scalability while preserving a familiar NOC workflow.\n\n- **Domain-specialized agents**: adding RAN, core, transport, edge, and security agents tailored to vendor-specific telemetry, counters, and remediation procedures.\n- **Proprietary reasoning and models**: incorporating partner algorithms (anomaly detection, RCA graphs, topology analytics) and selecting models suited to latency/cost/regulatory needs.\n- **Closed-loop automation**: integrating with orchestration/controllers to move from “recommend” to “execute” in bounded, policy-approved scenarios (for example, self-healing with automatic rollback).\n- **Vertical solution packaging**: delivering repeatable “packs” (connectors + prompts + workflows + dashboards) for specific operator pain points.\n- **Multi-vendor interoperability**: normalizing data and actions across heterogeneous network domains using TM Forum Open APIs and partner mediation layers.\n- **Operations experience**: embedding NOA into partner portals and NOC tooling while maintaining a consistent Teams/Copilot experience for daily operations.\n\n### Co-innovation and operating model\n\nSuccessful partner implementations treat NOA as a **living operations capability** that is improved continuously—not a one-time integration. Partners typically establish a shared lifecycle with operators that covers solution design, governance, deployment, and ongoing optimization.\n\n- **Clear RACI**: which actions agents may take autonomously vs. which require NOC supervisor approval vs. which must be escalated to engineering.\n- **Evaluation and release management**: versioned prompts/workflows, pre-production evaluation runs, and rollback plans aligned to telco change-control practices.\n- **Safety-by-design**: read-only defaults, least-privilege tool access, and explicit policy gates around configuration, customer impact, and data handling.\n- **Observability as a first-class requirement**: tracing, action logging, and dashboards for quality, latency, and cost—plus incident reviews that include agent performance and tool outcomes.\n- **Knowledge ops**: continuously curating SOPs, updating topology/inventory context, and incorporating learnings from resolved incidents to reduce repeat failures.\n\nTaken together, these adoption patterns show how NOA is becoming a **common architectural baseline** that partners can integrate into their portfolios and extend with domain expertise—helping operators move faster toward safe, scalable autonomy while preserving differentiation where it matters most.\n\n### Partner Solutions\n\nMicrosoft is actively working with a number of GSI and ISV partners on integrating NOA concepts into their solutions. Partners include:\n\n**Global Systems Integrators**\n\nProvide professional services to build, connect and ground you agent orchestration and data modernisation with Microsoft Fabric and Microsoft Foundry.\n\n**Independent Software Vendors**\n\nTurnkey, packaged solutions that include RAN & Core optimization agents, telco ontologies, or network insights which integrate or leverage the NOA architecture.\n\n**Kenmei** [announced its collaboration with Microsoft](https://aka.ms/KenmeiANAnnouncement) to help operators accelerate their path toward autonomous networks by combining Kenmei’s telecom intelligence offer with Azure and [Microsoft Fabric](https://www.microsoft.com/en-us/microsoft-fabric) to enable scalable analytics and agentic AI–powered operations. Already in use at leading operators like Telefónica and etisalat (e&), this collaboration brings proven deployments into a broader cloud and AI ecosystem designed to reduce manual effort, speed decision‑making, and unlock new levels of network automation.\n\n# Advancing the Journey\n\nLooking ahead, Microsoft remains committed to advancing telco autonomy through:\n\n**Continued expansion of agent capabilities**\n\nFuture releases will bring additional agent roles, deeper coordination patterns, and broader integration with OSS/BSS systems—reflecting the trajectory of NetAI’s evolving multi‑agent ecosystem.\n\n**Accelerated partner and customer enablement**\n\nA **downloadable NOA Framework accelerator**, combining reference architectures, prompt libraries, agent templates, and deployment assets, will be made available in **April 2026**.\n\n**Reinforcement of openness**\n\nNOA will continue to support:\n\n- Third-party agent onboarding\n- Interoperability via MCP and TM Forum Open APIs\n- Hybrid network environments\n- Open‑source extensibility through Foundry components\n\nThis ensures operators retain maximum flexibility while adopting autonomous operations.\n\n# Closing: The Road to Autonomous Networks\n\nAs telcos navigate increasing complexity and rising expectations, the enhanced NOA Framework provides a practical, modular, and secure path toward autonomous operations.\n\nBy combining the intelligence of multi‑agent systems, the familiarity of Teams and Copilot, the power of Microsoft Foundry, and the safety of strong governance, NOA helps operators boost reliability, reduce MTTR, and simplify operations at scale.\n\nWe invite you to explore the documentation, demos, and community resources at **Mobile World Congress 2026** to learn how NOA can accelerate your autonomous network journey.\n\nPublished Feb 24, 2026\n\nVersion 1.0\n\n[ai ops](/tag/ai%20ops?nodeId=board%3Atelecommunications-industry-blog)\n\n[!\\[rickliev&#x27;s avatar\\](https://techcommunity.microsoft.com/t5/s/gxcuf89792/images/dS00Mzc4OS0zNTkxNjRpODE3NEJFMDk3QjM5RjQ2NA?image-dimensions=50x50)](/users/rickliev/43789) [rickliev](/users/rickliev/43789) ![Icon for Microsoft rank](https://techcommunity.microsoft.com/t5/s/gxcuf89792/images/cmstNC05WEo0blc?image-dimensions=100x16&amp;constrain-image=true)Microsoft\n\nJoined March 14, 2017\n\n[View Profile](/users/rickliev/43789)\n\n/category/azure/blog/telecommunications-industry-blog [Telecommunications Industry Blog](/category/azure/blog/telecommunications-industry-blog) Microsoft partners with the telecommunications industry to unlock the power of 5G and bring the cloud and edge closer than ever.",
  "OutputDir": "_community",
  "Tags": [],
  "ProcessedDate": "2026-02-24 13:29:18",
  "Link": "https://techcommunity.microsoft.com/t5/telecommunications-industry-blog/evolving-the-network-operations-agent-framework-driving-the-next/ba-p/4496607",
  "FeedUrl": "https://techcommunity.microsoft.com/t5/s/gxcuf89792/rss/Category?category.id=Azure",
  "Author": "rickliev"
}
