{
    "title": "The GitHub Copilot Handbook",
    "description": "A practical guide to transforming the software development lifecycle with GitHub Copilot",
    "authors": [
        "Rob Bos",
        "Randy Pagels"
    ],
    "bookDetails": {
        "publisher": "Packt Publishing",
        "released": "November 2025",
        "pages": 295
    },
    "intro": "Cross-functional product teams are under constant pressure to build and ship faster, but too much time is lost to manual coding, slow reviews, and fragmented workflows. The GitHub Copilot Handbook shows you how to use AI-powered features to help with regular coding tasks so your team can focus on adding value to end users.",
    "purchaseLink": {
        "url": "https://www.amazon.com/GitHub-Copilot-Handbook-programming-collaboration/dp/1806116634",
        "text": "Get the book on Amazon"
    },
    "aboutBook": [
        "Written by industry experts Rob Bos and Randy Pagels — trainers who've helped hundreds of teams successfully adopt GitHub Copilot — this book showcases how GitHub Copilot impacts all aspects of engineering work, from ideation and requirements gathering to writing code and scripts to testing and debugging.",
        "Published by Packt Publishing in November 2025, this comprehensive 295-page guide explores advanced features like GitHub Copilot pull request suggestions, multi-file awareness, and contextual prompting. You'll discover how to integrate GitHub Copilot into your team's workflows, roll it out successfully across roles, boost cross-role collaboration, and build a culture of AI adoption that scales."
    ],
    "learnings": [
        "Apply GitHub Copilot across the full software development lifecycle",
        "Understand how AI powers suggestions and where its limits are",
        "Boost productivity by automating tests, reviews, and pipeline fixes",
        "Integrate Copilot into IDEs and GitHub for maximum value",
        "Roll out Copilot across teams with proven onboarding strategies",
        "Build a knowledge-sharing culture with Copilot community champions"
    ],
    "audience": {
        "intro": "This book is built for anyone working in the software engineering industry. Whether you're a developer, tech lead, QA engineer, DevOps team member, or product manager, if your work touches code — writing it, testing it, or reviewing it — you'll find practical ways to put GitHub Copilot to work.",
        "details": "The book includes understanding adoption strategies and the learning curve involved. No AI expertise is required, just a drive to ship faster, collaborate better, and work smarter with generative AI."
    },
    "keyFeatures": [
        {
            "title": "Automate your workflow",
            "description": "Learn how to automate code generation, test writing, and debugging with AI across your development workflow"
        },
        {
            "title": "Advanced features",
            "description": "Explore GitHub Copilot's advanced features like PR reviews, error insights, and Copilot Chat"
        },
        {
            "title": "Team adoption",
            "description": "Scale Copilot across dev, QA, and PM roles with guided onboarding and practical usage patterns"
        }
    ],
    "tableOfContents": [
        "GitHub Copilot Explained",
        "Getting Started with Generative AI",
        "Choosing the Right GitHub Copilot Plan",
        "Reviewing GitHub Copilot IDE Functionality",
        "Exploring Integrated GitHub Copilot IDE Functionalities",
        "Discovering GitHub Copilot Features on GitHub.com",
        "Integrations on GitHub",
        "Extending Copilot with Extra Context",
        "Learning Curve",
        "Community: Sharing Examples",
        "Changing the Narrative"
    ],
    "authorBios": [
        {
            "name": "Rob Bos",
            "bio": "Rob Bos is a Microsoft MVP, GitHub Star, and trainer focused on DevOps, GitHub Actions, and team enablement. He empowers teams to work smarter with GitHub tools, automating processes, improving security, and driving value delivery through practical, hands-on learning. Rob speaks at conferences worldwide and shares his insights through blogs, courses, and workshops."
        },
        {
            "name": "Randy Pagels",
            "bio": "Randy Pagels is a Microsoft MVP and Principal Trainer at Xebia USA, with over 17 years at Microsoft. He delivers hands-on training on GitHub topics from Copilot and Advanced Security to Prompt Engineering and beyond. Known for his engaging style and practical focus, Randy helps teams confidently adopt AI-driven development practices through real-world scenarios, interactive workshops, and scalable learning formats."
        }
    ],
    "conclusion": "By the end of the book, you'll understand where GitHub Copilot makes an impact, moving beyond autocomplete and unlocking its full power across the entire software development lifecycle. This isn't just about individual productivity — it's about enabling your entire team to work smarter, faster, and more collaboratively with AI. The book takes you beyond basic code completion to explore how GitHub Copilot can transform every phase of development, from planning and ideation through deployment and maintenance."
}