{
  "PubDate": "2026-01-15T09:00:00+00:00",
  "OutputDir": "_news",
  "Link": "https://blog.fabric.microsoft.com/en-US/blog/how-the-microsoft-sql-team-is-investing-in-sql-tools-and-experiences/",
  "FeedLevelAuthor": "Microsoft Fabric Blog",
  "Title": "How the Microsoft SQL team is investing in SQL tools and experiences",
  "ProcessedDate": "2026-01-15 16:05:36",
  "Tags": [],
  "Author": "Microsoft Fabric Blog",
  "FeedName": "Microsoft Fabric Blog",
  "EnhancedContent": "The SQL tools and experiences team at Microsoft is full of product leaders and engineers who care about YOU and your productivity at every stage. We focus on building the tools, SDKs, and experiences that matter most—so you can get the greatest value from [Microsoft SQL Server](https://aka.ms/sqlserver2025blog), [Azure SQL](https://azure.microsoft.com/products/azure-sql/?ef_id=_k_8408a63efd9a181215a9cf19ba079774_k_&amp;OCID=AIDcmm5edswduu_SEM__k_8408a63efd9a181215a9cf19ba079774_k_&amp;msclkid=8408a63efd9a181215a9cf19ba079774), [SQL database in Fabric](https://learn.microsoft.com/fabric/database/sql/overview) and [Fabric Data Warehouse](https://learn.microsoft.com/fabric/data-warehouse/data-warehousing). You-the community, the customers-are our top priority. We’d like to take a moment to explain where we are currently investing to meet your needs.\n\nFrom a tooling perspective, we are investing heavily in SQL Server Management Studio (SSMS) and the MSSQL extension for Visual Studio Code (VS Code). SSMS is where we primarily aim to serve data professionals like you—including DBAs, data analysts, database developers, data scientists, data engineers—and we have been doing so for two decades now. The MSSQL extension for VS Code is where we primarily aim to serve application developers. Additionally, from a web interface perspective, we are investing in the Azure portal and Fabric web experiences to support Azure and Fabric cross-functional roles and tasks to be done.\n\nIn the past year, we’ve modernized SSMS—now based on the latest release of Visual Studio—and brought in number customer requests including dark mode, Arm64 support, Fabric support, GitHub Copilot, [and more](https://learn.microsoft.com/ssms/release-notes-22-preview). We also brought rich, AI-assisted experiences to VS Code with GitHub Copilot Ask and Agent mode support, in addition to many new and improved capabilities in areas around designing schemas and tables; provisioning and getting connected (including Fabric and local containers); query results; [and more](https://github.com/microsoft/vscode-mssql/wiki/roadmap). In the web, we launched a [unified Azure SQL experience](https://aka.ms/azuresqlhub) in the Azure portal and shipped [SQL database in Fabric](https://learn.microsoft.com/fabric/database/sql/overview), now generally available.\n\nAlong with delivering reliable updates and consistent features in these tools, we are working toward an even better future for Microsoft SQL users. Our vision is to equip every database with source control and CI/CD integration; streamline trusted and reliable deployments; provide consistent and tailored Copilot experiences; and deliver modern drivers, SDKs and CLIs as well as a robust data API and MCP Server. We’re also investing in rich experiences that help developers take full advantage of AI capabilities in the SQL engine, making it easier to build and optimize AI-ready applications.\n\nDelivering on that vision requires focus and critical prioritization—responsibilities we’re approaching with deep consideration and increased transparency. Full roadmap details across our tools and experiences can be found at the end of this article. If you were using [Azure Data Studio](https://aka.ms/ads-retirement) or SDK-style SQL projects in Visual Studio 2022 and are impacted by their retirement, you can still use the original SQL projects in Visual Studio 2026 so that your established solutions can upgrade to the latest Visual Studio version without compatibility conflicts. SDK-style (Microsoft.Build.Sql) projects are generally available in VS Code with the SQL Database Projects extension and are directly integrated with SQL database in Fabric source control. In the first half of 2026, SDK-style SQL projects [will be added to SQL Server Management Studio](https://developercommunity.visualstudio.com/t/Add-support-for-SQL-database-projects/10864596), empowering more database professionals with foundational tools for database DevOps.\n\nWe appreciate your ongoing feedback, both now and in the future, as it is essential for us to understand your requirements regarding SQL tooling. This process provides value not only to you and our team, but also to the broader community.\n\n## Review roadmaps, join the conversation, and share your feedback\n\n- [SSMS roadmap](https://learn.microsoft.com/ssms/roadmap)\n- [SSMS Feedback site](https://aka.ms/ssms-feedback)\n- [MSSQL extension for VS Code roadmap](https://aka.ms/vscode-mssql-roadmap)\n- [MSSQL extension for VS Code feedback](https://github.com/microsoft/vscode-mssql/issues)\n- [SQL projects and DacFx feedback](https://github.com/microsoft/dacfx)\n- [Microsoft SQL Feedback site](https://feedback.azure.com/d365community/forum/04fe6ee0-3b25-ec11-b6e6-000d3a4f0da0)\n- [SQL database in Fabric roadmap](https://roadmap.fabric.microsoft.com/?product=sqldatabase), [SQL database in Fabric Ideas site](https://community.fabric.microsoft.com/t5/Fabric-Ideas/idb-p/fbc_ideas/label-name/databases%20%7C%20sql%20database)",
  "FeedUrl": "https://blog.fabric.microsoft.com/en-us/blog/feed/",
  "Description": "The SQL tools and experiences team at Microsoft is full of product leaders and engineers who care about YOU and your productivity at every stage. We focus on building the tools, SDKs, and experiences that matter most—so you can get the greatest value from Microsoft SQL Server, Azure SQL, SQL database in Fabric and Fabric …\n\n[Continue reading “How the Microsoft SQL team is investing in SQL tools and experiences”](https://blog.fabric.microsoft.com/en-us/blog/how-the-microsoft-sql-team-is-investing-in-sql-tools-and-experiences/)"
}
