{
  "FeedName": "Microsoft Fabric Blog",
  "FeedLevelAuthor": "Microsoft Fabric Blog",
  "PubDate": "2026-01-28T14:00:00+00:00",
  "Title": "Fabric Connection inside Notebook (Preview)",
  "EnhancedContent": "The Get Data with Cloud Connection is a cross-Fabric capability that supports a broad range of data sources—including Azure Blob Storage, PostgreSQL, Azure Key Vault, S3, and many more.\n\nNow available directly within notebooks, this feature empowers users to efficiently and securely access and manage data from diverse sources. Importantly, it provides a secure way to handle data source credentials inside notebooks, ensuring your data connections are both convenient and protected.\n\nThis release supports only cloud data sources. For the on-premises data source, please choose [Managed Private Endpoint](https://learn.microsoft.com/fabric/security/security-managed-private-endpoints-overview) to access the on-premises data.\n\n## How to create Fabric Connection inside Notebook\n\nYou can create the connection from inside Notebook’s New Connection flow and from the Fabric data source management page.\n\nTo create a new connection inside notebook:\n\n1. Select the **Add connection** button under the **Connection** tab within Notebook Explorer.\n2. Choose the data source to be accessed and provide the credential detail needed to set up the connection. The supported authentication types include:\n- **Basic Authentication:** Supported for Azure SQL Database and other databases that support basic authentication.\n- **Account Key Authentication:** Supported for REST API data sources that require. Account key authentication.\n- **Token Authentication:** Supported data sources that require token-based authentication.\n- **Workspace Identity Authentication:** Supported for Fabric workspace identity authentication.\n- **Service Principal Authentication (SPN):** Supported for data sources that require SPN-based authentication.\n\n![Create a Fabric Connection with the build-in flow inside notebook. User can choose the data source and provide the authentication detail to create the connection. The connection is attached to the Notebook after this flow.](//dataplatformblogwebfd-d3h9cbawf0h8ecgf.b01.azurefd.net/wp-content/uploads/2026/01/a-screenshot-of-a-computer-description-automatica-4.png)Create Fabric connection inside Notebook\n\nOnce the connection is created, it will show under the **Current Notebook** node, indicating it is linked to the notebook and ready to use.\n\n## Create a new connection inside Fabric data source management page:\n\n1. Select the toggle named **Allow Code-First Artifacts like Notebooks to access this connection (Preview)** to enable the connection to be used in notebooks. This toggle can only be set during the creation of the connection and can’t be modified later.\n\n![Enable this connection can be used inside the code-first artifact such as Notebook. The connection can be listed and used inside notebook only with this toggle is selected](//dataplatformblogwebfd-d3h9cbawf0h8ecgf.b01.azurefd.net/wp-content/uploads/2026/01/a-screenshot-of-a-computer-description-automatica-5.png)Allow code-first artifact like notebook to access this connection\n\n2. After creating the connection, it appears under **Global permissions**, ready to link to the notebook. Selecting **Connect** in the context menu should link this connection to the notebook.\n\n### How to use Fabric Connection inside notebook\n\nOnce the Fabric Connection is created and bound to the current notebook, you can generate code snippets to access the data source directly from the notebook.\n\n1. Locate the connection in the **Current Notebook** node.\n2. Select the **ellipsis (…)**, then **Add as code cell** from the context menu.\n\n![Generate the python code snippet from the connection. The credential detail will be retrieved from the connection and used to query the data source which this connection is set up for.](//dataplatformblogwebfd-d3h9cbawf0h8ecgf.b01.azurefd.net/wp-content/uploads/2026/01/a-screenshot-of-a-computer-description-automatica-6.png)Generate code snippet to query data source\n\nThe code retrieves the connection credentials, uses them to set up the data source client, and then runs a query, which you can modify as needed. If the required packages aren’t present in the runtime, a preceding code cell with a pip install command appears. Run that cell before running the query.\n\nThe following is an example of code snippet generated for an Azure SQL Cosmos DB connection:\n\nfrom azure.cosmos import CosmosClient\n\nimport json\n\nimport pandas as pd\n\nconnection\\_id = ‘9d405da3-3d11-481a-9022-xxxxxxxxxxx’ # connection name: “neweventdb qixwang”\n\nconnection\\_credential = notebookutils.connections.getCredential(connection\\_id)\n\ncredential\\_dict = json.loads(connection\\_credential[‘credential’])\n\nkey = next(item[‘value’] for item in credential\\_dict[‘credentialData’] if item[‘name’] == ‘key’)\n\nendpoint = ‘https://userevent.documents.azure.com:443/’\n\nclient = CosmosClient(endpoint, credential=key)\n\ndatabases = list(client.list\\_databases())\n\ndatabase = databases[0]\n\ndatabase\\_client = client.get\\_database\\_client(database[‘id’])\n\ncontainers = list(database\\_client.list\\_containers())\n\ncontainer = containers[0]\n\ncontainer\\_name = container[‘id’]\n\ncontainer\\_client = database\\_client.get\\_container\\_client(container\\_name)\n\nquery = f”SELECT \\* FROM {container\\_name} p”\n\nitems = list(container\\_client.query\\_items(query=query, enable\\_cross\\_partition\\_query=True))\n\ndf = pd.DataFrame(items)\n\ndisplay(df)\n\n### Connection permission requirements\n\n- When you run the notebook, a permission check makes sure you have the permissions needed to use the connection. If you don’t have permission, the notebook shows an error message. If you share the notebook with other users, they also need the right permissions to use the connection and run the code cell.\n- If Workspace Identity or Service Principal Authentication (SPN) is selected as the authentication type, make sure WI/SPN has been assigned the proper permission to access the data source.\n\nTo learn more, refer to [Fabric connection inside Notebook](https://learn.microsoft.com/fabric/data-engineering/fabric-connection-with-notebook) and share your feedback in the Fabric Data engineering community in [Fabric Ideas](https://community.fabric.microsoft.com/t5/Data-Engineering-forums/ct-p/dataengineering) or [Reddit.](https://www.reddit.com/r/MicrosoftFabric/)",
  "ProcessedDate": "2026-01-28 21:06:05",
  "Author": "Microsoft Fabric Blog",
  "Tags": [],
  "Description": "The Get Data with Cloud Connection is a cross-Fabric capability that supports a broad range of data sources—including Azure Blob Storage, PostgreSQL, Azure Key Vault, S3, and many more. Now available directly within notebooks, this feature empowers users to efficiently and securely access and manage data from diverse sources. Importantly, it provides a secure way …\n\n[Continue reading “Fabric Connection inside Notebook (Preview)”](https://blog.fabric.microsoft.com/en-us/blog/32822/)",
  "OutputDir": "_news",
  "Link": "https://blog.fabric.microsoft.com/en-US/blog/32822/",
  "FeedUrl": "https://blog.fabric.microsoft.com/en-us/blog/feed/"
}
