{
  "FeedLevelAuthor": "Microsoft Fabric Blog",
  "ProcessedDate": "2026-02-09 17:19:54",
  "Link": "https://blog.fabric.microsoft.com/en-US/blog/manual-update-for-on-premises-data-gateway-public-preview/",
  "FeedUrl": "https://blog.fabric.microsoft.com/en-us/blog/feed/",
  "Description": "The On-premises Data Gateway manual update feature is now available in preview! This new capability simplifies gateway maintenance and helps you keep your environment secure and up to date with greater flexibility and control. With this new feature, administrators can now manually trigger updates—either directly through the gateway UI or programmatically via API or script. …\n\n[Continue reading “Manual update for on-premises data gateway (Preview)”](https://blog.fabric.microsoft.com/en-us/blog/manual-update-for-on-premises-data-gateway-public-preview/)",
  "Author": "Microsoft Fabric Blog",
  "PubDate": "2026-02-09T10:00:00+00:00",
  "FeedName": "Microsoft Fabric Blog",
  "Title": "Manual update for on-premises data gateway (Preview)",
  "EnhancedContent": "The On-premises Data Gateway **manual update feature** is now available in preview! This new capability simplifies gateway maintenance and helps you keep your environment secure and up to date with greater flexibility and control.\n\nWith this new feature, administrators can now **manually trigger updates**—either directly through the gateway UI or programmatically via API or script. This ensures that you can manage update timing based on your organization’s internal policies and maintenance windows while still benefiting from the latest features, performance improvements, and security patches.\n\nThis public preview marks the **first step toward a fully automated update experience**, giving IT admins a smoother and safer way to stay current without unexpected interruptions. It also helps organizations maintain compliance and operational stability by allowing controlled rollout of gateway updates across multiple servers or clusters.\n\nNote: The **November 2025 release** serves as the **baseline version** for this feature. Customers can start performing **manual updates beginning in December 2025**. Future releases will continue to build on this capability, introducing additional automation and management options.\n\n## How to get started\n\n1. Make sure your gateway is updated to the **November 2025 baseline version**.\n2. Once available in December, open the **on-premises data gateway UI** to check for updates.\n\n![On-premises data gateway manual update screen showing the current gateway version, available update version.](//dataplatformblogwebfd-d3h9cbawf0h8ecgf.b01.azurefd.net/wp-content/uploads/2025/10/image-78.png)On-premises data gateway manual update experience, allowing administrators to know the availability of newer version.\n1. When an update is available, simply click the update icon to begin the manual update process.\n\n![On-premises data gateway manual update screen showing a “Update” button for administrators to manually trigger the upgrade.](//dataplatformblogwebfd-d3h9cbawf0h8ecgf.b01.azurefd.net/wp-content/uploads/2025/10/image-79.png)On-premises data gateway manual update experience, allowing administrators to trigger the gateway upgrade on demand.\n1. Alternatively, you can use PowerShell or scripts to initiate updates programmatically.\n\nExample:\n\n*PS C:\\&gt; Update-DataGatewayClusterMember -GatewayClusterId DC8F2C49-5731-4B27-966B-3DB5094C2E77*\n\n## Looking ahead\n\nThe manual update feature lays the foundation for our upcoming **auto-update capability**, which will further streamline gateway maintenance with minimal user intervention. We’ll continue to share updates as we move toward general availability.\n\nYou can also learn more about our current capabilities through: [Update an on-premises data gateway | Microsoft Learn](https://learn.microsoft.com/data-integration/gateway/service-gateway-update?toc=%2Ffabric%2Fdata-factory%2Ftoc.json&amp;bc=fabric%2Fdata-factory%2Fbreadcrumb%2Ftoc.json#update-gateways-from-the-ui-preview)",
  "OutputDir": "_news",
  "Tags": []
}
