{
  "FeedName": "Microsoft Fabric Blog",
  "Description": "Why process database changes in real-time Modern applications don’t just store data—they react to it. Orders are placed, inventory levels change, prices are updated. Each of these changes can be a signal that something needs to happen now: update a dashboard, trigger a workflow, or feed an operational application. That is why many organizations are …\n\n[Continue reading “Processing CDC streams using Fabric Eventstreams SQL”](https://blog.fabric.microsoft.com/en-us/blog/processing-cdc-streams-using-fabric-eventstreams-sql/)",
  "Link": "https://blog.fabric.microsoft.com/en-US/blog/processing-cdc-streams-using-fabric-eventstreams-sql/",
  "Tags": [],
  "Title": "Processing CDC streams using Fabric Eventstreams SQL",
  "FeedUrl": "https://blog.fabric.microsoft.com/en-us/blog/feed/",
  "Author": "Microsoft Fabric Blog",
  "PubDate": "2026-02-24T10:00:00+00:00",
  "FeedLevelAuthor": "Microsoft Fabric Blog",
  "ProcessedDate": "2026-02-24 17:21:30",
  "EnhancedContent": "## Why process database changes in real-time\n\nModern applications don’t just store data—they react to it. Orders are placed, inventory levels change, prices are updated. Each of these changes can be a signal that something needs to happen now: update a dashboard, trigger a workflow, or feed an operational application.\n\nThat is why many organizations are turning to **real-time processing of database change data capture (CDC) events** instead of waiting for batch pipelines to catch up.\n\nFabric Eventstreams can ingest CDC data directly from **Azure SQL, PostgreSQL, MySQL,** and several other databases. For relational sources, the changes are streamed into Eventstreams using Debezium, a standard CDC format.\n\nThe challenge is not getting the CDC events—it’s making sense of them. Raw CDC formats, like Debezium, force every downstream consumer to understand low-level semantics and encoding formats.\n\n## The challenge of CDC streams\n\nRaw CDC events are rich, but verbose. They include nested *before* and *after* images, operation types, transaction metadata, and source details. While powerful, this format often forces every downstream consumer including analytics queries, alerts, operational dashboards, to understand low‑level CDC semantics and write custom JSON parsing logic.\n\n![Screenshot of JSON object showing transaction details for a sale event, including TransactionID, Timestamp, StoreID, ProductID, Quantity, and TotalAmount. The object also includes source metadata with connector metadata, source database and table information.](//dataplatformblogwebfd-d3h9cbawf0h8ecgf.b01.azurefd.net/wp-content/uploads/2026/02/screenshot-of-json-object-showing-transaction-deta.png)\n\n*Figure: Example of a raw Debezium CDC event*\n\n## Shape CDC events once in Eventstream using SQL\n\nFabric Eventstreams provides SQL operators that let you **centralize CDC shaping in one place**, instead of pushing that complexity to every consumer.\n\nTo see how this works, let’s work through a simple scenario involving grocery store sales and inventory changes.\n\n## Scenario: Grocery store sales and inventory changes flowing from Azure SQL DB\n\nImagine an Azure SQL database backing a statewide grocery system with two main tables that change with every transaction.\n\n- **SalesTransactions** – records sales and returns (mostly insert)\n- **ProductInventory** – tracks inventory levels as products are sold and replenished (inserts and updates)\n\nA common requirement is to monitor inventory levels in near real-time and alert procurement teams when stocks run low.\n\nIf you connect this database to an Eventstream using the Azure SQL CDC connector and route the data directly to an Eventhouse or Lakehouse, all CDC events, across all tables, land in a single destination table as raw JSON.\n\n![Screenshot of a Eventhouse table named GrocerySalesTrackingRaw displaying raw JSON data entries related to grocery sales transactions. The interface includes a data activity tracker with a timeline graph, tabs for data preview and schema insights, and a search bar for filtering keywords within the dataset.](//dataplatformblogwebfd-d3h9cbawf0h8ecgf.b01.azurefd.net/wp-content/uploads/2026/02/screenshot-of-a-eventhouse-table-named-grocerysale.png)\n\n*Figure 2: Raw CDC events in a single Eventhouse ingestion table*\n\nAt this point, it becomes the user’s responsibility to:\n\n- Filter relevant tables\n- Parse nested JSON payloads\n- Normalize events into clean, query-able shapes\n\n### Shaping CDC event feeds with Eventstreams SQL\n\nWith Eventstreams SQL, you can transform raw CDC events into business‑ready streams using a small amount of familiar SQL.\n\n1. Filters for data-change (DML) events.\n2. Selects events from the ‘*ProductInventory*’ table.\n3. Flattens the “after” image into separate columns that reflect the source table schema.\n4. Retains key metadata like operation, source table information, timestamp etc.\n\n``` SELECT -- EXTRACT THE REQUIRED SOURCE METADATA INFORMATION payload.op AS OperationType, payload.source.db AS SourceDatabase, payload.source.[schema] AS SourceSchema, payload.source.[table] AS SourceTable, payload.source.[table] AS SourceTable, -- EXTRACT ALL THE SOURCE TABLE COLUMNS USING A WILDCARD payload.[after].* INTO [grocerystoreinventory-table] FROM [grocerystoreinventory-es-stream] WHERE (payload.[after] IS NOT NULL OR payload.before IS NOT NULL) AND payload.source.[table] = 'ProductInventory' ```\n\nThe result is a normalized stream where each row reflects the source table schema—no nested JSON, no custom parsing. Instead of working with opaque payloads, downstream systems can now reason about structured, meaningful data.\n\n![Screenshot of data preview displaying product inventory details including product category, event timestamp, product ID, product name, store ID, store name, location, and price. This table highlights the transformation of the raw CDC event into a shape that more closely reflects the source table schema along with some Debezium metadata.](//dataplatformblogwebfd-d3h9cbawf0h8ecgf.b01.azurefd.net/wp-content/uploads/2026/02/screenshot-of-data-preview-displaying-product-inve.png)\n\n*Figure: Data preview of a normalized flattened CDC feed*\n\n### Putting it all together\n\nThe previous pattern changes how teams work with CDC:\n\n- **CDC complexity is handled once** in Eventstreams.\n- Downstream consumers focus on business logic, not parsing.\n- The same normalized stream can power analytics, alerts, and applications.\n- Changes to CDC logic don’t require rewriting every consumer.\n\nWith just a small amount of SQL, raw CDC events are transformed from low-level database changes into analytics-ready streams that are easy to reason about and easy to use with:\n\n- **Eventhouse** for real-time analytics.\n- **Lakehouse** for historical analytics & model-training using Fabric Spark.\n- **Activator** to trigger alerts or workflows.\n\nInstead of forcing every consumer to understand CDC semantics, **that logic is centralized once — in SQL**.\n\n### Need to do more?\n\nIn a full production system, you may have more complex requirements. You can meet all of those (and more) using simple techniques and capabilities in Eventstreams SQL.\n\n- Need only specific columns from a given source table? Just explicitly specify each column you need in the SELECT statement e.g. “*payload.[after].StoreID AS StoreID*”.\n- Want to reuse the core shaping and metadata extraction logic? Use the [WITH](https://learn.microsoft.com/stream-analytics-query/with-azure-stream-analytics) statement to do exactly that.\n- Want to add your own custom logic when processing CDC events for a specific table? Use the [WITH](https://learn.microsoft.com/stream-analytics-query/with-azure-stream-analytics) statement in conjunction with a SELECT statement filtered to the events for the specific table.\n\n### What’s next?\n\nAs systems grow and complexity with more tables, frequently evolving schemas, and higher event volumes, CDC processing must scale without adding operational burden.\n\nStay tuned for some exciting announcements in the coming weeks!\n\n## Get started today\n\nReady to get started with these ideas? Explore the following resources to help you get started.\n\n[Microsoft Fabric Eventstreams Overview](https://learn.microsoft.com/fabric/real-time-intelligence/event-streams/overview?tabs=enhancedcapabilities)\n\n[Add Azure SQL Database CDC source to an eventstream](https://learn.microsoft.com/fabric/real-time-intelligence/event-streams/add-source-azure-sql-database-change-data-capture?pivots=extended-features)\n\n[Process Events Using a SQL Operator](https://learn.microsoft.com/fabric/real-time-intelligence/event-streams/process-events-using-sql-code-editor)\n\n## We’d love your feedback!\n\nIf you find this blog helpful, please give it a thumbs up!\n\nWe would love to hear what real-time scenarios you’re exploring and what topics you’d like us to cover in future posts. Drop us a comment or reach out to us at [askeventstreams@microsoft.com](mailto:askeventstreams@microsoft.com)\n\nHave new feature ideas? Submit them at [Fabric Ideas – Microsoft Fabric Community](https://community.fabric.microsoft.com/t5/Fabric-Ideas/idb-p/fbc_ideas)",
  "OutputDir": "_news"
}
