{
  "PubDate": "2026-02-04T10:00:00+00:00",
  "FeedUrl": "https://blog.fabric.microsoft.com/en-us/blog/feed/",
  "ProcessedDate": "2026-02-04 17:15:17",
  "Tags": [],
  "Description": "From powering AI experiences to enabling instant insights on operational events, Fabric Real‑time Intelligence is becoming indispensable to how modern organizations operate. Over the past six months, the Fabric Eventstream team has delivered one of our most ambitious waves of innovation yet, all centered around a simple mission: make streaming data easier to ingest, process, …\n\n[Continue reading “What’s new in Fabric Eventstream: July–December 2025 updates”](https://blog.fabric.microsoft.com/en-us/blog/whats-new-in-fabric-eventstream-july-december-2025-updates/)",
  "EnhancedContent": "From powering AI experiences to enabling instant insights on operational events, Fabric Real‑time Intelligence is becoming indispensable to how modern organizations operate. Over the past six months, the Fabric Eventstream team has delivered one of our most ambitious waves of innovation yet, all centered around a simple mission: **make streaming data easier to ingest, process, and operate at scale.**\n\nThis period has brought major improvements across three pillars:\n\n- **More real‑time data sources into Fabric with less friction**\n- **Rich and robust stream processing pipelines**\n- **Enhanced control, security, and reliability for production workloads**\n\nEvery feature in this update reflects direct customer feedback and practical needs we continually hear across industries. Together, they dramatically expand what’s possible with Eventstream.\n\nLet’s take a tour through the most impactful advancements we delivered between July and December 2025.\n\n# Expand your access to real‑time data: New connectors and sources\n\nBringing data into Fabric should be effortless, whether it’s weather data, IoT workloads, operational telemetry, or change streams from mission‑critical databases. Over the last six months, Eventstream made this easier with a series of new connectors and ingestion paths.\n\n## HTTP connector with public feeds (Preview)\n\nNeed to connect to web services behind REST/HTTP endpoints? The HTTP connector provides a **no‑code way** to continuously stream data from external systems into Eventstream using standard HTTP GET or POST requests. It significantly reduces development effort, letting teams focus on analytics instead of integration and infrastructure. With built‑in support for predefined public data feeds, you can get started in minutes.\n\nDocs: [Eventstream HTTP connector](https://learn.microsoft.com/fabric/real-time-intelligence/event-streams/add-source-http)\n\nBlogs: [Introducing the HTTP and MongoDB CDC Connectors for Eventstream — Inspired by You | Microsoft Fabric Blog | Microsoft Fabric](https://blog.fabric.microsoft.com/blog/introducing-the-http-and-mongodb-cdc-connectors-for-eventstream-inspired-by-you/)\n\n## Enrich Real‑Time Weather data with user-friendly location names (General Availability)\n\nPrefer well-known location names over latitude-longitudes? You can assign intuitive location names directly within the Real‑Time Weather connector, making downstream filtering, dashboards, and analytics far easier to interpret.\n\nDocs: [Add a real-time weather source to an eventstream – Microsoft Fabric | Microsoft Learn](https://learn.microsoft.com/fabric/real-time-intelligence/event-streams/add-source-real-time-weather)\n\n## Capacity overview events (Preview)\n\nFabric Capacity Overview Events provide near real-time visibility into Microsoft Fabric capacity usage and health. You can now route Fabric capacity health and usage events—including state and summary events—directly into Eventstream. This enables real‑time alerting, automation, and historical & predictive capacity analysis using Eventhouse or Data Activator.\n\nDocs: [Add Fabric capacity overview event source to an eventstream – Microsoft Fabric | Microsoft Learn](https://learn.microsoft.com/fabric/real-time-intelligence/event-streams/add-source-fabric-capacity-overview-events)\n\nBlogs: [Fabric Capacity Events in Real-Time Hub (Preview) | Microsoft Fabric Blog | Microsoft Fabric](https://blog.fabric.microsoft.com/blog/fabric-capacity-events-in-real-time-hub-preview/)\n\n## MongoDB CDC connector with snapshot support (Preview)\n\nMongoDB, including Atlas, workloads gain a full end‑to‑end streaming pipeline:\n\n- Automatic snapshot of MongoDB collections\n- Continuous streaming of changes as they happen\n- Seamless routing into Eventhouse analytics\n\nThis is a powerful enabler for building dynamic dashboards and real‑time applications.\n\nDocs: [Add MongoDB CDC source to an eventstream – Microsoft Fabric | Microsoft Learn](https://learn.microsoft.com/fabric/real-time-intelligence/event-streams/add-source-mongodb-change-data-capture)\n\nBlogs: [Introducing the HTTP and MongoDB CDC Connectors for Eventstream — Inspired by You | Microsoft Fabric Blog | Microsoft Fabric](https://blog.fabric.microsoft.com/blog/introducing-the-http-and-mongodb-cdc-connectors-for-eventstream-inspired-by-you/)\n\n## Integration with Cribl as a source (Preview)\n\nCribl users can now route curated events straight into Eventstream without maintaining complex ingestion logic. Fabric customers get simpler data onboarding, and Cribl users get a turnkey path into Fabric analytics—a win on both sides.\n\nDocs: [Add Cribl source to an eventstream – Microsoft Fabric | Microsoft Learn](https://learn.microsoft.com/fabric/real-time-intelligence/event-streams/add-source-cribl?tabs=oauthbearer)\n\nBlogs: [Expanding Real-Time Intelligence data sources with Cribl source (Preview) | Microsoft Fabric Blog | Microsoft Fabric](https://blog.fabric.microsoft.com/blog/expanding-real-time-intelligence-data-sources-with-cribl-source-preview?ft=All)\n\n## Route Azure Monitor diagnostic logs to Eventstream (Preview)\n\nStreaming Azure resource logs into Fabric and leveraging its analytics capabilities used to require some heavy lifting. Now users can easily find the Azure resource they need to monitor, from within Eventstreams (or Real-Time Hub), and start ingesting monitoring logs into an Eventstream. This streaming data can then be transformed, insights extracted and acted upon using Activator or delivered to an Eventhouse for advanced analytics.\n\nDocs: [Stream Azure Diagnostics to Fabric – Microsoft Fabric | Microsoft Learn](https://learn.microsoft.com/fabric/real-time-hub/add-source-azure-diagnostic-logs-metrics)\n\nBlogs: [Unlocking Real-Time Operational Intelligence: Azure Monitor Logs Integration in Fabric via Eventstream | Microsoft Fabric Blog | Microsoft Fabric](https://blog.fabric.microsoft.com/en/blog/unlocking-real-time-operational-intelligence-azure-monitor-logs-integration-in-fabric-via-eventstream?ft=All)\n\n# Rich and robust real-time stream processing\n\nTo build dependable real-time pipelines for their unique business requirements, data engineers need both the ability to express complex processing logic and the confidence that the pipeline will remain robust in the face of evolving event schemas. Eventstream delivers on both expectations with new SQL-powered processing and smarter schema inferencing & management capabilities.\n\n## SQL operator (Preview)\n\nMissing SQL? The SQL Operator adds a flexible, code‑first transformation stage to Eventstream. You can now write SQL expressions to clean, transform, filter, join multiple streams or perform aggregations and analysis over temporal windows. An interactive editing experience with full IntelliSense, syntax highlighting, and query testing previews makes development a cinch.\n\nDocs: [Process Events Using a SQL Operator – Microsoft Fabric | Microsoft Learn](https://learn.microsoft.com/fabric/real-time-intelligence/event-streams/process-events-using-sql-code-editor)\n\nBlogs: [From Clicks to Code: SQL Operator under Fabric Eventstream (Preview) | Microsoft Fabric Blog | Microsoft Fabric](https://blog.fabric.microsoft.com/blog/from-clicks-to-code-sql-operator-now-in-public-preview-under-fabric-eventstream) [Fabric Eventstream SQL Operator: Your tool kit to Real-Time data processing in Fabric Real-Time Intelligence | Microsoft Fabric Blog | Microsoft Fabric](https://blog.fabric.microsoft.com/blog/fabric-eventstream-sql-operator-your-tool-kit-to-real-time-data-processing-in-fabric-real-time-intelligence/)\n\n## Eventstream Activator destination (General Availability)\n\nWant to act on insights from stream processing? With this release, Eventstream Activator destination is more secure and reliable, enabling customers to detect meaningful patterns in business critical streaming data platforms and automatically trigger downstream actions.\n\n[Doc: Add a Fabric Activator destination to an eventstream – Microsoft Fabric |](https://learn.microsoft.com/fabric/real-time-intelligence/event-streams/add-destination-activator)\n\n## Schema Registry in Eventstream (Preview)\n\nSchema Registry provides **a centralized way to discover, manage, and govern event schemas**. By defining explicit data contracts, it removes uncertainty from streaming pipelines—ensuring data is structured, predictable, and reliable from ingestion through downstream analytics. Schema Registry helps you prevent unexpected schema drift, improves data quality, and build trusted, type‑safe real‑time applications.\n\nDocs: [Schema Registry in Fabric Real-Time Intelligence – Microsoft Fabric | Microsoft Learn](https://learn.microsoft.com/fabric/real-time-intelligence/schema-sets/schema-registry-overview)\n\nBlogs: [Schema Registry: Creating type-safe pipelines using Schemas and Eventstreams (Preview) | Microsoft Fabric Blog | Microsoft Fabric](https://blog.fabric.microsoft.com/blog/schema-registry-creating-type-safe-pipelines-using-schemas-and-eventstreams-preview/)\n\n## Multiple schema inferencing support (Preview)\n\nWhen event schemas within a single Eventstream starts to vary across versions, producers, or use cases, a single inferred schema isn’t enough. Eventstream now supports **multiple schema inferencing within a single Eventstream**, enabling more flexible ingestion when events evolve or multiple producers emit different shapes of data Instead of relying on a single inferred shape. With this capability, you can now get a better visibility of exactly what events are flowing through your Eventstream, and design your processing logic accordingly.\n\nDocs: [Enhance Event Processing with Multiple Schema Inferencing – Microsoft Fabric | Microsoft Learn](https://learn.microsoft.com/fabric/real-time-intelligence/event-streams/process-events-with-multiple-schemas)\n\nBlogs: [Enhancing Data Transformation Flexibility with Multiple-Schema Inferencing in Eventstream (Preview) | Microsoft Fabric Blog | Microsoft Fabric](https://blog.fabric.microsoft.com/blog/enhancing-data-transformation-flexibility-with-multiple-schema-inferencing-in-eventstream-preview/)\n\n## Confluent Schema Registry support for data deserialization (Preview)\n\nEventstream connectors now support **data deserialization using Confluent Schema Registry**. Now you can process, preview, and route the streaming data produced using the Confluent Schema Registry from their Confluent Cloud for Apache Kafka, while maintaining data structure consistency in your Kafka’s producers and consumers.\n\nDocs: [Add Confluent Cloud for Apache Kafka source to an eventstream – Microsoft Fabric | Microsoft Learn](https://learn.microsoft.com/fabric/real-time-intelligence/event-streams/add-source-confluent-kafka)\n\nBlogs: [Decoding Data with Confluent Schema Registry Support in Eventstream (Preview) | Microsoft Fabric Blog | Microsoft Fabric](https://blog.fabric.microsoft.com/blog/decoding-data-with-confluent-schema-registry-support-in-eventstream-preview/)\n\n# Operate with Confidence: Reliability, Security & Control\n\nAs real-time workloads scale, operational requirements become more rigorous and guardrails become essential. During this period, we delivered several impactful improvements that boost reliability and enterprise readiness.\n\n## Workspace Private Link for select sources and destinations (Preview)\n\nEventstream now supports **Workspace Private Link** for select sources and destinations, allowing you to ingest and route data securely over private networks without exposure to the public.\n\nDocs: [Secure inbound connections with Tenant and Workspace Private Links – Microsoft Fabric | Microsoft Learn](https://learn.microsoft.com/fabric/real-time-intelligence/event-streams/set-up-tenant-workspace-private-links)\n\n## Pause / Resume for derived streams (General Availability)\n\nA highly requested control is now here: you can now **pause and resume traffic on derived streams** without modifying your topology. This enables you to optimize your costs, and enables safer testing and troubleshooting without operational side effects.\n\nDocs: [Pause and resume data streams – Microsoft Fabric | Microsoft Learn](https://learn.microsoft.com/fabric/real-time-intelligence/event-streams/pause-resume-data-streams)\n\n# Putting it all together: A real‑time operations scenario\n\nImagine a global online service that needs to stay ahead of both customer demand and infrastructure issues. With Eventstreams, the team starts by streaming **Azure Monitor diagnostic logs** and **Fabric Capacity Overview events** into a single Eventstream. They create separate Eventstream with **MongoDB CDC** events that represent user activity and operational state. They enrich this with contextual data from REST APIs via the **HTTP connector** and curated feeds from partners like **Cribl**, all flowing in real time.\n\nUsing the **SQL Operator**, data engineers define streaming queries that join these sources, and compute KPIs over time windows, such as sudden error spikes in a region where capacity is trending hot or weather data suggests potential disruptions. **Schema Registry**, **multiple schema inferencing**, and **Confluent Schema Registry support** ensure that as producers evolve and new event types appear, the pipelines remain stable and predictable. **Workspace Private Link** keeps this data flowing over private networks, while **pause/resume for derived streams** gives the team fine-grained control for cost management and testing. The result is a rich, robust real‑time operations fabric that drives proactive alerts in Data Activator and deep analysis in Eventhouse—without stitching together a sprawling set of custom services.\n\n# Try it out and share your feedback\n\nWe are excited to see how these new capabilities will help you build richer, faster, more secure and reliable real-time applications using Fabric Eventstreams and Real-Time Intelligence. Your feedback plays a huge role in shaping what we build next. Let us know what is working well and where you would like us to go further.\n\nHere are a few ways to get and stay involved:\n\n- Get started with a[free trial of Microsoft Fabric](https://aka.ms/try-fabric) today!\n- Have a question about Eventstreams? Email us at [askeventstreams@microsoft.com](mailto:askeventstreams@microsoft.com).\n- Post on [Fabric Ideas](https://community.fabric.microsoft.com/t5/Fabric-Ideas/idb-p/fbc_ideas) to submit your idea, vote on others, and help surface what matters most to the community.\n- Join the [Fabric Community](https://aka.ms/FabricBlog/Community) to collaborate with others building real-time solutions.\n\nThe next chapter of Eventstreams is already in motion—we can’t wait to ship and share what’s coming next. Stay tuned!",
  "Title": "What’s new in Fabric Eventstream: July–December 2025 updates",
  "Author": "Microsoft Fabric Blog",
  "OutputDir": "_news",
  "FeedLevelAuthor": "Microsoft Fabric Blog",
  "Link": "https://blog.fabric.microsoft.com/en-US/blog/whats-new-in-fabric-eventstream-july-december-2025-updates/",
  "FeedName": "Microsoft Fabric Blog"
}
