{
  "Description": "How much time do you spend navigating to the same data sources when building dataflows? Data preparation is an iterative process—you often return to the same sources as you refine your dataflows, add new transformations, or create similar workflows. If you find yourself repeatedly connecting to the same tables, files, or databases, the Recent data …\n\n[Continue reading “Recent data: Get back to your data faster in Fabric (Preview)”](https://blog.fabric.microsoft.com/en-us/blog/recent-data-get-back-to-your-data-faster-in-fabric-preview/)",
  "FeedLevelAuthor": "Microsoft Fabric Blog",
  "Link": "https://blog.fabric.microsoft.com/en-US/blog/recent-data-get-back-to-your-data-faster-in-fabric-preview/",
  "FeedName": "Microsoft Fabric Blog",
  "ProcessedDate": "2026-02-23 16:15:00",
  "FeedUrl": "https://blog.fabric.microsoft.com/en-us/blog/feed/",
  "Tags": [],
  "PubDate": "2026-02-23T09:00:00+00:00",
  "Author": "Microsoft Fabric Blog",
  "OutputDir": "_news",
  "Title": "Recent data: Get back to your data faster in Fabric (Preview)",
  "EnhancedContent": "How much time do you spend navigating to the same data sources when building dataflows? Data preparation is an iterative process—you often return to the same sources as you refine your dataflows, add new transformations, or create similar workflows. If you find yourself repeatedly connecting to the same tables, files, or databases, the Recent data module in Dataflow Gen2 is designed for you. This feature reduces friction by providing quick access to your most frequently used data items, letting you focus on the transformation logic rather than navigation.\n\n## What’s new with Recent data\n\nThe Recent data module goes beyond tracking recent connections—it remembers the specific items you’ve worked with, including tables, files, folders, databases, and sheets etc. This means you can jump directly to the exact data you need without navigating through folder structures or connection dialogs.\n\nYou can access Recent data in the Power Query ribbon and Modern Get Data.\n\n### Recent data in the Power Query ribbon\n\nWhen you open a Dataflow Gen2, select **Recent data** from the Power Query ribbon to view your recently used items.\n\n![This screenshot shows Recent data module in Power Query drop down ](//dataplatformblogwebfd-d3h9cbawf0h8ecgf.b01.azurefd.net/wp-content/uploads/2026/02/this-screenshot-shows-recent-data-module-in-power-1.jpeg)\n\n*Figure: Recent data in Power Query Ribbon*\n\n### Recent data module in Modern Get Data\n\nWhen creating or editing a dataflow, select **Get data** and choose the **Recent data** module to access your history.\n\nThe default experience is designed for speed. When you select an item from your recent history, it loads directly into the Dataflow Gen2 editing canvas. You can instantly transform, combine, or configure your dataflow without extra navigation.\n\n![Recent data module in Modern Get Data](//dataplatformblogwebfd-d3h9cbawf0h8ecgf.b01.azurefd.net/wp-content/uploads/2026/02/recent-data-module-in-modern-get-data-1.jpeg)\n\n*Figure: Recent data in Get Data Module*\n\n## Browse location for related items\n\nSometimes you need more than just the item you used before. The **Browse location** option lets you explore other tables, files, or items in the same folder or database. This is useful when you want to include additional related data in your dataflow or explore what else is available at that location.\n\n## Learn more\n\nReady to try Recent data in Dataflow Gen2? Explore it now and learn more from these documentation resources:\n\n- [Get Data Experience](https://learn.microsoft.com/power-query/get-data-ui)\n- [What is Dataflow Gen2](https://learn.microsoft.com/fabric/data-factory/dataflows-gen2-overview)\n\nHave feedback on the Recent data feature? Share your thoughts in the [Fabric Data Factory IDEAS](https://community.fabric.microsoft.com/t5/Fabric-Ideas/idb-p/fbc_ideas/label-name/data%20factory)."
}
