{
  "Author": "Microsoft Fabric Blog",
  "OutputDir": "_news",
  "PubDate": "2026-01-20T09:00:00+00:00",
  "Description": "Copy job is the go-to solution in Microsoft Fabric Data Factory for simplified data movement, whether you’re moving data across clouds, from on-premises systems, or between services. With native support for multiple delivery styles, including bulk copy, incremental copy, and change data capture (CDC) replication, Copy job offers the flexibility to handle a wide range …\n\n[Continue reading “Simplifying data movement across multiple clouds with Copy job – Enhancements on incremental copy and change data capture”](https://blog.fabric.microsoft.com/en-us/blog/simplifying-data-movement-across-multiple-clouds-with-copy-job-enhancements-on-incremental-copy-and-change-data-capture/)",
  "FeedName": "Microsoft Fabric Blog",
  "Tags": [],
  "FeedLevelAuthor": "Microsoft Fabric Blog",
  "Title": "Simplifying data movement across multiple clouds with Copy job – Enhancements on incremental copy and change data capture",
  "EnhancedContent": "Copy job is the go-to solution in Microsoft Fabric Data Factory for simplified data movement, whether you’re moving data across clouds, from on-premises systems, or between services. With native support for multiple delivery styles, including bulk copy, incremental copy, and change data capture (CDC) replication, Copy job offers the flexibility to handle a wide range of data movement scenarios—all through an intuitive, easy-to-use experience.\n\nThis update introduces several enhancements to native incremental copy and change data capture (CDC) capabilities in Copy job, including support for additional data source stores for incremental copy, expanded CDC support for SAP Datasphere Outbound for Amazon S3 and Google Cloud Storage (in addition to Microsoft Cloud Storage), and Column Mapping support for CDC in Copy job.\n\n## **Expanded source store support for Incremental Copy**\n\nWe are expanding Copy job with broader multi‑cloud connectivity and stronger incremental copy support. Incremental copy in Copy job now supports additional connectors, including:\n\n- Google Big Query\n- Google Cloud Storage\n- DB2\n- ODBC\n- Fabric Lakehouse table\n- Folder\n- Azure files\n- SharePoint List\n- Amazon RDS for SQL Server\n- Amazon RDS for Oracle\n- Azure Data Explorer\n\n![](//dataplatformblogwebfd-d3h9cbawf0h8ecgf.b01.azurefd.net/wp-content/uploads/2026/01/image-12.png)\n\n## **Incremental copy from Fabric Lakehouse now supports both CDF and watermark-based methods**\n\nWhen performing incremental copy from a Fabric Lakehouse table, we strongly recommend using CDF (Delta Change Data Feed) to capture row inserts, updates, and deletions, and replicate them to supported destinations.\n\n![](//dataplatformblogwebfd-d3h9cbawf0h8ecgf.b01.azurefd.net/wp-content/uploads/2026/01/image-13.png)\n\nHowever, you can now also optionally use watermark-based incremental copy without enabling CDF. In this mode, you can select a watermark column for each table to identify changes.\n\nTo enable this, go to the Advanced Settings button after creating the Copy job, where you will have the option to switch from CDF to using a watermark column.\n\n![](//dataplatformblogwebfd-d3h9cbawf0h8ecgf.b01.azurefd.net/wp-content/uploads/2026/01/image-14-1024x601.png)\n\n## **SAP Datasphere Outbound for Amazon S3 and Google Cloud Storage**\n\nPreviously, you could use SAP Datasphere Outbound for ADLS Gen2 in Copy job to perform CDC replication from SAP to any supported destination. For more details, see [Tutorial: Copy job with SAP Datasphere Outbound (Preview) – Microsoft Fabric | Microsoft Learn](https://learn.microsoft.com/en-us/fabric/data-factory/copy-job-tutorial-sap-datasphere) to get more details.\n\nYou can now also use SAP Datasphere Outbound for Amazon S3 and SAP Datasphere Outbound for Google Cloud Storage, expanding staging storage support across multiple clouds and allowing you to choose the option that best fits your scenario.\n\n![](//dataplatformblogwebfd-d3h9cbawf0h8ecgf.b01.azurefd.net/wp-content/uploads/2026/01/image-15.png)\n\n## **Column Mapping in CDC in Copy job**\n\nYou can now map columns from source to destination when performing CDC replication in Copy job. This is useful when you want to rename columns, change data types, or otherwise customize the schema in the destination store.\n\nColumn mapping now is supported across all data movement patterns in Copy job, including full copy, watermark-based incremental copy and CDC replication.\n\n## **Additional Resources**\n\nTo learn more, explore [Microsoft Fabric Copy Job](https://learn.microsoft.com/fabric/data-factory/what-is-copy-job) documentation.\n\nSubmit your feedback on [Fabric Ideas](https://community.fabric.microsoft.com/t5/Fabric-Ideas/idb-p/fbc_ideas/label-name/data%20factory%20%7C%20copy%20job) and join the conversation in [the Fabric Community](https://community.fabric.microsoft.com/t5/Copy-job/bd-p/db_copyjob).\n\nIf you have a question or want to share your feedback, please leave us a comment below!",
  "FeedUrl": "https://blog.fabric.microsoft.com/en-us/blog/feed/",
  "ProcessedDate": "2026-01-20 18:03:38",
  "Link": "https://blog.fabric.microsoft.com/en-US/blog/simplifying-data-movement-across-multiple-clouds-with-copy-job-enhancements-on-incremental-copy-and-change-data-capture/"
}
