{
  "EnhancedContent": "ODBC (Open Database Connectivity) is a widely adopted standard that enables client applications to connect to and work with data from databases and big data platforms.\n\nThe Microsoft ODBC Driver for Microsoft Fabric Data Engineering (Preview) – an enterprise-grade connector that brings powerful, secure, reliable and flexible Spark SQL connectivity to your .NET, Python, and other ODBC-compatible applications and BI tools, all through Microsoft Fabric’s Livy APIs.\n\n## Why this matters\n\nAs organizations increasingly rely on Apache Spark for scalable data engineering and analytics, seamless integration with enterprise platforms is critical. The new Microsoft ODBC Driver for Microsoft Fabric Data Engineering empowers developers, data engineers, and administrators to connect, query, and manage Spark workloads in Microsoft Fabric with the reliability and simplicity of the ODBC standard.\n\n![Screenshot of ODBC Data Source Administrator window showing System Data Sources tab with one data source named &quot;Driver&quot; listed. Buttons for Add, Remove, and Configure are on the right side, with a description below explaining ODBC system data sources store information about how to connect to Fabric Spark.](//dataplatformblogwebfd-d3h9cbawf0h8ecgf.b01.azurefd.net/wp-content/uploads/2026/02/Microsoft-ODBC-Driver.gif)\n\n*Figure 1- The animated GIF demonstrates how to get started using ODBC driver*\n\nSince this driver has been specifically designed and developed for Fabric Data Engineering, it has deep integration with lakehouse for data access in OneLake, allows using an environment item during execution of your jobs as well as allows different Spark configurations based on your unique needs.\n\n## Key Features\n\n- **ODBC 3.x Compliant**: Full implementation of ODBC 3.x specification\n- **Microsoft Entra ID Authentication**: Multiple authentication flows including Azure CLI, interactive, client credentials, certificate-based, and access token authentication\n- **Spark SQL Query Support**: Direct execution of Spark SQL statements\n- **Comprehensive Data Type Support**: Support for all Spark SQL data types including complex types (ARRAY, MAP, STRUCT)\n- **Session Reuse**: Built-in session management for improved performance\n- **Large Table Support**: Optimized handling of large result sets with configurable page sizes\n- **Async Prefetch**: Background data loading for improved performance\n- **Proxy Support**: HTTP proxy configuration for enterprise environments\n- **Multi-Database Lakehouse Support**: Connect to specific databases within a Lakehouse\n\nThe Microsoft ODBC Driver for Microsoft Fabric Data Engineering is designed to accelerate your Spark-powered data engineering projects with enterprise-grade security, reliability, and performance.\n\n## Next steps\n\nWe invite you to try it out, share your feedback, and unlock new possibilities for analytics and integration in Microsoft Fabric.\n\nTo download and learn more about the Microsoft ODBC Driver for Microsoft Fabric Data Engineering, please refer to official documentation: [Microsoft ODBC Driver for Microsoft Fabric Data Engineering](https://learn.microsoft.com/fabric/data-engineering/spark-odbc-driver).",
  "Title": "Microsoft ODBC Driver for Microsoft Fabric Data Engineering (Preview)",
  "FeedName": "Microsoft Fabric Blog",
  "FeedUrl": "https://blog.fabric.microsoft.com/en-us/blog/feed/",
  "ProcessedDate": "2026-02-20 00:06:28",
  "Link": "https://blog.fabric.microsoft.com/en-US/blog/microsoft-odbc-driver-for-microsoft-fabric-data-engineering-preview/",
  "PubDate": "2026-02-19T17:00:00+00:00",
  "Tags": [],
  "Description": "ODBC (Open Database Connectivity) is a widely adopted standard that enables client applications to connect to and work with data from databases and big data platforms. The Microsoft ODBC Driver for Microsoft Fabric Data Engineering (Preview) – an enterprise-grade connector that brings powerful, secure, reliable and flexible Spark SQL connectivity to your .NET, Python, and …\n\n[Continue reading “Microsoft ODBC Driver for Microsoft Fabric Data Engineering (Preview)”](https://blog.fabric.microsoft.com/en-us/blog/microsoft-odbc-driver-for-microsoft-fabric-data-engineering-preview/)",
  "Author": "Microsoft Fabric Blog",
  "FeedLevelAuthor": "Microsoft Fabric Blog",
  "OutputDir": "_news"
}
