{
  "Description": "In today’s hyper-connected digital landscape, safeguarding sensitive data is more critical than ever. Microsoft Fabric already offers a robust suite of network security capabilities for both inbound and outbound connectivity, including Private Links, Entra Conditional Access and Outbound Access Protection, all generally available. As adoption of Microsoft Fabric continues to grow, customers increasingly operate in diverse scenarios …\n\n[Continue reading “Introducing workspace-level IP Firewall rules in Microsoft Fabric (Preview)”](https://blog.fabric.microsoft.com/en-us/blog/introducing-workspace-level-ip-firewall-rules-in-microsoft-fabric-preview/)",
  "FeedUrl": "https://blog.fabric.microsoft.com/en-us/blog/feed/",
  "Link": "https://blog.fabric.microsoft.com/en-US/blog/introducing-workspace-level-ip-firewall-rules-in-microsoft-fabric-preview/",
  "PubDate": "2026-01-29T09:00:00+00:00",
  "FeedLevelAuthor": "Microsoft Fabric Blog",
  "FeedName": "Microsoft Fabric Blog",
  "EnhancedContent": "In today’s hyper-connected digital landscape, safeguarding sensitive data is more critical than ever. Microsoft Fabric already offers a robust suite of network security capabilities for both inbound and outbound connectivity, including [Private Links](https://learn.microsoft.com/fabric/security/security-private-links-overview)**,** [Entra Conditional Access](https://learn.microsoft.com/fabric/security/security-conditional-access%20) and [Outbound Access Protection](https://learn.microsoft.com/en-us/fabric/security/workspace-outbound-access-protection-overview), all generally available.\n\nAs adoption of Microsoft Fabric continues to grow, customers increasingly operate in diverse scenarios where not all users, tools, or integrations can rely solely on private connectivity or identity-based controls. Organizations that expose Fabric workspaces over public endpoints often require a simple, network-based mechanism to restrict access to known and trusted IP ranges.\n\nWorkspace-level IP firewall rules address this need by allowing workspace admins to restrict inbound public network access at the individual workspace level through IP-based allowlists. Workspace Administrators can define access using single IP addresses, IP ranges, or CIDR blocks. This capability provides a lightweight, granular layer of inbound protection that complements existing Tenant-level and Workspace-level Private Links as well as Entra Conditional Access making it ideal for scenarios that require fine-grained inbound access control without modifying tenant-wide network settings.\n\n## What are workspace-level IP firewall rules?\n\nWorkspace-level IP firewall rules are designed to help restrict **inbound** connectivity to a Fabric workspace by enforcing IP-based access controls at the network layer. With Workspace-level IP firewall rules, **workspace admins retain full control over inbound access controls**, explicitly defining which public IP addresses are allowed to access their workspace.\n\nThese rules evaluate the caller’s public IP address at the network layer before the request reaches Fabric authentication or data services. Only connections originating from IPs included in the workspace’s allow list are permitted; all other inbound requests are blocked at ingress. This capability provides targeted, workspace-scoped inbound protection, enabling administrators to reduce exposure when accessing Fabric workspaces over public endpoints while maintaining flexibility and control.\n\n![Fabric workspace IP firewall allowing inbound access only from the allow-listed public IP address](//dataplatformblogwebfd-d3h9cbawf0h8ecgf.b01.azurefd.net/wp-content/uploads/2026/01/word-image-32810-1.png)Workspace IP Firewall feature restricting Fabric workspace access to approved public IP address\n\n## Implementing Fabric workspace-level IP firewall rules\n\n1. Tenant admin must enable **Configure workspace-level inbound network rules** in the Fabric admin portal.\n2. As a Fabric workspace admin\n- Navigate to **Workspace Settings** in the target workspace and select **Allow connections from selected networks and workspace private links.**\n- Select **Edit** and add required IP rules (single IP, range or CIDR) to the landing page.\n- Alternatively, you can choose to add the incoming IP address by selecting the drop down and selecting **Add client IP address**. This will automatically add the egress IP to allowlist.\n\n![Configure Workspace-level IP firewall rules](//dataplatformblogwebfd-d3h9cbawf0h8ecgf.b01.azurefd.net/wp-content/uploads/2026/01/capture_20260127_174011.gif)Configure Workspace-level IP firewall rules\n\n**For detailed set-up of Workspace IP firewall rules**, its limitations and supported artifacts, please refer to [Setup and use Workspace-level IP Firewall rules](https://aka.ms/fabric-ip-firewall-blog).\n\n## Key benefits\n\n**Enhanced inbound security** Restrict inbound access to Fabric workspaces by allowing connections only from explicitly approved public IP addresses. All other inbound requests originating from untrusted IPs are blocked at the network layer before reaching Fabric services.\n\n**Granular workspace-level control** Apply IP-based access controls at the individual workspace level rather than at the tenant scope. This enables differentiated security policies across business units, environments (dev/test/prod), data domains, or projects without impacting other workspaces.\n\n**Reduced exposure for Public Endpoints** Limit access to Fabric workspaces exposed over public endpoints by enforcing a small, trusted set of IP ranges for administrators, automation pipelines, partner tools, or applications operating outside private VNets.\n\n**Stronger Compliance and Governance posture** Meet regulatory and compliance requirements by enforcing explicit network-level access boundaries at the workspace level. When combined with Private Links and Entra Conditional Access, Workspace-level IP Firewall rules help organizations implement layered defenses aligned with enterprise security standards.\n\n## Looking ahead\n\nWorkspace-level IP firewall rules are an important step toward strengthening workspace-scoped network security in Microsoft Fabric. As we continue through Preview, we will refine this capability based on customer feedback and expand alignment with Fabric’s broader security and governance framework helping administrators apply consistent, layered protections across inbound access scenarios.\n\n*Your feedback is essential! Let us know how we can make Fabric even more secure and flexible for your workloads by adding your comment to this blog.*",
  "Tags": [],
  "ProcessedDate": "2026-01-29 16:08:40",
  "OutputDir": "_news",
  "Title": "Introducing workspace-level IP Firewall rules in Microsoft Fabric (Preview)",
  "Author": "Microsoft Fabric Blog"
}
