{
  "Author": "Microsoft Fabric Blog",
  "EnhancedContent": "A frequent request we receive from dashboard authors is the ability to have greater control over color settings.\n\nUntil now, color assignments in real-time dashboards were largely automatic. While this worked for basic scenarios, it often fell short in operational and reporting use cases where color isn’t decoration—it’s meaning. **Data Serie** **s Colors** is a new capability that gives authors direct control over how colors are applied to their visuals.\n\nWith Data Series Colors, dashboard editors can now:\n\n- Assign colors directly to each data series.\n- Override system defaults with intentional choices.\n- Maintain consistency across visuals and dashboards.\n\n![Screenshot of a tile's visual setting pane](//dataplatformblogwebfd-d3h9cbawf0h8ecgf.b01.azurefd.net/wp-content/uploads/2026/01/image-9.png)Apply color settings to data series\n\nThis feature is supported across pie charts, time charts, line charts, area charts, bar charts, column charts, anomaly and scatter charts, covering the most used visualization types.\n\n## Using color to convey meaning—and tell a story\n\nWhen colors are assigned intentionally, users no longer need to read legends or labels to understand what is happening. A spike, a drop, or a comparison immediately carries context. Over time, viewers learn the language of the dashboard—what each color represents, what’s normal, and what needs attention.\n\n![Screenshot of a dashboard tile](//dataplatformblogwebfd-d3h9cbawf0h8ecgf.b01.azurefd.net/wp-content/uploads/2026/01/image-10.png)Adjusted colors to reflect State\n\nDashboards are more than monitoring tools—they provide a way to:\n\n- Highlight what matters most.\n- Reinforce shared understanding across teams.\n- Present a clear narrative with each visual.\n\nLearn more by exploring the documentation: [Customize Real-Time Dashboard visuals](https://learn.microsoft.com/fabric/real-time-intelligence/dashboard-visuals-customize).",
  "FeedName": "Microsoft Fabric Blog",
  "OutputDir": "_news",
  "Tags": [],
  "PubDate": "2026-02-02T11:00:00+00:00",
  "Description": "A frequent request we receive from dashboard authors is the ability to have greater control over color settings. Until now, color assignments in real-time dashboards were largely automatic. While this worked for basic scenarios, it often fell short in operational and reporting use cases where color isn’t decoration—it’s meaning. Data Series Colors is a new …\n\n[Continue reading “Introducing Data Series Colors: tell clearer stories with Real-Time Dashboards (Generally Available)”](https://blog.fabric.microsoft.com/en-us/blog/32713/)",
  "Title": "Introducing Data Series Colors: tell clearer stories with Real-Time Dashboards (Generally Available)",
  "Link": "https://blog.fabric.microsoft.com/en-US/blog/32713/",
  "FeedLevelAuthor": "Microsoft Fabric Blog",
  "FeedUrl": "https://blog.fabric.microsoft.com/en-us/blog/feed/",
  "ProcessedDate": "2026-02-02 23:04:32"
}
