{
  "EnhancedContent": "We announced [Outbound Access Protection for Spark (Generally Available)](https://blog.fabric.microsoft.com/blog/workspace-outbound-access-protection-for-spark-is-now-generally-available/) and recently extended it to support [SQL Endpoint and Warehouse](https://blog.fabric.microsoft.com/blog/extending-outbound-access-protection-to-fabric-warehouse-and-sql-analytics-endpoint/). Now, Pipelines, Copy job, Dataflows, OneLake Shortcuts as well as Mirrored Databases (such as Mirrored SQL Database, Mirrored Snowflake) support Workspace level Outbound Access Protection (Preview).\n\n## Key Benefits\n\n- **Enhanced Outbound Security**: By leveraging OAP rules, organizations can ensure that the Data Factory items from the protected workspace can only connect to a limited set of destinations which are allowed by workspace admins. All other outbound connections to public internet and other destinations are blocked from the workspace.\n- **Granular Control:** Control outbound access per workspace instead of at the tenant level. This allows you to apply differentiated controls across business units, environments (dev/test/prod), data domains, or project.\n- **Data Exfiltration prevention:** Workspace OAP when combined with Inbound protection can help the customer prevent the data from getting exfiltrated outside the workspace boundary.\n- **Better Compliance:** Meet stringent compliance and regulatory requirements by ensuring your sensitive data never leaves the workspace boundary if it’s not allowed by Workspace Admins.\n\n## What to expect with Outbound access protection (OAP) for Data Factory\n\nOAP ensures that the external connections made from the Fabric workspace are secured and allowed by the Workspace Admins, thereby reducing the risk of exfiltration.\n\nOAP is now expanded to include the support for the following items:\n\n- Dataflow Gen 2 (with CICD)\n- Pipelines\n- Copy job\n- Mirrored Items\n\nWhen OAP is set, workspace admins will be able to configure outbound rules on the workspace (allow/deny) connection types and granular endpoints.\n\nWorkspace admins will also get the ability to allow/deny specific VNET/On-Prem Data Gateways. After the gateways are allowed, users in the workspace can incorporate those gateway connections into their workflows.\n\nThis will give the right flexibility to ensure the workspace is protected from exfiltration and allow connections to the trusted destinations.\n\nIn the following workflow diagram, to allow connection to external data sources or to another workspace, the workspace admins will have to first enable OAP (1), then set up Data connection rules for the workspace. Based on the combination of allowed Data sources (for example SQL Server and VNET Data Gateway), items like Pipeline and Dataflows can establish connections to these sources. All other outbound connections will be blocked.\n\n![The image shows the steps in setting and using Outbound access protection for Data Factory artifacts. First the workspace Admin enables OAP on the workspace and sets outbound data connection rules. In steps 2 Dataflow connects to allowed sources behind VNET Data Gateway. In step 3 the Pipeline connects to allowed SQL Server endpoint. Both Pipeline and Dataflow pull the data from sources and push the data to Lakehouse. There is Dashboard in different workspace which connects with the Lakehouse. The reports are created based on the data in the Lakehouse.](//dataplatformblogwebfd-d3h9cbawf0h8ecgf.b01.azurefd.net/wp-content/uploads/2025/10/word-image-28889-1-1.png)OAP for Data Factory Flow diagram\n\nTo learn more about Workspace OAP for Data Factory, set-up, scope and limitations, refer to the [Workspace outbound access protection overview](https://learn.microsoft.com/fabric/security/workspace-outbound-access-protection-overview) documentation.\n\n## OneLake shortcuts and outbound access protection\n\nIn addition to Data Factory improvements, the momentum continues with updates to OneLake. **External shortcuts** are now supported with outbound access protection! You can use the new data source connection rules to allow list specific outbound data sources. After allowlisting, you can read existing shortcuts and create new ones only to those allowlisted locations, ensuring your data stays secure without limiting your data estate. For example, you can create a data connection rule allowing outbound connections to your ADLS Gen2 account while blocking outbound requests to other external locations, including any other ADLS Gen2 accounts!\n\nYou can also use data connection rules to **allow cross-workspace OneLake connections** through the Lakehouse connector. By adding a connection rule for a different workspace in the Lakehouse connector, all copy operations and shortcuts from your OAP-enabled workspace to the allowed-listed workspace are allowed. This gives you an alternative way to allow cross- workspace connections without the use of managed private endpoints and a private link service.\n\nInterested in learning more about OneLake and outbound access protection? Check out [managing outbound access from OneLake with outbound access protection](https://learn.microsoft.com/fabric/onelake/onelake-manage-outbound-access) for more information!\n\n## What’s next?\n\nTenant level Admin APIs for Workspace OAP settings are rolling out and will be available next week.\n\nWe are actively working to expand OAP support for additional experiences and plan to add support for Power BI Semantic Models and Reports soon.\n\nYour feedback is essential! Let us know how we can make Fabric even more secure and flexible for your workloads by sharing your feedback at [Fabric Ideas – Microsoft Fabric Community.](https://community.fabric.microsoft.com/t5/Fabric-Ideas/idb-p/fbc_ideas/label-name/fabric%20platform%20%7C%20security)",
  "ProcessedDate": "2026-01-29 22:03:43",
  "FeedLevelAuthor": "Microsoft Fabric Blog",
  "Author": "Microsoft Fabric Blog",
  "FeedUrl": "https://blog.fabric.microsoft.com/en-us/blog/feed/",
  "Tags": [],
  "PubDate": "2026-01-29T15:00:00+00:00",
  "FeedName": "Microsoft Fabric Blog",
  "OutputDir": "_news",
  "Link": "https://blog.fabric.microsoft.com/en-US/blog/workspace-outbound-access-protection-for-data-factory/",
  "Title": "Workspace Outbound Access Protection for Data Factory and OneLake Shortcuts (Preview)",
  "Description": "We announced Outbound Access Protection for Spark (Generally Available) and recently extended it to support SQL Endpoint and Warehouse. Now, Pipelines, Copy job, Dataflows, OneLake Shortcuts as well as Mirrored Databases (such as Mirrored SQL Database, Mirrored Snowflake) support Workspace level Outbound Access Protection (Preview). Key Benefits What to expect with Outbound access protection (OAP) …\n\n[Continue reading “Workspace Outbound Access Protection for Data Factory and OneLake Shortcuts (Preview)”](https://blog.fabric.microsoft.com/en-us/blog/workspace-outbound-access-protection-for-data-factory/)"
}
