{
  "Author": "Microsoft Fabric Blog",
  "PubDate": "2026-01-26T09:00:00+00:00",
  "FeedName": "Microsoft Fabric Blog",
  "OutputDir": "_news",
  "EnhancedContent": "Surge protection in Microsoft Fabric has been a key feature for managing capacity usage and preventing overload. Today, it helps you:\n\n- **Limit background compute consumption** at the capacity level, setting thresholds for when background operations are rejected and when they recover.\n- **Reduce deep throttling states with longer recover time** by engaging throttling earlier to enable admins to take preventive action and reducing recovery times.\n\nUntil now, surge protection applied only at the **capacity level**—meaning all workspaces shared the same rules.\n\n## What’s new: workspace-level surge protection\n\nWe’re taking surge protection to the next level with **workspace-level controls**. This update gives you more granular management of compute usage across your organization.\n\n### Key enhancements\n\n- **Per-workspace CU % limits:** Define a compute unit (CU) consumption threshold that applies to all workspaces, as a percentage of overall capacity utilization. These are set over a rolling 24-hour period.\n- **Automatic blocking:** When a workspace exceeds its threshold, it can be automatically placed in a **blocked** state, rejecting new operations until usage drops or the block expires.\n- **Mission critical mode:** Designate high-priority workspaces as **mission critical**—exempting them from surge protection rules—effectively prioritizing them over other workspaces. This mode can also be used to remove an active **blocked** state.\n\n![Screenshot of Surge Protection Settings including ability to set Workspace-level rejections thresholds as well as overall Background Operations level rejection thresholds for the capacity](//dataplatformblogwebfd-d3h9cbawf0h8ecgf.b01.azurefd.net/wp-content/uploads/2026/01/image-7.png)Surge Protection Settings View\n\n## Why this matters\n\nWith workspace-level surge protection, you can:\n\n- Prevent resource over-utilization by lower-priority workspaces.\n- Keep more important workspaces running, minimizing interruptions.\n- Maintain a balanced and predictable experience for all users.\n\nThis update builds on the foundation of capacity-level surge protection, giving you **fine-grained control** to optimize performance and protect your most important solutions. We have also added a view for this in the Capacity Metrics App to ensure transparency.\n\n### Learn more\n\nExplore the [Surge protection](https://learn.microsoft.com/fabric/enterprise/surge-protection) and [Understand the metrics app compute page](https://learn.microsoft.com/fabric/enterprise/metrics-app-compute-page) resources for more information.",
  "Title": "Surge protection gets smarter: introducing workspace-level controls (Preview)",
  "FeedLevelAuthor": "Microsoft Fabric Blog",
  "FeedUrl": "https://blog.fabric.microsoft.com/en-us/blog/feed/",
  "ProcessedDate": "2026-01-26 16:04:12",
  "Link": "https://blog.fabric.microsoft.com/en-US/blog/surge-protection-gets-smarter-introducing-workspace-level-controls-preview/",
  "Description": "Surge protection in Microsoft Fabric has been a key feature for managing capacity usage and preventing overload. Today, it helps you: Until now, surge protection applied only at the capacity level—meaning all workspaces shared the same rules. What’s new: workspace-level surge protection We’re taking surge protection to the next level with workspace-level controls. This update …\n\n[Continue reading “Surge protection gets smarter: introducing workspace-level controls (Preview)”](https://blog.fabric.microsoft.com/en-us/blog/surge-protection-gets-smarter-introducing-workspace-level-controls-preview/)",
  "Tags": []
}
