{
  "Link": "https://blog.fabric.microsoft.com/en-US/blog/snowflake-key-pair-authentication-generally-available/",
  "OutputDir": "_news",
  "FeedUrl": "https://blog.fabric.microsoft.com/en-us/blog/feed/",
  "Title": "Snowflake Key-Pair Authentication (Generally Available)",
  "FeedLevelAuthor": "Microsoft Fabric Blog",
  "Description": "Coauthor: Abhishek Narain Ensuring secure connectivity to your data sources is critical for modern data estates. We have released the Key-Pair authentication for Snowflake connections Preview in October and are happy to announce it is now Generally Available (GA). This release offers an enhanced security alternative to basic authentication methods, such as username and password, …\n\n[Continue reading “Snowflake Key-Pair Authentication (Generally Available)”](https://blog.fabric.microsoft.com/en-us/blog/snowflake-key-pair-authentication-generally-available/)",
  "Author": "Microsoft Fabric Blog",
  "Tags": [],
  "FeedName": "Microsoft Fabric Blog",
  "PubDate": "2026-02-17T10:00:00+00:00",
  "EnhancedContent": "Coauthor: Abhishek Narain\n\nEnsuring secure connectivity to your data sources is critical for modern data estates. We have released the Key-Pair authentication for Snowflake connections [Preview in October](https://blog.fabric.microsoft.com/blog/unify-your-data-estate-for-the-era-of-ai-with-fabric-data-factory/) and are happy to announce it is now Generally Available (GA).\n\nThis release offers an enhanced security alternative to basic authentication methods, such as username and password, allowing you to align with industry best practices for identity management.\n\n## Why Key-Pair authentication matters\n\nReliable and secure authentication is the foundation of any production workload. Snowflake supports Key-Pair authentication to provide a more robust security mechanism than traditional credentials.\n\nUsing Key-Pair authentication helps you:\n\n- **Stronger, password‑less security using RSA/ECDSA cryptographic keys,** eliminating password‑based risks and supporting encrypted private keys for added protection.\n- **Enterprise‑grade compliance**, ideal for service accounts and automated workloads because Snowflake will deprecate single‑factor passwords.\n\nSnowflake Key-Pair authentication is fully supported across various items and experiences, including Power BI Semantic models, Dataflow Gen2, Data pipelines, Copy jobs, Mirroring.\n\n## How to use Snowflake Key-Pair authentication\n\nYou can configure Key-Pair authentication through the Fabric user interface or programmatically via the REST API.\n\n### Configure via the Microsoft Fabric portal\n\nTo use this feature in the portal:\n\n1. Navigate to the **Get Data** wizard or the **Manage connections and gateways** settings.\n2. Create a new connection or edit an existing Snowflake connection.\n3. In the authentication settings, select **Key-Pair** as the **Authentication kind**.\n4. Enter your **Username**, **Private key**. **Passphrase** will only be required when the private key file is encrypted.\n\n![Snowflake KeyPair Authentication with encrypted private key](//dataplatformblogwebfd-d3h9cbawf0h8ecgf.b01.azurefd.net/wp-content/uploads/2026/02/image-8-1024x602.png)\n\n### Configure via the REST API\n\nFor users who automate connection management, you can now create Snowflake connections with Key-Pair credentials using the Fabric Connections REST API.\n\nTo learn more about automating this configuration, refer to the [Connections – Create Connection documentation](https://learn.microsoft.com/rest/api/fabric/core/connections/create-connection?tabs=HTTP#keyvaultsecretreference).\n\n## Learn more about Snowflake Key Pair Authentication\n\n[How to setup Snowflake Key Pair authentication in Microsoft Fabric](https://learn.microsoft.com/fabric/data-factory/connector-snowflake#key-pair-authentication)",
  "ProcessedDate": "2026-02-17 17:20:25"
}
