{
  "PubDate": "2026-02-27T10:00:00+00:00",
  "Tags": [],
  "FeedLevelAuthor": "Microsoft Fabric Blog",
  "Description": "Welcome to the February 2026 edition of the Fabric Influencers Spotlight, a recurring monthly post here to shine a bright light on the places on the internet where Microsoft MVPs & Fabric Super Users are doing some amazing work on all aspects of Microsoft Fabric. The Microsoft Fabric Community team has created the Fabric Influencers Spotlight to …\n\n[Continue reading “Fabric Influencers Spotlight February 2026”](https://blog.fabric.microsoft.com/en-us/blog/fabric-influencers-spotlight-february-2026/)",
  "Author": "Microsoft Fabric Blog",
  "EnhancedContent": "Welcome to the February 2026 edition of the Fabric Influencers Spotlight, a recurring monthly post here to shine a bright light on the places on the internet where Microsoft MVPs & Fabric Super Users are doing some amazing work on all aspects of Microsoft Fabric.\n\nThe Microsoft Fabric Community team has created the Fabric Influencers Spotlight to highlight and amplify blog posts, videos, presentations, and other content related to Microsoft Fabric. We’ve cultivated submissions from members of Microsoft MVPs & Fabric Super Users from the Fabric community that cover the Fabric Platform, Data Engineering & Data Science in Fabric, Data Warehousing, Power BI, Real-Time Intelligence, Data Integration, Fabric Administration & Governance and Databases.\n\nMicrosoft Most Valuable Professionals, or MVPs, are technology experts who utilize their deep knowledge of Microsoft products and services to bring together diverse platforms, products, and solutions, to solve real world problems, and to bring “leading edge” content to the data community. To learn about the Microsoft MVP Award and to find MVPs, visit the [official website](https://mvp.microsoft.com/).\n\nFabric Super Users are the heroes of the Fabric Community. They contribute helpful answers, write informative blog posts, post data stories and are key contributors to the Fabric product via engagement with the product group. To learn more about the Super User program, visit the [official website](https://aka.ms/SuperUsers).\n\n## Power BI\n\n### Valerie Junk, [LinkedIn](https://www.linkedin.com/in/valeriejunk/)\n\nAffiliation: MVP\n\nBlog Post: [Power BI: Expanding table and matrix columns – Grow to Fit vs Fit to Content](https://www.valeriejunk.nl/table-column-grow-to-fit/)\n\nThis tutorial explains the difference between the formatting options “Fit to content” and “Grow to fit” for table and matrix visuals in Power BI. While Fit to content adjusts column widths based only on the header text or values, Grow to fit distributes the available space across all columns so the available columns fill the entire visual. The post shows where to find the setting and explains the differences.\n\n### Cengizhan Arslan, [LinkedIn](https://www.linkedin.com/in/cengizhanarslan/)\n\nAffiliation: Super User\n\nBlog Post: [Filtering Fact vs Dimension vs FILTER vs KEEPFILTERS in DAX — Performance and Behavior Comparison](https://cengizhan-arslan.medium.com/filtering-fact-vs-dimension-vs-filter-vs-keepfilters-in-dax-performance-and-behavior-comparison-a7979714dea3)\n\nSmall changes in DAX syntax can lead to very different performance characteristics and report behavior, especially in large Power BI or Microsoft Fabric semantic models. In this article, I compare four common filtering approaches.\n\n## Data Engineering\n\n### Matthias Falland, [LinkedIn](http://www.linkedin.com/in/matthias-falland)\n\nAffiliation: MVP\n\nBlog Post: [Automating Spark Jobs in Microsoft Fabric – From Notebooks to Production](https://youtu.be/7oEBYgYZNrk)\n\nIn this episode of Fabric Friday, we explore how to automate Spark workloads in Microsoft Fabric using Spark Job Definitions.\n\nYou’ll learn why notebooks are great for development but risky in production — and how Spark Job Definitions provide clean execution, scheduling, parameters, and proper monitoring for reliable data pipelines.\n\n### Pallavi Routaray, [LinkedIn](https://www.linkedin.com/in/pallaviroutaray/)\n\nAffiliation: Super User\n\nBlog Post: [Designing for Direct Lake: Architecture, Storage Strategy, and Performance in Microsoft Fabric](https://community.fabric.microsoft.com/t5/Data-Engineering-Community-Blog/Designing-for-Direct-Lake-Architecture-Storage-Strategy-and/ba-p/5000453)\n\nThis blog explains what Direct Lake is in Microsoft Fabric, how it differs from Import and DirectQuery, and how to design a high-performance Direct Lake architecture with the right storage and modeling strategy.\n\n## Data Science\n\n### Sahir Maharaj, [LinkedIn](https://www.linkedin.com/in/sahir-maharaj/)\n\nAffiliation: MVP\n\nBlog Post: [Mastering Time Intelligence for Data Science with Microsoft Fabric](https://community.fabric.microsoft.com/t5/Data-Science-Community-Blog/Mastering-Time-Intelligence-for-Data-Science-with-Microsoft/ba-p/4842481)\n\nIn this edition, you’ll learn how to extract features like week, quarter, holiday, and season using Python with pandas, datetime, and the holidays library – all within Microsoft Fabric’s Notebooks. By the end, you’ll know exactly how to make time work for you, by teaching your data to understand patterns, rhythms, and real-world cycles. And because time features are often the hidden key to better predictions, we’ll go beyond the code to explore why each step truly matters.\n\n## Fabric Platform, Administrative & Governance\n\n### Shubham Rai, [LinkedIn](https://www.linkedin.com/in/shubhamrai955/)\n\nAffiliation: Super User\n\nBlog Post: [Fabric Data Agent: End to End Walkthrough Using a Sales Lakehouse](https://community.fabric.microsoft.com/t5/Fabric-platform-Community-Blog/Fabric-Data-Agent-End-to-End-Walkthrough-Using-a-Sales-Lakehouse/ba-p/4998462)\n\nThis article shows how a Fabric Data Agent answers business questions directly from a sales lakehouse using plain English. It walks through creating the agent, connecting sales tables, adding instructions and example queries, and testing it with real questions. The demo shows how the agent picks the right data, generates the query, and returns the result in seconds. It also covers the current limits, like language support and the number of data sources.\n\n### Kevin Chant, [LinkedIn](https://www.linkedin.com/in/kevin-chant/)\n\nAffiliation: MVP\n\nBlog Post: Operationalize configuration-based deployments to work with Microsoft Fabric and Azure DevOps\n\nThis post covers how to operationalize configuration-based deployments to work with Microsoft Fabric and Azure DevOps. This feature is now generally available in the latest fabric-cicd release.\n\nMicrosoft has officially announced official support for Microsoft fabric-cicd tool. With that news, this feels like the perfect time to follow up on the post read by thousands about operationalizing fabric-cicd to work with Microsoft Fabric and Azure DevOps.\n\n### Real-Time Intelligence\n\n### Amit Chandak, [LinkedIn](https://www.linkedin.com/in/amitchandak78/)\n\nAffiliation: MVP\n\nBlog Post: [Real-Time YouTube Live Dashboard in Microsoft Fabric](https://medium.com/microsoft-power-bi/real-time-youtube-live-dashboard-in-microsoft-fabric-7133ffe09c78)\n\nYouTube Live API polls live video statistics every N seconds. Fabric Eventstream (HTTP connector) ingests the API response. KQL Database (EventHouse) stores the raw JSON stream. KQL queries parse the nested JSON in real time. Real-Time Dashboard shows live numbers with auto-refreshing tiles.\n\n## Databases\n\n### Inturi Suparna Babu, [LinkedIn](https://www.linkedin.com/in/inturi-suparna-babu-312b59270/)\n\nAffiliation: Super User\n\nBlog Post: [Open Mirroring in Microsoft Fabric: A Step-by-Step Hands-On Guide](https://community.fabric.microsoft.com/t5/Databases-Community-Blog/Open-Mirroring-in-Microsoft-Fabric-A-Step-by-Step-Hands-On-Guide/ba-p/5000011)\n\nIn this post, I’ll walk you through Open Mirroring in Microsoft Fabric using a practical, hands-on example, covering initial load, incremental updates, and schema changes.\n\nIn this edition, you’ll learn how to extract features like week, quarter, holiday, and season using Python with pandas, datetime, and the holidays library – all within Microsoft Fabric’s Notebooks. By the end, you’ll know exactly how to make time work for you, by teaching your data to understand patterns, rhythms, and real-world cycles. And because time features are often the hidden key to better predictions, we’ll go beyond the code to explore why each step truly matters.\n\n## Certifications & Learning\n\n### Kevin Chant, [LinkedIn](https://www.linkedin.com/in/kevin-chant/)\n\nAffiliation: MVP\n\nBlog Post: [Updated checklist for the DP-600 Microsoft Fabric exam](https://chantifiedlens.com/2026/02/14/updated-checklist-for-the-dp-600-microsoft-fabric-exam/)\n\nThis post is an updated checklist for the DP-600 Microsoft Fabric exam. Which is the exam you need to pass to gain the Fabric Analytics Engineer Associate certification.\n\nSome time ago I created a checklist for the DP-600 exam. To show a bit of love for Microsoft Learn I decided to publish this update on Valentines Day.\n\nIn this edition, you’ll learn how to extract features like week, quarter, holiday, and season using Python with pandas, datetime, and the holidays library – all within Microsoft Fabric’s Notebooks. By the end, you’ll know exactly how to make time work for you, by teaching your data to understand patterns, rhythms, and real-world cycles. And because time features are often the hidden key to better predictions, we’ll go beyond the code to explore why each step truly matters.\n\n## **Thanks for reading & we’ll see you next month!**\n\nThat’s all for this month’s spotlight on the Microsoft Fabric Influencers. We wanted to extend our thanks to the MVPs and Super Users whose expertise continues to enrich the Fabric community. We anticipate the innovative ideas and valuable insights that will emerge in the coming months and invite everyone to stay engaged here on the Fabric Community Platform. Together, we will continue to deliver knowledge and collaboration that empowers every member of our community to achieve more. Stay tuned!",
  "FeedName": "Microsoft Fabric Blog",
  "Link": "https://blog.fabric.microsoft.com/en-US/blog/fabric-influencers-spotlight-february-2026/",
  "ProcessedDate": "2026-02-27 17:09:50",
  "OutputDir": "_news",
  "Title": "Fabric Influencers Spotlight February 2026",
  "FeedUrl": "https://blog.fabric.microsoft.com/en-us/blog/feed/"
}
