{
  "OutputDir": "_news",
  "PubDate": "2026-02-02T09:00:00+00:00",
  "ProcessedDate": "2026-02-02 16:06:49",
  "FeedName": "Microsoft Fabric Blog",
  "Title": "Mirroring Azure Databricks catalogs from Azure Databricks workspaces behind private endpoints (Generally Available)",
  "Description": "Enterprises increasingly deploy Azure Databricks workspaces in locked-down network environments where public network access is disabled, and all access is routed through private endpoints. While this security posture is essential for meeting enterprise and regulatory requirements, it has historically limited integration scenarios for the Mirrored Azure Databricks catalog item in Microsoft Fabric. Earlier, the Mirrored …\n\n[Continue reading “Mirroring Azure Databricks catalogs from Azure Databricks workspaces behind private endpoints (Generally Available) “](https://blog.fabric.microsoft.com/en-us/blog/mirroring-azure-databricks-catalogs-from-azure-databricks-workspaces-behind-private-endpoints-generally-available/)",
  "FeedUrl": "https://blog.fabric.microsoft.com/en-us/blog/feed/",
  "Tags": [],
  "EnhancedContent": "Enterprises increasingly deploy Azure Databricks workspaces in locked-down network environments where public network access is disabled, and all access is routed through private endpoints. While this security posture is essential for meeting enterprise and regulatory requirements, it has historically limited integration scenarios for the [Mirrored Azure Databricks catalog item](https://learn.microsoft.com/fabric/mirroring/azure-databricks) in Microsoft Fabric. Earlier, the Mirrored Azure Databricks Catalog item required Azure Databricks workspaces to be reachable through public network paths, which made it incompatible with private only deployments.\n\nMicrosoft Fabric now supports[mirroring Azure Databricks catalogs](https://learn.microsoft.com/fabric/mirroring/azure-databricks) from Azure Databricks workspaces that are behind private endpoints. This capability is now generally available, and it uses the Virtual Network (VNet) data gateway to establish secure private connectivity. Customers can mirror governed Unity Catalog metadata and data into Fabric from Azure Databricks workspaces that are accessible only through private endpoints.\n\n## Why this matters\n\nNumerous clients are seeking to implement Microsoft Fabric for analytics while maintaining Azure Databricks within highly regulated virtual network environments. Until now, customers with Azure Databricks workspaces secured behind private endpoints were unable to use the Mirrored Azure Databricks catalog item.\n\nWith this release, customers no longer need to choose between strong network isolation and a unified analytics experience. Microsoft Fabric now seamlessly integrates with Azure Databricks environments that have public network access disabled.\n\n## Key benefits\n\n- **Secure connectivity for private Azure Databricks workspaces**\nMirrored Azure Databricks Catalog items can connect to Azure Databricks workspaces that are accessible only through private endpoints, including workspaces with public network access disabled.\n- **Enterprise grade compliance and data protection**\nAll communication between Microsoft Fabric and Azure Databricks occurs through private IP space on the Azure backbone. Sensitive metadata and data remain isolated from the public internet.\n- **Simplified networking for IT and data teams**\nThe solution relies on standard Azure building blocks such as private endpoints, managed identities, and Virtual Network data gateways. This avoids the need for custom networking or proxy solutions.\n- **Consistent experience across Fabric**\nThis capability aligns the Mirrored Azure Databricks Catalog item with other Fabric connectivity models, delivering consistent governance and analytics experience across Fabric workloads.\n\n## How it works\n\n![Architecture diagram showing a Mirrored Azure Databricks Catalog in Microsoft Fabric securely connecting to a VNET-injected Azure Databricks workspace through a private endpoint.](//dataplatformblogwebfd-d3h9cbawf0h8ecgf.b01.azurefd.net/wp-content/uploads/2026/01/image-16.png)Mirrored Azure Databricks Catalog connecting to a VNET-injected Databricks workspace using a private endpoint\n\nMicrosoft Fabric uses the **Virtual Network data gateway** to establish secure private connectivity to Azure Databricks workspaces behind private endpoints. The gateway is deployed into a customer managed virtual network and routes requests from Fabric to Azure Databricks through a private endpoint. All communication remains on the Azure backbone and does not traverse public networks.\n\nThis approach preserves the managed Software as a Service experience of Fabric while aligning with enterprise network security requirements.\n\n## Try it today\n\nIf your organization is already using Azure Databricks workspaces secured behind private endpoints, you can start using this capability today. To get started, refer to [mirroring Azure Databricks catalogs in Microsoft Fabric from workspaces accessible only through private endpoints.](https://learn.microsoft.com/fabric/mirroring/azure-databricks-private-endpoint)\n\n## Learn more\n\nFor an overview of mirroring Azure Databricks catalogs in Fabric, see[Mirroring Azure Databricks Unity Catalog.](https://learn.microsoft.com/fabric/mirroring/azure-databricks)\n\nFor details on private connectivity in Azure Databricks, see [Configure private connectivity to Azure Databricks.](https://learn.microsoft.com/azure/databricks/security/network/front-end/front-end-private-connect)\n\nFor more information on how private connectivity is established from Fabric, see [Create virtual network data gateways.](https://learn.microsoft.com/data-integration/vnet/create-data-gateways)",
  "Author": "Microsoft Fabric Blog",
  "Link": "https://blog.fabric.microsoft.com/en-US/blog/mirroring-azure-databricks-catalogs-from-azure-databricks-workspaces-behind-private-endpoints-generally-available/",
  "FeedLevelAuthor": "Microsoft Fabric Blog"
}
