{
  "Tags": [],
  "EnhancedContent": "For years, organizations have aspired to build cultures where data is embedded into everyday decision-making. Generative AI is bringing that goal closer than ever with agents that can quickly answer questions with data. But at the core, this culture can only be achieved if agents and your people can easily discover and trust high-quality data.\n\nThat’s where organizations struggle. Most enterprise data environments weren’t designed for mass discoverability; they evolved over time as teams adopted tools to meet immediate needs. The result is a fragmented landscape of overlapping systems and isolated silos, leading to data sprawl, duplicated assets, inconsistent access controls, and increased exposure risk. At the same time, with the average cost of a data breach nearing $10 million, expanding access without strong governance and security controls can quickly become costly.1\n\nAddressing these challenges requires a single, unified access point for enterprise data. OneLake was purpose-built for this role, unifying your entire multi-cloud data estate into one logical data lake that spans the organization. Much like OneDrive integrates seamlessly with Microsoft 365 to provide a consistent place for files, OneLake serves as a central foundation for data access and management.\n\nBuilt on top of OneLake, the [OneLake catalog](https://learn.microsoft.com/fabric/governance/onelake-catalog-overview) provides the layer where data, governance, and security come together for easy discovery and oversight. As one of the most widely used data catalogs in the world, it is used by business users, data professionals, and developers alike—making trusted data easy to find while ensuring it remains governed and protected across OneLake.2\n\nIn this blog post, we’ll walk through exactly why the OneLake catalog is perfectly suited to act as the single access point of data for your entire organization.\n\n## Experience the most widely used data catalog worldwide\n\nWe’ve designed the OneLake catalog to be the single place for data professionals and business users to discover, manage, and govern the data they own and can access across OneLake. It serves as the default source of data and insights for many business users with over 30M monthly active Power BI and Fabric users. And since its launch just over a year ago, the OneLake catalog has already been adopted by over 230,000 organizations around the world like the [London Stock Exchange Group](https://www.microsoft.com/en/customers/story/25709-lseg-microsoft-fabric), [IFS](https://www.microsoft.com/en/customers/story/24678-ifs-microsoft-fabric), and the [Chalhoub Group](https://www.microsoft.com/en/customers/story/1792657160796124295-chalhoubgroup-microsoft-fabric-retailers-en-united-arab-emirates).\n\nFor example, [Lumen](https://www.microsoft.com/en/customers/story/23991-lumen-microsoft-fabric)—a leader in enterprise connectivity—cut 10,000 hours of manual effort with OneLake. “OneLake allowed us to ingest once and use anywhere. That flexibility is something we never had before,” said Chad Hollingsworth, a Cloud Architect at Lumen. [Apollo Hospitals](https://www.microsoft.com/en/customers/story/25664-apollo-hospitals-microsoft-fabric), India’s largest private healthcare network, used OneLake to unite their fragmented data systems while ensuring their data was protected at every stage of its journey. “The commitment to security and the maturity of the platform made it clear we could trust it with our most sensitive data,” said Dr. Madhu Sasidhar, President and CEO of Apollo Hospitals.\n\nThe OneLake catalog comes with three tabs—Explore, Govern, and Secure—that can help all Fabric users discover, manage, and secure trusted data. Check out a quick demo of the full experience:\n\nYou can also try the OneLake catalog for yourself by starting a free [Microsoft Fabric trial](https://aka.ms/tryfabric).\n\n## Explore tab: discover and explore your data\n\nOrganizations have long envisioned a culture where data doesn’t just sit in dashboards but actively shapes every decision. Today, that expectation extends to every employee—regardless of role—to confidently leverage data in their daily work. But delivering on this vision places enormous pressure on IT and data teams, who must support broad access while maintaining governance, clean data, and scalability.\n\nThe [Explore tab](https://learn.microsoft.com/fabric/governance/onelake-catalog-explore) in the OneLake catalog was designed specifically for this in mind—it serves as the central entry point for everyone in your organization to discover, explore, and manage data. With powerful navigation and discovery capabilities—including [domain](https://learn.microsoft.com/fabric/governance/domains) and subdomain scoping, granular filters for item types, [tags](https://learn.microsoft.com/fabric/governance/tags-overview), [endorsements](https://learn.microsoft.com/en-us/fabric/governance/endorsement-overview), and workspaces—users can locate exactly what they need across the data mesh quickly and confidently.\n\n![Screenshot of the OneLake Catalog Explore tab, displaying searchable data assets, filtering controls, and metadata such as asset name, type, and owner.](//dataplatformblogwebfd-d3h9cbawf0h8ecgf.b01.azurefd.net/wp-content/uploads/2026/02/word-image-33252-2.png)\n\nIn the Explore tab, you can browse all Fabric item types including data items, insights, processes, apps, and more. Each item comes with rich, in‑depth metadata, giving users immediate access to descriptions, tags, schemas, tables, views, and other contextual details. Data practitioners can drill into the structure of lakehouses, warehouses, databases, or even mirrored items, while business users can explore reports and dashboards with clarity and trust.\n\nBeyond visibility, the Explore tab integrates [lineage](https://learn.microsoft.com/fabric/governance/lineage), access permissions, and monitoring directly into the item view—allowing you to govern and manage your data without navigating out of the catalog. You also get exploration capabilities at the subitem level, allowing you to quickly investigate measures, tables, and objects to generate insights and drive action. You can even use Copilot to generate summaries of semantic models, providing quick insights about the model so you can decide if it fits your use case.\n\nFor data owners, they can take action directly in the OneLake catalog to improve the discoverability of their items such as adding tags, descriptions, and endorsements.\n\n![Screenshot of the OneLake Catalog Explore tab, displaying a double click into a data item and showing that data item's lineage.](//dataplatformblogwebfd-d3h9cbawf0h8ecgf.b01.azurefd.net/wp-content/uploads/2026/02/word-image-33252-3.png)\n\nThe Explore tab isn’t just accessible from Microsoft Fabric. We’ve also embedded the OneLake catalog everywhere your people work including Microsoft Teams, Microsoft Excel, Microsoft Copilot Studio, and 100s of other scenarios—bringing data access to the 350 million Microsoft 365 users.\n\n![Screenshot of the OneLake Catalog embedded in Excel, showing data assets available to browse and select within the Excel interface](//dataplatformblogwebfd-d3h9cbawf0h8ecgf.b01.azurefd.net/wp-content/uploads/2026/02/word-image-33252-4.png)\n\nFinally, developers can query the catalog to search and discover items through public APIs, the Fabric MCP, and through the Fabric Command Line Interface (CLI). This provides seamless integration into familiar tools like GitHub Copilot and allows you to automate your data project workflows.\n\nBy unifying discovery, context, and action, the OneLake catalog Explore tab sets the foundation for a fully connected, intelligent data experience—empowering organizations to make faster, more confident decisions across Microsoft Fabric.\n\n## Govern tab: Maintain control and trust\n\nAs organizations scale their data estates, the ability to quickly understand, monitor, and improve the data quality becomes critical to the health of your data estate. The [Govern tab](https://learn.microsoft.com/en-us/fabric/governance/onelake-catalog-govern) in the OneLake catalog delivers exactly that—a unified, intuitive governance hub designed to empower both everyday data users and Fabric administrators with actionable intelligence and built‑in guidance.\n\n![Screenshot of the OneLake Catalog Govern tab, displaying governance features such as data policies, ownership, and stewardship settings](//dataplatformblogwebfd-d3h9cbawf0h8ecgf.b01.azurefd.net/wp-content/uploads/2026/02/word-image-33252-5.png)\n\nFor data users, the Govern tab offers immediate visibility into the health of their data items, providing high‑level indicators such as curation completeness, endorsements, and [Microsoft Purview sensitivity label](https://learn.microsoft.com/fabric/governance/protected-sensitivity-labels) coverage. Based on these insights, users can quickly identify gaps and follow step‑by‑step recommended actions to improve the security and trustworthiness of their content. These insights draw from the most recent successful refresh, ensuring you always operate with the latest information.\n\nFor admins, the Govern tab scales this intelligence across the entire Fabric tenant, consolidating insights about items, workspaces, capacities, and domains into a single place. Admins can see organization‑wide data usage patterns, data sensitivity posture, [Microsoft Purview Data Loss Prevention](https://learn.microsoft.com/purview/dlp-powerbi-get-started) coverage, and governance maturity—all enriched with recommended remediations to strengthen compliance and reduce risk at scale.\n\nAdmins and data owners alike can scope their insights to specific domains and even ask Copilot for deeper exploration so they can move from observation to action faster than ever. You can also extend the governance experience by building fully customized reports based on the underlying semantic model that are tailored to your organization’s monitoring needs.\n\nAcross both audiences, the Govern tab centralizes governance tools, learning resources, and best‑practice guidance—bringing governance closer to where people actually work. By simplifying complexity, surfacing what matters, and embedding clear paths to improvement, the OneLake catalog transforms governance from a back‑office function into a daily accelerant for trusted, high‑quality data use.\n\n## Secure tab: manage access across your data items\n\nAs more users are expected to make data-driven decisions, ensuring the right people have the right access becomes essential to reducing risk, maintaining customer trust, and supporting secure data-driven innovation. The [Secure tab](https://learn.microsoft.com/fabric/governance/secure-your-data) in the OneLake catalog provides a streamlined, centralized experience for understanding and managing access across your entire data estate.\n\nAt its core, the Secure tab consolidates everything needed to audit, validate, and refine permissions across workspaces and Fabric items. On the “view users” page, you can quickly see all the users who have access to your workspaces including each user’s assigned roles and permissions with filters for type of user, workspace role, and workspace. This simplifies quarterly access reviews and accelerates everyday security checks, enabling governance teams and workspace owners to uphold least‑privilege principles with confidence.\n\n![Screenshot of the OneLake Catalog Secure tab in Microsoft Fabric, showing the View Users page and the associated users in this organization](//dataplatformblogwebfd-d3h9cbawf0h8ecgf.b01.azurefd.net/wp-content/uploads/2026/02/word-image-33252-6.png)\n\nThe “view security roles” page highlights the different [OneLake security](https://learn.microsoft.com/fabric/onelake/security/get-started-security#onelake-security-preview) roles you have across your data items. You can manage existing roles or create new roles for your data items—including defining the specific Row‑Level Security (RLS) and Column‑Level Security (CLS) for each role—directly within the catalog, ensuring consistent, standardized protection at the data level without navigating across multiple tools.\n\n![Screenshot of the OneLake Catalog Secure tab in Microsoft Fabric, showing the View Security Roles page and the associated roles that have been set up for this organization](//dataplatformblogwebfd-d3h9cbawf0h8ecgf.b01.azurefd.net/wp-content/uploads/2026/02/word-image-33252-7.png)\n\nBy centralizing visibility and simplifying action, the Secure tab helps organizations proactively fortify their data landscape. Whether validating workspace access or refining granular security roles, teams can now manage data security with precision—strengthening compliance, safeguarding sensitive insights, and ensuring secure collaboration across Fabric.\n\nCheck out other recent blogs on OneLake security on the Fabric Updates blog channel:\n\n1. [Manage OneLake security for Mirrored Databases (Preview)](https://blog.fabric.microsoft.com/blog/manage-onelake-security-for-mirrored-databases-preview?ft=Onelake:category)\n2. [Granular APIs for OneLake security (Preview)](https://blog.fabric.microsoft.com/blog/granular-apis-for-onelake-security-preview?ft=Onelake:category)\n3. [Fine-grained ReadWrite access to data with OneLake security (Preview)](https://blog.fabric.microsoft.com/blog/fine-grained-readwrite-access-to-lakehouse-data-with-onelake-security?ft=Aaron%20Merrill:author)\n4. [OneLake security (Preview)](https://blog.fabric.microsoft.com/blog/onelake-security-is-now-available-in-public-preview?ft=Aaron%20Merrill:author)\n\n## Conclusion: A unified data lake for your entire organization\n\nBy unifying data in one place and breaking down silos, the OneLake catalog can become the single point for all your users to discover and explore your organization’s data organized into a logical data mesh. But crucially, the OneLake catalog is only a piece of what makes OneLake special. To dive deeper into everything that makes OneLake the ideal data lake to support data and AI workloads, check out our OneLake overview blog, “[OneLake: your foundation for an AI-ready data estate](https://blog.fabric.microsoft.com/blog/onelake-your-foundation-for-an-ai-ready-data-estate?ft=All).”\n\n*1[Harvard Business Review, The Devastating Business Impacts of a Cyber Breach, 2023](https://hbr.org/2023/05/the-devastating-business-impacts-of-a-cyber-breach)*\n\n*2Comparative analysis based on publicly disclosed customer count and third-party estimates.*",
  "FeedLevelAuthor": "Microsoft Fabric Blog",
  "Author": "Microsoft Fabric Blog",
  "OutputDir": "_news",
  "Link": "https://blog.fabric.microsoft.com/en-US/blog/onelake-catalog-the-trusted-catalog-for-organizations-worldwide/",
  "FeedName": "Microsoft Fabric Blog",
  "Description": "For years, organizations have aspired to build cultures where data is embedded into everyday decision-making. Generative AI is bringing that goal closer than ever with agents that can quickly answer questions with data. But at the core, this culture can only be achieved if agents and your people can easily discover and trust high-quality data. …\n\n[Continue reading “OneLake catalog: The trusted catalog for organizations worldwide”](https://blog.fabric.microsoft.com/en-us/blog/onelake-catalog-the-trusted-catalog-for-organizations-worldwide/)",
  "ProcessedDate": "2026-02-09 21:11:33",
  "Title": "OneLake catalog: The trusted catalog for organizations worldwide",
  "FeedUrl": "https://blog.fabric.microsoft.com/en-us/blog/feed/",
  "PubDate": "2026-02-09T14:00:00+00:00"
}
