{
  "Description": "Data teams today are under extraordinary pressure. Expectations around analytics and AI have never been higher, yet enterprise data continues to live across a patchwork of systems, tools, and platforms. The result is friction, duplication, and complexity, making it harder for data teams to provide a unified, real-time view of their business. Microsoft and Snowflake …\n\n[Continue reading “Microsoft OneLake and Snowflake interoperability (Generally Available)”](https://blog.fabric.microsoft.com/en-us/blog/microsoft-onelake-and-snowflake-interoperability-is-now-generally-available/)",
  "FeedName": "Microsoft Fabric Blog",
  "Title": "Microsoft OneLake and Snowflake interoperability (Generally Available)",
  "Tags": [],
  "Link": "https://blog.fabric.microsoft.com/en-US/blog/microsoft-onelake-and-snowflake-interoperability-is-now-generally-available/",
  "OutputDir": "_news",
  "ProcessedDate": "2026-02-03 07:15:57",
  "EnhancedContent": "Data teams today are under extraordinary pressure. Expectations around analytics and AI have never been higher, yet enterprise data continues to live across a patchwork of systems, tools, and platforms. The result is friction, duplication, and complexity, making it harder for data teams to provide a unified, real-time view of their business.\n\nMicrosoft and Snowflake committed to solving this challenge with a shared vision: empower our customers to access, analyze, and share data across platforms without duplication and without locking them into proprietary formats.\n\nToday, that vision becomes a reality. At Snowflake’s [BUILD conference](https://www.snowflake.com/en/build/london/) in London today, we are co-announcing Microsoft OneLake’s interoperability with Snowflake is now **generally available,** marking a major milestone for thousands of joint customers building modern, open and interoperable data foundations. Adding to the list of already generally available integrations, we are now making the ability to natively store Snowflake-managed Iceberg tables in OneLake, the automatic conversion of Fabric data into Iceberg format for direct access from Snowflake, and new UI experiences in both platforms into general availability.\n\nIf you’re interested in learning more about our collaboration with Snowflake, I recently sat down with [Christian Kleinerman](https://www.snowflake.com/en/blog/authors/christian-kleinerman/), Executive VP of Product at Snowflake, to discuss our integration and talk broadly about the future of our platforms and the industry: [watch](https://aka.ms/Arun-Christian-Fireside-Chat)[t](https://aka.ms/Arun-Christian-Fireside-Chat)[h](https://aka.ms/Arun-Christian-Fireside-Chat)[e](https://aka.ms/Arun-Christian-Fireside-Chat)https://aka.ms/Arun-Christian-Fireside-Chat[v](https://aka.ms/Arun-Christian-Fireside-Chat)[i](https://aka.ms/Arun-Christian-Fireside-Chat)[d](https://aka.ms/Arun-Christian-Fireside-Chat)[e](https://aka.ms/Arun-Christian-Fireside-Chat)[o](https://aka.ms/Arun-Christian-Fireside-Chat)https://aka.ms/Arun-Christian-Fireside-Chat[o](https://aka.ms/Arun-Christian-Fireside-Chat)[n](https://aka.ms/Arun-Christian-Fireside-Chat)https://aka.ms/Arun-Christian-Fireside-Chat[Y](https://aka.ms/Arun-Christian-Fireside-Chat)[o](https://aka.ms/Arun-Christian-Fireside-Chat)[u](https://aka.ms/Arun-Christian-Fireside-Chat)[T](https://aka.ms/Arun-Christian-Fireside-Chat)[u](https://aka.ms/Arun-Christian-Fireside-Chat)[b](https://aka.ms/Arun-Christian-Fireside-Chat)[e](https://aka.ms/Arun-Christian-Fireside-Chat).\n\n## Unlocking full cross-platform interoperability\n\nAI has accelerated the need for organizations to unify their data estates, but doing so with traditional, copy-heavy approaches is slow, expensive, and brittle. The now generally available (GA) integration between OneLake and Snowflake gives customers something fundamentally different: the freedom to choose the right architecture, storage, and analytical engine for every scenario, without introducing silos or operational overhead.\n\nSo, what does this GA mean for you?\n\n- The ability to bidirectionally read Iceberg data managed by Snowflake or Microsoft Fabric.\n- The ability to natively store Snowflake-managed iceberg tables in Microsoft OneLake.\n\nTaken together, you now have full flexibility to store your data in either platform while picking the right tool in either Fabric or Snowflake for any project. Since it’s a single copy of data, any changes you make to your data in one platform are reflected in both.\n\nWe’re also making new UI elements in both platforms generally available starting next week, including a new Snowflake item in OneLake. This item allows you to access your Snowflake data in OneLake faster without complicated configurations. Snowflake has also introduced new UI that allows users to seamlessly push managed Iceberg tables directly into Fabric, making them instantly discoverable as OneLake items.\n\nCheck out a quick demo of this new UI in action:\n\n## https://www.youtube.com/embed/dmwE6B5k6oE?feature=oembedLooking ahead: empowering customers on their terms\n\nWhile we are thrilled at the progress we’ve made already, this isn’t the end of our collaboration. We will continue to release new capabilities that help bring our platforms together, like our recently released OneLake table APIs which integrate directly with Snowflake’s catalog-linked database feature. To see the latest in person, I’d encourage you to join us for [**FabCon & SQLCon 2026**](https://aka.ms/FabCon) in Atlanta, Georgia. The event takes place from March 16–20, 2026 and will give you a unique opportunity to master the latest innovations and get practical guidance from both Fabric and Snowflake experts. You can register for either FabCon or SQLCon conferences and enjoy full access to both.\n\nYou can also learn more about our current capabilities through these resources:\n\n- Watch the [keynote broadcast](https://www.snowflake.com/en/build/london-keynote-broadcast/) of Snowflake’s BUILD conference in London.\n- Try the [Snowflake Quickstart for Iceberg in OneLake](https://quickstarts.snowflake.com/guide/getting_started_with_iceberg_in_oneLake/index.html?_ga=2.4046832.1392156976.1757344207-1553077896.1747951511&amp;_gac=1.224858344.1755023652.Cj0KCQjwzOvEBhDVARIsADHfJJQuB-FU5ZF0u7wgFyvOR-ThCJcpHxV4FxDP_-bC0JitaSkK57-dB5caAquFEALw_wcB%22%20%5Cl%20%220) and watch the [walkthrough video guide](https://www.youtube.com/watch?v=pCOAiBPgnrA) for hands on demos.\n- Read the Microsoft Learn documentation on using [Snowflake with Iceberg tables in OneLake](https://learn.microsoft.com/fabric/onelake/onelake-iceberg-snowflake)\n- Explore our [OneLake developer guidance for endpoints and SDKs](https://learn.microsoft.com/fabric/onelake/onelake-access-api).\n\n![](//dataplatformblogwebfd-d3h9cbawf0h8ecgf.b01.azurefd.net/wp-content/uploads/2026/01/image-19.png)",
  "FeedUrl": "https://blog.fabric.microsoft.com/en-us/blog/feed/",
  "FeedLevelAuthor": "Microsoft Fabric Blog",
  "PubDate": "2026-02-03T00:00:00+00:00",
  "Author": "Microsoft Fabric Blog"
}
