{
  "FeedLevelAuthor": "Microsoft Fabric Blog",
  "Title": "Expanding Real-Time Intelligence data sources with Cribl source (Preview)",
  "OutputDir": "_news",
  "Description": "The exchange of real-time data across different data platforms is becoming increasingly popular. The Cribl source (preview) is now available in Real-Time Intelligence, allowing real-time data to flow into Fabric RTI Eventstream through our collaboration with Cribl, enabling you to take full advantage of Fabric Real-Time Intelligence’s robust analytics tools for their real-time needs. Collaborating to broaden …\n\n[Continue reading “Expanding Real-Time Intelligence data sources with Cribl source (Preview)”](https://blog.fabric.microsoft.com/en-us/blog/expanding-real-time-intelligence-data-sources-with-cribl-source-preview/)",
  "Link": "https://blog.fabric.microsoft.com/en-US/blog/expanding-real-time-intelligence-data-sources-with-cribl-source-preview/",
  "FeedName": "Microsoft Fabric Blog",
  "Author": "Microsoft Fabric Blog",
  "Tags": [],
  "ProcessedDate": "2026-01-20 20:21:43",
  "FeedUrl": "https://blog.fabric.microsoft.com/en-us/blog/feed/",
  "PubDate": "2026-01-20T13:00:00+00:00",
  "EnhancedContent": "The exchange of real-time data across different data platforms is becoming increasingly popular. The Cribl source (preview) is now available in Real-Time Intelligence, allowing real-time data to flow into Fabric RTI Eventstream through our collaboration with Cribl, enabling you to take full advantage of Fabric Real-Time Intelligence’s robust analytics tools for their real-time needs.\n\n## Collaborating to broaden data source coverage\n\nMicrosoft Fabric provides a unified platform for data storage, processing, and analytics. Real-Time Intelligence empowers organizations to analyze and visualize streaming data, offering an end-to-end solution for real-time and event-driven scenarios. Within it, Eventstream serves as the central place in Fabric for capturing, transforming, and routing real-time data from diverse sources to multiple destinations.\n\n![Diagram illustrating Real-Time Intelligence in Microsoft Fabric, showing a workflow from data connectors through five stages: Stream, Analyze, Model, Visualize, and Decide &amp; Act. Key components include a Fabric Platform with Copilot, OneLake, Real-Time Hub, and Governance, highlighted with distinct icons and labeled sections to represent data integration and processing flow.](//dataplatformblogwebfd-d3h9cbawf0h8ecgf.b01.azurefd.net/wp-content/uploads/2026/01/image-1.png)Figure 1 Fabric Real-Time Intelligence\n\nCribl helps organizations regain control over their telemetry data flows by providing a unified way to collect data from a wide variety of sources and process it efficiently before delivery to its destinations. It enables enterprises to ingest logs, metrics, and traces originating from cloud services, on-premises infrastructure, and edge environments for IT and security teams. A key strength of Cribl lies in its broad data source coverage. Through its flagship product, Cribl Stream, the platform supports both push and pull ingestion models. It can receive data through sources such as Syslog, Datadog Agent, Splunk, Open Telemetry, etc., or pull data from systems such as Amazon SQS, AWS S3, CrowdStrike FDR, Prometheus Scrape, etc. ([sources](https://docs.cribl.io/stream/sources) available in Cribl Stream). Cribl also supports on-premises and edge-based sources—including local log files and system metrics— enabling end-to-end telemetry collection from edge to cloud.\n\n![Screenshot of dashboard displaying various data source collectors and push integrations in Cribl Stream. Collectors include Azure Blob, Cribl Lake, Database, Google Cloud Storage, etc.](//dataplatformblogwebfd-d3h9cbawf0h8ecgf.b01.azurefd.net/wp-content/uploads/2026/01/image-1.jpg)Figure 2 Cribl Stream\n\nBy integrating Cribl as a Fabric RTI source, organizations can efficiently ingest diverse telemetry and log data from multiple environments into Fabric, a unified tool for storing, processing, and analyzing data. This setup boosts data processing flexibility and supports rapid decisions through Fabric’s Real-Time Intelligence capabilities, including large-scale analysis, real-time alerts, data transformation, and event-driven application development.\n\n## Better together: Simplifying Real-Time data integration\n\nThe collaboration aims to help you transfer real-time data from Cribl to Fabric Real-Time Intelligence, offering improved visibility and increased efficiency by:\n\n- Creating a dedicated source type for Cribl in Fabric Real-Time Hub so that you can easily create the Kafka endpoint in Eventstream to receive the data pushed from Cribl with the properties needed to help you connect Cribl to Eventstream.\n\n![Screenshot of Real-Time hub showing a list of data connectors available for integration, including highlighted &quot;Cribl&quot; connector for routing data from Cribl to Fabric.](//dataplatformblogwebfd-d3h9cbawf0h8ecgf.b01.azurefd.net/wp-content/uploads/2026/01/image-3.png)Figure 3  Cribl in Fabric Real-Time hub\n- Adding a dedicated destination type for ‘Fabric Real-Time Intelligence’ in Cribl, enabling you to easily discover and add the ‘Fabric Real-Time Intelligence’ destination to push the data to Fabric via the Kafka protocol.\n\n![Screenshot of Cribl Stream showing data destination list. It displays various destination options with Fabric Real-Time Intelligence highlighted in both tile view and list view.](//dataplatformblogwebfd-d3h9cbawf0h8ecgf.b01.azurefd.net/wp-content/uploads/2026/01/image-3.png)Figure 4 Fabric Real-Time Intelligence in Cribl Stream\n\n## Routing data from Cribl to Fabric\n\nThis integration streamlines data routing to Fabric Real-Time Intelligence Eventstream, enabling faster and simpler configuration. Follow these steps to use the feature.\n\nGo to Real-Time hub, select **Data source** in the left pane, and choose **Cribl**. Give the source a name to complete the configuration and then the Eventstream Kafka endpoint for receiving data will be created with the detailed information shown in **Details**.\n\n![Screenshot of an eventstream showing the details of a Cribl source added inside the eventstream, including the bootstrap server, topic name, SASL mechanism, etc.](//dataplatformblogwebfd-d3h9cbawf0h8ecgf.b01.azurefd.net/wp-content/uploads/2026/01/image-2.png)Figure 5 Eventstream with Cribl source added\n\nLog in to the **Cribl worker group you want to send from** and select **Fabric Real-Time Intelligence** from the Cribl Data Destination list to add it. You will be prompted to enter the Kafka connection details, which are generated in Eventstream’s Cribl source as shown in Figure 5.\n\n![Screenshot of Cribl Stream's destination for configuring a 'Fabric Real-Time Intelligence' destination. The form includes fields for output ID, description, bootstrap server, topic name, acknowledgments, record data format, backpressure behavior, and tags, with options set to JSON format and leader acknowledgments.](//dataplatformblogwebfd-d3h9cbawf0h8ecgf.b01.azurefd.net/wp-content/uploads/2026/01/image-4.png)Figure 6 Fabric Real-Time Intelligence configuration in Cribl destination\n\nIf a Cribl source like **Syslog** is already added, use QuickConnect to link the source and destination. This allows data to flow from the Cribl source to the Cribl destination you configured, i.e., Fabric Real-Time Intelligence.\n\n![Screenshot of Cribl QuickConnect interface showing a routing setup between one source labeled &quot;Syslog&quot; and three destination options labeled &quot;Real-Time Intelligence&quot; with different tags. ](//dataplatformblogwebfd-d3h9cbawf0h8ecgf.b01.azurefd.net/wp-content/uploads/2026/01/image.jpg)Figure 7 Cribl QuickConnect\n\nAs a result, you will see the data available in your Eventstream.\n\n![Screenshot of an eventstream that has a Cribl source added. And the data has been flowing into Eventstream and can be previewed which is shown in this screenshot.](//dataplatformblogwebfd-d3h9cbawf0h8ecgf.b01.azurefd.net/wp-content/uploads/2026/01/image-2.jpg)Figure 8 Eventstream with data flows in from Cribl\n\nTo learn more and get started, refer to the [Cribl source documentation](https://aka.ms/criblsrcdoc).\n\n## Analyzing data in Fabric Real-Time Intelligence: insights, notifications, and beyond\n\nWhen real-time data from Cribl flows into Fabric Eventstream, you can fully leverage the rich suite of real-time analytics tools available in Fabric Real-Time Intelligence (RTI) to power your real-time scenarios. For example,\n\n- Using [Eventhouse](https://learn.microsoft.com/fabric/real-time-intelligence/eventhouse), you can analyze and explore large volumes of real-time data with Kusto Query Language (KQL) queries. The KQL queries can be exported to a Real-Time Dashboard as visuals to monitor and visualize the data, enhancing data exploration, query performance, and visualization.\n- With [Activator](https://learn.microsoft.com/fabric/real-time-intelligence/data-activator/activator-introduction), you can be alerted across multiple channels such as emails and Teams when specific patterns or conditions are detected in real-time data.\n- The [Derived Stream feature](https://learn.microsoft.com/fabric/real-time-intelligence/event-streams/create-default-derived-streams#concepts) enables reshaping and transforming real-time data for further analysis or reuse by other teams and applications within the organization.\n- Custom endpoint capability allows developers to build event-driven applications that consume and act on events directly from Eventstream.\n\n## Try it now and share your feedback\n\nCribl source is now available in Fabric Real-Time Intelligence (Preview). Try it with your Fabric account. If you don’t have one, [sign up for Power BI with a new Microsoft 365 trial](https://learn.microsoft.com/power-bi/enterprise/service-admin-signing-up-for-power-bi-with-a-new-office-365-trial) and start a free [Fabric trial capacity](https://learn.microsoft.com/fabric/fundamentals/fabric-trial). Learn more about [Eventstream](https://learn.microsoft.com/fabric/real-time-intelligence/event-streams/overview?tabs=enhancedcapabilities). We welcome your feedback through the [community forum](https://aka.ms/realtimecommunity), [idea submission](https://aka.ms/realtimeideas), or via [email](mailto:askeventstreams@microsoft.com)."
}
