{
  "FeedLevelAuthor": "Microsoft Fabric Blog",
  "Title": "Fabric Influencers Spotlight January 2026",
  "FeedUrl": "https://blog.fabric.microsoft.com/en-us/blog/feed/",
  "ProcessedDate": "2026-01-30 16:06:48",
  "FeedName": "Microsoft Fabric Blog",
  "Link": "https://blog.fabric.microsoft.com/en-US/blog/fabric-influencers-spotlight-january-2026/",
  "PubDate": "2026-01-30T09:00:00+00:00",
  "EnhancedContent": "Welcome to the January 2026 edition of the Fabric Influencers Spotlight, a recurring monthly post here to shine a bright light on the places on the internet where Microsoft MVPs & Fabric Super Users are doing some amazing work on all aspects of Microsoft Fabric.\n\nThe Microsoft Fabric Community team has created the Fabric Influencers Spotlight to highlight and amplify blog posts, videos, presentations, and other content related to Microsoft Fabric. We’ve cultivated submissions from members of Microsoft MVPs & Fabric Super Users from the Fabric community that cover the Fabric Platform, Data Engineering & Data Science in Fabric, Data Warehousing, Power BI, Real-Time Intelligence, Data Integration, Fabric Administration & Governance and Databases.\n\nMicrosoft Most Valuable Professionals, or MVPs, are technology experts who utilize their deep knowledge of Microsoft products and services to bring together diverse platforms, products, and solutions, to solve real world problems, and to bring “leading edge” content to the data community. To learn about the Microsoft MVP Award and to find MVPs, visit the [official website](https://mvp.microsoft.com/).\n\nFabric Super Users are the heroes of the Fabric Community. They contribute helpful answers, write informative blog posts, post data stories and are key contributors to the Fabric product via engagement with the product group. To learn more about the Super User program, visit the [official website](https://aka.ms/SuperUsers).\n\n## Data Warehouse\n\n### Amit Chandak, [LinkedIn](https://www.linkedin.com/in/amitchandak78/)\n\nAffiliation: MVP\n\nYouTube: [How to Use IDENTITY Columns in Microsoft Fabric Data Warehouse (Surrogate Keys)](https://youtu.be/kgFiIRukiJM)\n\nOne can now automatically generate surrogate keys in Microsoft Fabric Data Warehouse using IDENTITY columns. In this video, I walk you through this highly requested Preview feature, explain how it differs from SQL Server, and demonstrate exactly how to implement it\n\n## Power BI\n\n### Jennifer Rattan, [LinkedIn](https://www.linkedin.com/in/jennifer-ratten-4759064/)\n\nAffiliation: Super User\n\nBlog: [Rethinking Data Prep – Power BI Narrative Visual as a Clever Ally](https://community.fabric.microsoft.com/t5/Power-BI-Community-Blog/Rethinking-Data-Prep-Power-BI-Narrative-Visual-as-a-Clever-Ally/ba-p/4919996)\n\nIn this post I demonstrate how I push the Narratives visual beyond the traditional uses and into the unconventional frontier. I use it to parse, adapt, document, model, explain, infer and code. From common data engineering and analyst tasks to far-reaching edge cases, Narratives can be an unexpected AI-powered ally with results displayed in a Power BI report.\n\n### Ilgar Zarbaliyev, [LinkedIn](https://www.linkedin.com/in/ilgarzarbaliyev/)\n\nAffiliation: MVP\n\nBlog:[Understanding the Differences Between DAX UDF and Fabric UDF in Power BI and How to Use Them](https://www.linkedin.com/pulse/understanding-differences-between-dax-udf-fabric-power-ofivf)\n\nThis article examines the two types of User-Defined Functions (UDFs) supported in Power BI—DAX UDFs and Fabric UDFs. It outlines their key differences, typical use cases, creation approaches, and capabilities, offering practical guidance on how each can be used to enhance data modeling and enable deeper integration across Power BI and Microsoft Fabric environments.\n\n## Data Engineering\n\n### Vojtech Sima, [LinkedIn](https://www.linkedin.com/in/vojtech-sima/)\n\nAffiliation: Super User\n\nBlog: [Power BI Write-Back to Azure SQL Database using Fabric User Data Functions](https://www.vojtechsima.com/post/power-bi-write-back-to-azure-sql-fabric-udf)\n\nUser Data Functions with Power BI are an excellent way to bypass Power Apps for write-back scenarios and immediately see the results in your report. However, because standard Fabric features can quickly drain Capacity Units on smaller instances, I investigated a more cost-effective architecture that interacts directly with an Azure SQL Database. The results confirm this setup is entirely possible, and this blog walks through the technical implementation in detail.\n\n## Data Science\n\n### Sahir Maharaj, [LinkedIn](https://www.linkedin.com/in/sahir-maharaj/)\n\nAffiliation: MVP\n\nBlog: [Mastering Regularization for Data Science in Microsoft Fabric](https://community.fabric.microsoft.com/t5/Data-Science-Community-Blog/Mastering-Regularization-for-Data-Science-in-Microsoft-Fabric/ba-p/4818743)\n\nIn this edition, we’re exploring regularization and breaking down why it’s the secret weapon against overfitting. By the time you’re through, you’ll understand what regularization actually does in plain terms, how L1, L2, and ElasticNet each bring their own flavor to the table, and when it makes sense to use one over the other.\n\n## Fabric Platform, Administrative & Governance\n\n### Inturi Suparna Babu, [LinkedIn](https://www.linkedin.com/in/inturi-suparna-babu-312b59270/)\n\nAffiliation: Super User\n\nBlog: [Fine-grained ReadWrite access to data with OneLake security – Row Level Security](https://community.fabric.microsoft.com/t5/Fabric-platform-Community-Blog/Fine-grained-ReadWrite-access-to-data-with-OneLake-security-Row/ba-p/4914092)\n\nIn this blog, I will walk you through how to configure OneLake security with fine‑grained Read, Read‑Write access and Row‑Level Security (RLS) in Microsoft Fabric. This step‑by‑step guide is based on a real‑world scenario and includes practical implementation details that you can easily replicate in your environment.\n\n### Aleksi Partanen, [LinkedIn](https://www.linkedin.com/in/aleksi-partanen/)\n\nAffiliation: MVP\n\nYouTube: [Microsoft Fabric Data Stores and Databases Overview](https://youtu.be/QLD6M_GRu_c)\n\nThis video provides a clear overview of Microsoft Fabric data stores and databases, explaining how Lakehouse, Warehouse, Eventhouse, SQL Database, and Cosmos DB fit together and how they relate to OneLake. It focuses on the role of each data store, their typical use cases, and how data from all of these data stores and databases can be accessed and used through OneLake as a unified analytical layer.\n\n## Real-Time Intelligence\n\n### Greg Low, [LinkedIn](https://linked.in/in/greglow)\n\nAffiliation: MVP\n\nBlog: Fabric RTI 101\n\nThese are the first few blog posts of a new series on Fabric RTI that I’ve called “Fabric RTI 101”. I have a post scheduled for every second day, and there are around 150 posts in this series. I already have the content for each post.\n\n## Learning & Certification\n\n### Kevin Chant, [LinkedIn](https://www.linkedin.com/in/kevin-chant/)\n\nAffiliation: MVP\n\nBlog: [Updated advice if Microsoft certifications are your New Year’s resolution](https://chantifiedlens.com/2026/01/01/updated-advice-if-microsoft-certifications-are-your-new-years-resolution/)\n\nIn 2023, I published a post that covered advice if Microsoft certifications are your New Years resolution. However, a lot has changed since then. Including the introduction of Microsoft Fabric and the advancement of AI. So, I thought an updated version was required.\n\n### Frank Geisler, [LinkedIn](https://www.linkedin.com/in/frank-geisler/)\n\nAffiliation: MVP\n\nYouTube: [The F-Files Podcast: Episode 005 Reload Regret](https://www.youtube.com/watch?v=97AYiuvexe0&amp;list=PLZ4JMqbYd0BYbdjyHDFLZFF1M3PkYBqm_)\n\nThe F‑Files Podcast is a sharp, no-nonsense podcast diving into the world of Microsoft Data, Fabric, Real-Time Intelligence, and AI. Hosted by industry insiders, it blends deep technical insight with real-world stories, opinions, and a good dose of humor. Think less marketing, more what actually works. Straight from the field, for practitioners who like to look behind the curtain.\n\n## **Thanks for reading & we’ll see you next month!**\n\nThat’s all for this month’s spotlight on the Microsoft Fabric Influencers. We wanted to extend our thanks to the MVPs and Super Users whose expertise continues to enrich the Fabric community. We anticipate the innovative ideas and valuable insights that will emerge in the coming months and invite everyone to stay engaged here on the Fabric Community Platform. Together, we will continue to deliver knowledge and collaboration that empowers every member of our community to achieve more. Stay tuned!",
  "Author": "Microsoft Fabric Blog",
  "OutputDir": "_news",
  "Tags": [],
  "Description": "Welcome to the January 2026 edition of the Fabric Influencers Spotlight, a recurring monthly post here to shine a bright light on the places on the internet where Microsoft MVPs & Fabric Super Users are doing some amazing work on all aspects of Microsoft Fabric. The Microsoft Fabric Community team has created the Fabric Influencers Spotlight to …\n\n[Continue reading “Fabric Influencers Spotlight January 2026”](https://blog.fabric.microsoft.com/en-us/blog/fabric-influencers-spotlight-january-2026/)"
}
