{
  "FeedUrl": "https://blog.fabric.microsoft.com/en-us/blog/feed/",
  "Link": "https://blog.fabric.microsoft.com/en-US/blog/announcing-official-support-for-microsoft-fabric-cicd-tool/",
  "PubDate": "2026-02-19T12:00:00+00:00",
  "FeedLevelAuthor": "Microsoft Fabric Blog",
  "ProcessedDate": "2026-02-19 19:15:46",
  "OutputDir": "_news",
  "Author": "Microsoft Fabric Blog",
  "EnhancedContent": "Today, we’re announcing that [fabric‑cicd](https://microsoft.github.io/fabric-cicd/)—the open‑source Python deployment library for Microsoft Fabric—is now an officially supported, Microsoft‑backed tool for CI/CD automation across Fabric workspaces.\n\nOver the past year, fabric‑cicd has rapidly evolved through collaboration with engineering, CAT, MVPs, enterprise customers, and the community. Growing usage, strong sentiment across internal and external channels, and adoption by organizations building enterprise‑grade deployment pipelines helped solidify its value within the Fabric ecosystem.\n\nWith this announcement, we’re affirming long-term support, quality, roadmap ownership, and deep integration with the broader Fabric platform—including Git Integration, Fabric REST APIs, the CLI, and future deployment capabilities.\n\nInternal discussions and customer conversations consistently reinforced the value of a reliable cross‑workspace deployment mechanism, particularly in environments where Git Integration and Variable Library don’t fully address all needs, or where deployment pipelines alone don’t support every deployment scenario.\n\nfabric‑cicd is now a fully recognized part of the Fabric CI/CD story.\n\n## Fabric CI/CD tool objectives\n\nIn modern application development, robust DevOps capabilities are essential for delivering reliable, scalable solutions. Customers and partners surfaced challenges around Fabric cross‑workspace deployments, especially in two key areas:\n\n- **Dependencies between Fabric items**, which today require manual orchestration and often cause deployment ordering or binding issues.\n- **Lack of parametrization across many Fabric item types,** limiting the ability to promote the same artifacts across environments (Dev → Test → Prod) in a clean, repeatable way.\n\nThe fabric‑cicd tool directly addresses these gaps: providing a unified, automated deployment engine that handles dependencies, enables parametrization, and reduces the friction of managing multi‑environment workflows. It can also serve as a core component in implementing [Git based deployment using build environment](https://learn.microsoft.com/fabric/cicd/manage-deployment#option-2---git--based-deployments-using-build-environments) option, offering a more customizable and automation‑friendly alternative to built‑in deployment pipelines or pure Git‑based flows., offering a more customizable and automation‑friendly alternative to built‑in deployment pipelines or pure Git‑based flows., offering a more customizable and automation‑friendly alternative to built‑in deployment pipelines or pure Git‑based flows.\n\n## Git-based deployment using build environment\n\nIn this cross‑workspace deployment approach, all deployments originate from the same main branch of your Git repository. Each stage in the release flow (Dev → Test → Prod) has its own Build and Release pipeline, providing full control over validations, approvals, and environment‑specific configuration.\n\nIn this model, pipelines typically use a Build environment to execute unit tests, validate item integrity, and then invoke the fabric‑cicd tool to deploy item definitions into the target workspace. During deployment, the pipeline passes a parameterization file that adjusts environment‑specific settings before items are uploaded.\n\nThis enables teams to reliably customize configuration per stage, for example:\n\n- Updating data source connections\n- Adjusting relationships or bindings between items\n- Injecting environment‑specific parameters\n- Applying configuration transformations required for Test or Production\n\n![Build &amp; Release pipeline flow using fabric-cicd tool.](//dataplatformblogwebfd-d3h9cbawf0h8ecgf.b01.azurefd.net/wp-content/uploads/2026/02/build-and-release-pipeline-flow-using-fabric-cicd-to-1024x522.png)Figure 1 – Suggested build and release pipelines using fabric-cicd tool\n\nThis approach is particularly powerful for teams that need flexible parameterization, dependency management, or granular control over specific items—capabilities readily available within the fabric‑cicd toolbox.\n\nFind out more in our [ci-cd tool documentation](https://microsoft.github.io/fabric-cicd) and [ci-cd tool deployment examples](https://microsoft.github.io/fabric-cicd/0.1.34/example/deployment_variable/).",
  "Tags": [],
  "FeedName": "Microsoft Fabric Blog",
  "Title": "Announcing official support for Microsoft fabric-cicd tool",
  "Description": "Today, we’re announcing that fabric‑cicd—the open‑source Python deployment library for Microsoft Fabric—is now an officially supported, Microsoft‑backed tool for CI/CD automation across Fabric workspaces. Over the past year, fabric‑cicd has rapidly evolved through collaboration with engineering, CAT, MVPs, enterprise customers, and the community. Growing usage, strong sentiment across internal and external channels, and adoption by …\n\n[Continue reading “Announcing official support for Microsoft fabric-cicd tool”](https://blog.fabric.microsoft.com/en-us/blog/announcing-official-support-for-microsoft-fabric-cicd-tool/)"
}
