{
  "FeedUrl": "https://blog.fabric.microsoft.com/en-us/blog/feed/",
  "Link": "https://blog.fabric.microsoft.com/en-US/blog/onelake-sharepoint-and-onedrive-shortcuts-now-support-workspace-and-service-principal-identities-generally-available/",
  "PubDate": "2026-02-19T12:00:00+00:00",
  "FeedLevelAuthor": "Microsoft Fabric Blog",
  "ProcessedDate": "2026-02-19 19:15:46",
  "OutputDir": "_news",
  "Author": "Microsoft Fabric Blog",
  "EnhancedContent": "OneDrive and SharePoint (ODSP) [shortcuts](https://learn.microsoft.com/fabric/onelake/create-onedrive-sharepoint-shortcut) let you use your existing Microsoft 365 files directly in OneLake without copying or moving them. This gives analytics, BI, and AI workloads a unified, governed view of both structured data and documents. This eliminates duplication and silos while enabling powerful scenarios like combining spreadsheets with Lakehouse data, indexing documents for AI, and optionally transforming files into analytics-ready tables that stay in sync.\n\nIn our previous [blog post](https://blog.fabric.microsoft.com/blog/turning-everyday-documents-from-sharepoint-and-onedrive-into-analytics-ready-data-with-onelake-shortcuts), we covered the benefits of using OneDrive and SharePoint Shortcuts and how to get started. Today, we’re sharing an important update that expands how organizations can securely use OneDrive and SharePoint shortcuts at scale.\n\n## What’s new and advantages\n\nWorkspace Identity (WI) and Service Principal (SPN) authentication type support is now generally available for SharePoint and OneDrive Shortcuts. These authentication types unlock several key advantages:\n\n- **Centralized authentication:** Eliminates reliance on individual user credentials, reducing disruptions when users leave the organization.\n- **Improved governance:** Authentication is managed through Microsoft Entra ID, enabling consistent oversight and control.\n- **Higher API limits:** WI and SPN authentication support higher limits, helping reduce throttling.\n- **Cross‑tenant access:** Service principals enable access to SharePoint and OneDrive content across tenants.\n\n### Real-world examples\n\nUsing this feature, customers can accomplish the following:\n\n- A data engineering team eliminates daily credential failures by switching pipelines to service principal–based shortcuts.\n- An organization shares critical Excel Spreadsheets and documents stored in SharePoint and OneDrive with other organizations to support analytics, business intelligence, and AI-driven scenarios.\n\n## How to get started\n\n1. Create a service principal name (SPN) in Microsoft Entra ID. If you use Workspace Identity, then [enable](https://learn.microsoft.com/fabric/security/workspace-identity) Workspace Identity (WI).\n2. Grant the appropriate SharePoint or OneDrive permissions by following the steps in the Configure workspace identity authentication [documentation](https://learn.microsoft.com/fabric/onelake/create-onedrive-sharepoint-shortcut#configure-workspace-identity-authentication).\n3. [Create](https://learn.microsoft.com/fabric/onelake/create-onedrive-sharepoint-shortcut#create-a-shortcut) SharePoint or OneLake Shortcut in a Lakehouse using the SPN or WI.\n\nExplore the SharePoint and OneDrive [documentation](https://learn.microsoft.com/fabric/onelake/create-onedrive-sharepoint-shortcut) to get started, try OneLake Shortcuts in your Lakehouse, and share your feedback to help shape future enhancements.",
  "Tags": [],
  "FeedName": "Microsoft Fabric Blog",
  "Title": "OneLake SharePoint and OneDrive shortcuts now support workspace and service principal identities (Generally Available)",
  "Description": "OneDrive and SharePoint (ODSP) shortcuts let you use your existing Microsoft 365 files directly in OneLake without copying or moving them. This gives analytics, BI, and AI workloads a unified, governed view of both structured data and documents. This eliminates duplication and silos while enabling powerful scenarios like combining spreadsheets with Lakehouse data, indexing documents for AI, and optionally transforming files …\n\n[Continue reading “OneLake SharePoint and OneDrive shortcuts now support workspace and service principal identities (Generally Available)”](https://blog.fabric.microsoft.com/en-us/blog/onelake-sharepoint-and-onedrive-shortcuts-now-support-workspace-and-service-principal-identities-generally-available/)"
}
