{
  "FeedUrl": "https://blog.fabric.microsoft.com/en-us/blog/feed/",
  "Description": "Unlock Flexible Time-Based Reporting with DATE\\_BUCKET() in Microsoft Fabric DW!\n\nMicrosoft Fabric Data Warehouse continues to evolve with powerful features that make analytics easier and more adaptable. One of the latest additions is the DATE\\_BUCKET() function—a game-changer for time-based reporting.",
  "EnhancedContent": "Microsoft Fabric Data Warehouse provides an expressive SQL language that empowers users to easily create a wide range of reports and analytics solutions. With its rich set of built-in functions and intuitive syntax, Fabric Data Warehouse enables data professionals to efficiently transform, aggregate, and analyze data for diverse business needs.\n\nWe have introduced a new **DATE\\_BUCKET()** function in Fabric Data Warehouse SQL language that makes reporting and analytics even easier.\n\nIn this blog post, you’ll discover how it simplifies time-based reporting and makes grouping dates effortless.\n\n## Time-based reporting and analysis\n\nOne of the most common tasks in analytics is aggregating time-based data by years, quarters, or months. The T-SQL language provides a variety of functions such as **DATEPART()**, **YEAR()**, **MONTH()**, or **WEEK()** that enable you to extract specific parts of a date and aggregate your data accordingly. For example, if you want to display a quarterly distribution of sales orders, you can use a query like this:\n\n``` SELECT DATEPART(QUARTER, OrderDate) AS [Quarter], COUNT(*) AS [Number of orders] FROM SalesOrders GROUP BY DATEPART(QUARTER, OrderDate) ORDER BY DATEPART(QUARTER, OrderDate) ```\n\nHowever, challenges arise when you need to build reports on custom time ranges, such as 2-month periods, 3-week periods, or 5-minute intervals where there are no direct built-in functions to match these specific groupings. This is where specialized functions like **DATE\\_BUCKET()** become invaluable, simplifying the process of creating flexible, custom time-based aggregations.\n\nThe **DATE\\_BUCKET()** function bucketizes the date argument into equidistant buckets of the specified width and returns the first date in that bucket. The syntax of this function is:\n\n``` DATE_BUCKET(unit, length, datetime) ```\n\nThis function returns the first datetime in the period of the given length and unit. For the *unit* and *length* parameters, you can specify values such as **3 WEEK**, **5 MINUTE**, **2 MONTH**, or any other integral length.\n\nThe **DATE\\_BUCKET()** function will position the provided datetime within one of these buckets and return the starting date of that bucket, making it easy to aggregate data over custom time intervals.\n\nFor example, the following query uses the **DATE\\_BUCKET()** function to return the distribution of sales orders in 2-month periods instead of quarters:\n\n![A T‑SQL query that groups number of sales orders into consecutive 2‑month intervals. Each row shows the interval start date and the count of orders.](//dataplatformblogwebfd-d3h9cbawf0h8ecgf.b01.azurefd.net/wp-content/uploads/2025/12/image-21-1024x343.png)Number of Sales Orders over 2-month intervals.\n\nYou can easily change the date periods in the report just by changing bucket size to some other value.\n\nFor example, the following report will group the date values in 3-week periods:\n\n![A T‑SQL query that groups sales orders into consecutive 3‑week intervals. Each row shows the interval start date and the count of orders.](//dataplatformblogwebfd-d3h9cbawf0h8ecgf.b01.azurefd.net/wp-content/uploads/2025/12/image-22-1024x440.png)Number of Sales Orders over 3-week intervals.\n\nYou can easily change the interval length and use any bucket size that fits your needs in the reports, making your queries highly adaptable to various time-based analysis scenarios. Whether you need to group data by days, weeks, months, or even custom periods, DATE\\_BUCKET offers the versatility required for modern reporting tasks.\n\n## Conclusion\n\nDATE\\_BUCKET is a small addition to the T-SQL language in Fabric Data Warehouse that you need to be aware of because it might be incredibly useful for building flexible, date-based reports. By allowing you to define custom time intervals, it streamlines complex aggregations and enhances your ability to analyze trends over any period.\n\nLearn more about this function in the [Fabric Data Warehouse documentation](https://learn.microsoft.com/sql/t-sql/functions/date-bucket-transact-sql?view=fabric).",
  "Link": "https://blog.fabric.microsoft.com/en-US/blog/date_bucket-function-in-fabric-data-warehouse/",
  "FeedLevelAuthor": "Microsoft Fabric Blog",
  "PubDate": "2025-12-18T09:00:00+00:00",
  "ProcessedDate": "2025-12-18 16:03:29",
  "Author": "Microsoft Fabric Blog",
  "Tags": [],
  "Title": "DATE_BUCKET() function in Fabric Data Warehouse (Generally Available)",
  "FeedName": "Microsoft Fabric Blog",
  "OutputDir": "_news"
}
