{
  "Link": "https://www.youtube.com/watch?v=5sa58eNiglM",
  "Tags": [
    "DeveloperEducation",
    "freeCodeCamp",
    "GitHubUniverse",
    "LearnToCode",
    "OpenSource",
    "TechCareers"
  ],
  "FeedName": "GitHub YouTube",
  "EnhancedContent": null,
  "ProcessedDate": "2025-12-19 18:05:24",
  "Title": "Replay: Quincy Larson on 10 Years of freeCodeCamp",
  "Author": "GitHub",
  "FeedUrl": "https://www.youtube.com/feeds/videos.xml?channel_id=UC7c3Kb6jYCRj4JOHHZTxKsQ",
  "Description": "Join us for an inspiring conversation with Quincy Larson, the founder of freeCodeCamp—the world's largest free coding education platform. From a former school director working out of a San Francisco apartment closet to leading a global nonprofit that's helped over 400,000 people land developer jobs, Quincy's journey is a masterclass in democratizing tech education.\n\nIn this episode, we'll talk about: Building a sustainable nonprofit that's reached 11+ million YouTube subscribers The real impact of free education: 400,000+ developers hired What's next: Machine Learning and High Performance Computing certifications The future: Associate and Bachelor's degree programs through freeCodeCamp How to learn coding in 2025's AI-powered landscape\n\n\"The most efficient way to learn to code is to learn by building real projects.\" That philosophy has driven freeCodeCamp for a decade, and it's changing lives every single day.\n\n00:00 Introduction and Welcome 00:30 Personal Impact of Free Code Camp 02:01 Quincy Larson's Journey 03:12 The Philosophy Behind Free Code Camp 04:42 Community and Contributions 05:16 Global Reach and Demographics 08:20 Curriculum and Certifications 10:55 AI and the Future of Education 13:53 Building a Career with Free Code Camp 18:43 Advice for Developers 27:27 Conclusion and Partnerships\n\n🔗 Links: freeCodeCamp: https://www.freecodecamp.org freeCodeCamp YouTube: / @freecodecamp Support the mission: https://www.freecodecamp.org/donate\n\nAbout the Guest: Quincy Larson is the founder of freeCodeCamp, a 501(c)(3) nonprofit that has become the world's most popular destination for learning to code. A self-taught developer who got tired of the \"extremely inefficient and circuitous way\" he learned programming, Quincy created freeCodeCamp in 2014 to give others a better path. Today, it serves millions of learners worldwide through interactive courses, thousands of YouTube videos, and a supportive global community.\n\n#freeCodeCamp #LearnToCode #DeveloperEducation #OpenSource #TechCareers #GitHubUniverse",
  "OutputDir": "_videos",
  "PubDate": "2025-12-19T17:57:02+00:00",
  "FeedLevelAuthor": "GitHub"
}
