{
  "Link": "https://partner.microsoft.com/en-us/blog/article/azure-updates-december-2025",
  "Author": "Cyril Belikoff",
  "PubDate": "2025-12-16T18:23:05+00:00",
  "FeedLevelAuthor": "Microsoft Azure Blog",
  "Title": "Azure updates for partners: December 2025",
  "Description": "Organizations leading in AI make it foundational. They rethink processes and integrate new technologies from the start to improve efficiency.\n\nThe post [Azure updates for partners: December 2025](https://partner.microsoft.com/en-us/blog/article/azure-updates-december-2025) appeared first on [Microsoft Azure Blog](https://azure.microsoft.com/en-us/blog).",
  "EnhancedContent": "At [Microsoft Ignite 2025](https://news.microsoft.com/ignite-2025/?msockid=2cf7742e6c74678905de62b76d216664), we explored what it means for organizations to move into the era of Frontier transformation. This shift is focused on embedding AI across every part of the business to improve decision-making, increase speed, and create new value. Organizations leading in AI make it foundational. They rethink processes and integrate new technologies from the start to improve efficiency.\n\nFor partners, this move toward Frontier represents a significant opportunity to lead customers into this new era. By building AI-powered solutions, connecting data for intelligent insights, and deploying Microsoft Azure’s cloud-ready platforms, partners can deliver value faster and scale confidently through the Microsoft ecosystem.\n\nMicrosoft Ignite came with a [significant number of announcements](https://azure.microsoft.com/blog/azure-at-microsoft-ignite-2025-all-the-intelligent-cloud-news-explained/), so I’ve gathered the Azure updates that matter most for partners. These are the capabilities that can strengthen your ability to deliver intelligent solutions, drive operational efficiency, and differentiate your product or service in the market. You can also explore how partners are turning momentum into action, access highlights, and grab practical guidance from my [Microsoft Ignite session](https://ignite.microsoft.com/sessions/BRK214?source=sessions).\n\n### **Azure Copilot: Now in private preview**\n\nAzure Copilot introduces specialized agents to the Azure portal, PowerShell, and CLI. Powered by Azure Resource Manager (ARM)-driven scenarios and advanced AI models from Microsoft and partners, Azure Copilot streamlines migration, assessment, and modernization activities with data-driven insights, guided workflows, and improved governance across customer environments. For partners, this creates a unified way to deliver intelligent automation for cloud workloads, accelerate modernization projects, reduce operational overhead, and strengthen governance through integrated agentic workflows across Azure and GitHub Copilot.\n\nFor more information, check out these additional resources:\n\n- Blog: [Ushering in the Era of Agentic Cloud Operations with Azure Copilot](https://techcommunity.microsoft.com/blog/azureinfrastructureblog/ushering-in-the-era-of-agentic-cloud-operations-with-azure-copilot/4469664?previewMessage=trueus/products/copilot)\n- Microsoft Ignite session: [Agentic AI Tools for Partner-Led Migration and Modernization Success](https://ignite.microsoft.com/sessions/PBRK151?source=sessions)\n- Microsoft Ignite session: [Partners: Accelerate Secure Migrations and Innovate in the Era of AI](https://ignite.microsoft.com/sessions/PBRK271?source=sessions)\n\n### **Foundry Control Plane: Now in public preview**\n\nMicrosoft Foundry Control Plane extends Agent 365 by bringing unified visibility, security, and control to AI agents operating across the Microsoft Cloud. It centralizes policy management, lifecycle governance, and observability, offering a consistent way to manage agent behavior and performance. By providing enterprise-grade governance and security capabilities that support safe, scalable, and efficient agent management for customers across varied environments, Control Plane empowers confident deployment and operation of AI-powered solutions.\n\nFor more information, review these additional resources:\n\n- Microsoft Learn: [What is the Microsoft Foundry Control Plane?](https://learn.microsoft.com/azure/ai-foundry/control-plane/overview?view=foundry)\n- Microsoft Ignite session: [Build Partner Advantage: Drive Key AI Use-Cases with Azure Tech Stack](https://ignite.microsoft.com/sessions/PBRK208?source=sessions)\n\n### **Foundry IQ: Now in public preview**\n\nFoundry IQ provides a unified endpoint for agent knowledge, automating source routing and retrieval workflows through Azure AI Search. It equips agents to work with enterprise content securely and with greater contextual grounding by connecting a unified knowledge base to multiple data sources. For partners, this creates a streamlined way to build retrieval augmented generation (RAG) solutions, link agents to customer-specific knowledge sources, and deliver consistent, context-rich capabilities that empower organizations to unlock more value from their data.\n\nRead our blog to learn more: [Foundry IQ: Unlocking ubiquitous knowledge for agents](https://techcommunity.microsoft.com/blog/azure-ai-foundry-blog/foundry-iq-unlocking-ubiquitous-knowledge-for-agents/4470812)\n\n### **Fabric IQ: Now in public preview**\n\n[Microsoft Fabric IQ](https://blog.fabric.microsoft.com/blog/from-data-platform-to-intelligence-platform-introducing-microsoft-fabric-iq) offers a live, unified view of enterprise data and AI agents, organizing information by business concepts and using OneLake to support real-time analytics across hybrid and multicloud environments. For partners, Fabric IQ creates a foundation for building intelligent, context-aware solutions that align to business processes, accelerate analytics performance, and strengthen governance to improve reliability and efficiency across customer deployments.\n\nFor more information, check out these additional resources:\n\n- Blog: [From Data Platform to Intelligence Platform: Introducing Microsoft Fabric IQ](https://blog.fabric.microsoft.com/blog/from-data-platform-to-intelligence-platform-introducing-microsoft-fabric-iq?ft=All)\n- Microsoft Ignite session: [Microsoft Fabric IQ: Turning unified data into unified intelligence](https://ignite.microsoft.com/sessions/BRK222?source=/speakers/810265b1-16de-412d-b047-8afb59c11007)\n- Microsoft Ignite session: [How Microsoft's data platform is creating value for partners](https://ignite.microsoft.com/sessions/PBRK231?source=sessions)\n\n### **Microsoft Agent Factory: Now available**\n\nMicrosoft Agent Factory is a new program designed for organizations that want to move from experimentation to execution faster. At the heart of this program is the Microsoft Agent Pre-Purchase Plan (P3), which streamlines procurement and reduces complexity. With P3, partners can offer their customers access to 32 Microsoft services through one flexible pool of funds, eliminating the need to manage multiple contracts or choose between platforms. This single metered plan not only reduces upfront licensing and provisioning but also supports greater predictability for organizations investing in AI innovation. Eligible organizations can also tap into hands-on support from top AI Forward Deployed Engineers (FDEs) and access tailored, role-based training to boost AI fluency across teams. Together, they unlock new opportunities for growth and innovation while encouraging customers to confidently embrace the future of AI.\n\nRead our blog to learn more: [Accelerate innovation with Microsoft Agent Factory](https://techcommunity.microsoft.com/blog/azure-ai-foundry-blog/introducing-microsoft-agent-factory/4470732)\n\n### **Microsoft Foundry: Anthropic Claude models are now available**\n\n[Microsoft Foundry](https://ai.azure.com/catalog/models) now offers Anthropic Claude models that support advanced reasoning for research, coding, and agentic workflows, all within the Microsoft unified governance and observability framework. For partners, this expands choice across model capabilities to develop multistep agents using the right model per task while maintaining governance and deployment consistency across Azure, Foundry, and Microsoft 365 Copilot environments.\n\nRead our blog to learn more: [Introducing Anthropic’s Claude models in Microsoft Foundry: Bringing Frontier intelligence to Azure](https://azure.microsoft.com/blog/introducing-anthropics-claude-models-in-microsoft-foundry-bringing-frontier-intelligence-to-azure/?msockid=162c0e87ae0865133121180fafe264d0)\n\n### **Resale enabled offers: Now available through Microsoft Marketplace**\n\n[Resale enabled offers](https://learn.microsoft.com/partner-center/marketplace-offers/resale-enabled-offers-overview?wt.mc_id=pp2e7gt31s) are now available in nearly all Marketplace-supported regions, allowing software companies to work with channel partners to manage listings and expand reach. For partners, this creates new channel-led sales opportunities by making it easier to promote and manage listings on behalf of publishers and reach more customers globally without adding operational complexity.\n\nFor more information, check out these resources:\n\n- Marketplace: [Cloud solutions, AI apps, and agents](https://marketplace.microsoft.com/)\n- Blog: [The Microsoft Marketplace opportunity for channel ecosystem](https://partner.microsoft.com/blog/article/microsoft-marketplace-november-2025)\n- Microsoft Ignite session: [Executing on the channel-led marketplace opportunity for partners](https://ignite.microsoft.com/en-US/sessions/PBRK420?source=sessions)\n- Microsoft Ignite session: [Marketplace success for partners—from SMB to enterprise](https://ignite.microsoft.com/sessions/PBRK424?source=sessions)\n- Microsoft Ignite session: [Partner: Benefits for Accelerating Software Company Success](https://ignite.microsoft.com/sessions/PBRK418?source=sessions)\n\n### ****\n\n### **Azure HorizonDB for PostgreSQL: Now in private preview**\n\n[Azure HorizonDB](https://azure.microsoft.com/products/horizondb) is a new PostgreSQL cloud database for mission-critical applications and modern AI workloads, offering auto-scaling storage, rapid compute scale out, advanced vector indexing, and integration with the Microsoft AI and analytics ecosystem. For partners, HorizonDB supports the development of intelligent and resilient applications, modernization of legacy systems, and creation of high-performance data platforms designed for security, scale, and future AI workloads.\n\nCheck out these additional resources:\n\n- Blog: [Announcing Azure HorizonDB](https://techcommunity.microsoft.com/blog/adforpostgresql/announcing-azure-horizondb/4469710)\n- Preview sign-up: [Apply for the preview here](https://aka.ms/PreviewHorizonDB)\n- Microsoft Ignite session: [Azure HorizonDB: Deep Dive into a New Enterprise-Scale PostgreSQL](https://ignite.microsoft.com/sessions/7fbd0483-f651-4c33-ab47-79d2eb6d50c1)\n\n### **Microsoft Agent 365: The control plane for AI agents**\n\n[Agent 365](https://learn.microsoft.com/microsoft-agent-365/overview) extends the Microsoft user management infrastructure to AI agents, empowering organizations to govern agents across Microsoft 365, Azure, and Foundry. Available in the Microsoft 365 admin center with the [Frontier program](https://adoption.microsoft.com/copilot/frontier-program/), it combines capabilities from Microsoft 365 Defender, Entra, Purview, and Microsoft 365 for unified security, productivity, and management. For partners, this creates a consistent approach to deploying, securing, and managing fleets of AI agents across customer environments with streamlined governance and operational clarity.\n\nRead our blog to learn more: [Microsoft Agent 365: The control plane for AI agents](https://www.microsoft.com/microsoft-365/blog/2025/11/18/microsoft-agent-365-the-control-plane-for-ai-agents/)\n\n### **Looking forward**\n\nMicrosoft Ignite is about more than product updates; it’s a time to celebrate what we can achieve together as partners. Continue your journey and explore the [Cloud & AI Platforms partner sessions at Microsoft Ignite](https://ignite.microsoft.com/Sessions?filter=audienceTypes%2FlogicalValue%3EPartner+Business&amp;filter=topic%2FlogicalValue%3EMigrate+and+modernize+your+estate&amp;filter=topic%2FlogicalValue%3EInnovate+with+Azure+AI+apps+and+agents&amp;filter=topic%2FlogicalValue%3EUnify+your+data+platform&amp;onDemand=1) and read the [Azure at Microsoft Ignite 2025: All the intelligent cloud news explained](https://azure.microsoft.com/blog/azure-at-microsoft-ignite-2025-all-the-intelligent-cloud-news-explained/) blog post for more product updates.\n\nStay connected with us. Follow [Microsoft Partner on LinkedIn](https://www.linkedin.com/company/3634496), join the conversation in our [Partner News Community](https://aka.ms/MPC-Azurediscussionboard), and explore the Microsoft [partner site](https://partner.microsoft.com/) to keep your momentum going.\n\nFor details on recent announcements, please read the “What’s new in Azure for Partners” newsletter on the Microsoft Community Hub and follow the tag “Azure News” to stay updated.\n\n- [November update: What's new in Azure for Partners | Microsoft Community Hub](https://techcommunity.microsoft.com/blog/partnernews/november-update-whats-new-in-azure-for-partners/4474300)\n- [October update: What's new in Azure for Partners | Microsoft Community Hub](https://techcommunity.microsoft.com/blog/partnernews/october-update-whats-new-in-azure-for-partners/4465999?previewMessage=true)\n\n![image](/Images/Related Blogs.png)\n\n#### Related blogs\n\n[##### Lead SMBs into the AI frontier with Microsoft 365 Copilot Business](https://partner.microsoft.com/en-us/blog/article/copilot-business-for-smbs)\n\n[Alex Zagury](https://partner.microsoft.com/en-us/blog/author/alex-zagury) • 5 min\n\n[##### Building an AI app and agent factory with Microsoft Foundry](https://partner.microsoft.com/en-us/blog/article/cloud-and-ai-series-part-4)\n\n[Dave Miller](https://partner.microsoft.com/en-us/blog/author/dave-miller) • 4 min\n\n[##### Secure migration starts with trusted cloud and AI expertise](https://partner.microsoft.com/en-us/blog/article/accelerating-secure-azure-migrations)\n\n[Dave Miller](https://partner.microsoft.com/en-us/blog/author/dave-miller) • 3 min\n\n[##### Azure updates for partners: November 2025](https://partner.microsoft.com/en-us/blog/article/azure-updates-november-2025)\n\n[Cyril Belikoff](https://partner.microsoft.com/en-us/blog/author/cyril-belikoff) • 6 min\n\n#### Share article\n\nhttps://www.linkedin.com/shareArticle?mini=true&amp;url=https://partner.microsoft.com/en-us/blog/article/azure-updates-december-2025 https://www.facebook.com/sharer/sharer.php?u=https://partner.microsoft.com/en-us/blog/article/azure-updates-december-2025 https://twitter.com/share?url=https://partner.microsoft.com/en-us/blog/article/azure-updates-december-2025",
  "FeedUrl": "https://azure.microsoft.com/en-us/blog/feed/",
  "OutputDir": "_news",
  "FeedName": "The Azure Blog",
  "Tags": [
    "AI",
    "AI + machine learning",
    "Copilot",
    "Management and governance"
  ],
  "ProcessedDate": "2026-01-01 15:27:41"
}
