{
  "Author": "Anna Hoffman",
  "Description": "The SQL community is gathering in Atlanta this March for the first‑ever SQLCon, co‑located with FabCon, the Microsoft Fabric Community Conference, March 16-20.\n\nThe post [Five Reasons to attend SQLCon](https://blog.fabric.microsoft.com/en-us/blog/32624) appeared first on [Microsoft Azure Blog](https://azure.microsoft.com/en-us/blog).",
  "Tags": [
    "AI",
    "Compute",
    "Databases",
    "Hybrid + multicloud",
    "Microsoft Fabric"
  ],
  "OutputDir": "_news",
  "EnhancedContent": "The SQL community is gathering in Atlanta this March for the first‑ever [**SQLCon**](https://sqlcon.us/), co‑located with **FabCon**, the Microsoft Fabric Community Conference, March 16-20. One registration unlocks both events, giving you access to deep SQL expertise *and* the latest in Fabric, Power BI, data engineering, real‑time intelligence, and AI. Whether you’re a DBA, developer, data engineer, architect, or a leader building data‑driven team, this is your chance to learn, connect, and shape what’s next.\n\n## 1. One pass, two conferences—double the value\n\nRegister once, benefit twice. With SQLCon and FabCon under the same roof, you can mix a deep SQL session in the morning with a Fabric or AI talk in the afternoon, then drop into the shared expo and community lounge. It’s a seamless, high‑impact week that lets specialists go deep while cross‑functional teams build a common language across data, analytics, and AI.\n\n## 2. Dive Deep with Interactive Sessions and Hands-On Workshops\n\nThere are [50 SQL sessions](https://sqlcon.us/program/tracks) at SQLCon. Fifty! The program is designed for momentum. Across the week, you’ll find practical content on SQL Server, Azure SQL, SQL database in Fabric, performance tuning, security and governance, migration and modernization, and building AI‑powered experiences with SQL. Monday and Tuesday are hands‑on workshop days—bring your laptop and leave with repeatable scripts, patterns, and demos you can apply immediately. Wednesday through Friday, you’ll stack conference sessions to round out your plan for the year.\n\n## 3. Experience Atlanta: The Perfect Setting for SQLCon\n\nSQLCon + FabCon take place at the Georgia World Congress Center, in the heart of a walkable downtown that’s tailor‑made for a great conference week. You’ll be just a short walk from Centennial Olympic Park, near State Farm Arena—home to major keynote events—and amid lively dining and music options. The **attendee party is at the Georgia Aquarium**, an unforgettable after‑hours experience with spectacular exhibits and a perfect setting for relaxed conversations with peers and product teams. Want a quick vibe check on the city and the conference energy? Watch the short video of Guy in a Cube and me:\n\n## 4. Announcements on roadmap, engineering insights, and live updates\n\nIf you want to understand where SQL Server, Azure SQL, and SQL database in Fabric are heading, this is the place. Expect direct updates from engineering (we’re sending over 30 members from the SQL product team); first‑look announcements; and live demos of upcoming capabilities across SQL tooling and drivers, SSMS/VS Code extensions, Copilot integrations, and Fabric SQL experiences. You’ll leave with clarity on what’s coming, how it impacts your environment, and where to invest next.\n\n## 5. The SQL Community: Revitalized and Engaged\n\nSQLCon goes beyond a conference—it’s a gathering where the lounge hosts meetups and active conversations. Ask‑the‑Experts sessions connect you with engineers, MVPs, and product teams. Shared keynotes bring everyone together, and the city makes it easy to extend conversations into the evening. Bring your toughest questions, real-world challenges, and bold goals—you’ll leave with practical solutions, valuable connections, and new inspiration.\n\n## Bonus: make the budget work\n\nDepending on timing, look for early‑bird pricing, team discounts, or buy‑one‑get‑one offers on the registration page. These deals move fast, so check what’s live when you register. You can always use **SQLCMTY200** for $200 off!\n\n## Wrap‑up: build the next chapter of your data strategy at SQLCon\n\nSQLCon + FabCon is the highest‑leverage week of the year to sharpen your technical skills, understand SQL’s next chapter, accelerate modernization and performance, and build meaningful connections across the global community. If SQL plays *any* role in your data estate, this is the one event you shouldn’t miss.\n\n**See you in Atlanta!**",
  "ProcessedDate": "2026-02-11 01:32:19",
  "Title": "Five Reasons to attend SQLCon",
  "FeedLevelAuthor": "Microsoft Azure Blog",
  "FeedUrl": "https://azure.microsoft.com/en-us/blog/feed/",
  "PubDate": "2026-02-09T15:12:12+00:00",
  "FeedName": "The Azure Blog",
  "Link": "https://blog.fabric.microsoft.com/en-us/blog/32624"
}
