{
  "Link": "https://devblogs.microsoft.com/autogen/autogen-reimagined-launching-autogen-0-4/",
  "ProcessedDate": "2025-08-24 16:27:43",
  "PubDate": "2025-01-17T23:39:51+00:00",
  "FeedLevelAuthor": "AutoGen Blog",
  "Title": "AutoGen reimagined: Launching AutoGen 0.4",
  "FeedUrl": "https://devblogs.microsoft.com/autogen/feed/",
  "EnhancedContent": "We are thrilled to announce the release of [AutoGen v0.4](https://microsoft.github.io/autogen/stable/)! This new version represents a complete redesign of the AutoGen library, focusing on improved code quality, robustness, usability, and scalability of agentic workflows. This release sets the stage for a robust ecosystem to drive advances in agentic AI.\n\n**Key Features:**\n\n- **Asynchronous Messaging:** Agents now communicate through asynchronous messages, supporting both event-driven and request/response interaction patterns.\n- **Modular and Extensible:** Create easily customize systems with pluggable components, including custom agents, tools, memory, and models. Build proactive and long-running agents.\n- **Full type support:** Interfaces and extensive typing are enforced in the library, ensuring consistent and high-quality code and dependable APIs.\n- **Layered architecture:** With a new layered and modular approach users can target the level of abstraction that their scenario requires.\n- **Observability and Debugging:** Built-in tools for tracking, tracing, and debugging agent interactions and workflows, with support for OpenTelemetry.\n- **Scalable and Distributed:** Design complex, distributed agent networks that operate seamlessly across organizational boundaries.\n- **Cross-Language Support:** Interoperability between agents built in different programming languages, currently supporting Python and .NET.\n- **Built-in and community extensions**: Support for community extensions allows open-source developers to manage their own extensions to enhance the framework’s functionality.\n\n**Layered Architecture**\n\n[![A screenshot of a computer AI-generated content may be incorrect.](data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAASwAAAC4AQMAAABjM0PXAAAAA1BMVEXW1taWrGEgAAAACXBIWXMAAA7EAAAOxAGVKw4bAAAAHUlEQVRYhe3BAQ0AAADCoPdPbQ8HFAAAAAAAAPBmHAgAAW3G1O8AAAAASUVORK5CYII=)](https://devblogs.microsoft.com/autogen/wp-content/uploads/sites/86/2025/01/a-screenshot-of-a-computer-ai-generated-content-m-4.png)\n\nFigure 1. The v0.4 update introduces a cohesive AutoGen ecosystem that includes the framework, developer tools, and applications. The framework’s layered architecture clearly defines each layer’s functionality. It supports both first-party and third-party applications and extensions.\n\n**Framework:**\n\n- **Core API:** The foundation layer offering a scalable, event-driven actor framework for creating agentic workflows\n- **AgentChat API:** Built on Core, offering a task-driven, high-level framework for building interactive agentic applications. It is a replacement for AutoGen v0.2.\n\n**Developer Tools:**\n\n- **AutoGen Bench:** Benchmark agents by measuring and comparing performance across tasks and environments.\n- **AutoGen Studio:** Rebuilt on the v0.4 AgentChat API, this enhanced low-code interface enables rapid prototyping of AI agents. The tool features real-time agent updates, mid-execution control, message flow visualization, drag-and-drop builder and more.\n\n**Apps:**\n\n- **Magentic-One:** A new generalist multi-agent application to solve open-ended web and file-based tasks across various domains.\n\n**Migrating to AutoGen v0.4**\n\nDespite the new architecture of v0.4, the library offers a path to facilitate a smooth upgrade of applications built on v0.2. The AgentChat API maintains the same level of abstraction as v0.2, making it easy to migrate existing code to v0.4. For example, AgentChat offers an AssistantAgent and UserProxy agent with similar behaviors to those in v0.2. It also provides a team interface with implementations like RoundRobinGroupChat and SelectorGroupChat, which cover all the capabilities of the GroupChat class in v0.2.\n\nFor detailed guidance on how to migrate se the [migration guide](https://aka.ms/autogen-migrate).\n\n**What’s Next?**\n\nWe will soon release a .NET version of v0.4!\n\nOur roadmap includes built-in extensions and applications as well as fostering a community-driven ecosystem of extensions and applications—some of which are already being developed by users.\n\nWe’re certainly not stopping here! There’s plenty of exciting new features on the roadmap and we’re going to be releasing more frequently going forward.\n\nWe encourage you to engage with us on [AutoGen’s discord](https://discord.gg/HeEdc5nu) channel and share feedback on the official AutoGen [repository](https://github.com/microsoft/autogen) via GitHub Issues.",
  "Tags": [
    "Announcements",
    "Autogen",
    "new release"
  ],
  "Description": "We are thrilled to announce the release of AutoGen v0.4! This new version represents a complete redesign of the AutoGen library, focusing on improved code quality, robustness, usability, and scalability of agentic workflows. This release sets the stage for a robust ecosystem to drive advances in agentic AI. Key Features: Asynchronous Messaging: Agents now communicate […]\n\nThe post [AutoGen reimagined: Launching AutoGen 0.4](https://devblogs.microsoft.com/autogen/autogen-reimagined-launching-autogen-0-4/) appeared first on [AutoGen Blog](https://devblogs.microsoft.com/autogen).",
  "OutputDir": "_news",
  "FeedName": "Microsoft AutoGen Blog",
  "Author": "Friederike Niedtner"
}
