{
  "Link": "https://jessehouwing.net/github-actions-improved-dependency-submission/",
  "Author": "Jesse Houwing",
  "PubDate": "2025-12-27T18:47:09+00:00",
  "FeedLevelAuthor": "Scrum Bug",
  "Title": "Improved Dependency Submission for GitHub Actions",
  "Description": "Recently someone brought to my attention that when pin your actions, Security Advisories for GitHub actions do not show up in the Dependency Graph. I set about a solution to solve that problem.",
  "EnhancedContent": "If you've read some of my earlier blogs about GitHub Actions Security, you may have followed my advice to pin your actions and configure Dependabot. Recently someone brought to my attention Security Advisories for GitHub actions do not show up in the Dependency Graph in that case and Dependabot won't create security updates.\n\nI decided to solve that problem.\n\n## Background\n\nWhen a security vulnerability is found and a security advisory is created, it will have the action and its affected versions as metadata. **Versions**, not **SHAs**.\n\nWhen Automatic Dependency Submission submits the versions of actions used by a repository it records:\n\n- `@v1.2.3`\nas `1.2.3`\n- `@v1`\nas `1.*.*`\n- `8e8c483db84b4bee98b60c0593521ed34d9990e8`\nas `8e8c483db84b4bee98b60c0593521ed34d9990e8`\n\nThe Security Advisory Database can't match `8e8c483db84b4bee98b60c0593521ed34d9990e8` against the vulnerable version range and won't show the vulnerability in the dependency graph.\n\nAnother issue exists when actions are forked to an organization (a common technique to create a private actions marketplace). The dependency is recorded using the organization name that holds the fork, not the upstream.\n\nThe Security Advisory Database can't match `myorg/actions_checkout` against the vulnerable action `actions/checkout` and won't show the vulnerably in the dependency graph.\n\n## Impacted features\n\nWithout recording the exact version of each action used, a number of features won't work as you might expect:\n\n- Dependency Graph won't show which actions you use are vulnerable.\n- Dependabot Security Updates won't be created for workflows using vulnerable actions.\n- Dependency Review Action won't block pull requests introducing vulnerable actions into your workflows.\n\n## Solution\n\nTo solve the issue I created a new manual submission action which mimics the automatic submission, but adds a few extra features:\n\n- It resolves the SHA to the highest, most specific version and records that as an additional dependency.\n- It resolves a wildcard version to the current specific version and records that as an additional dependency.\n- It can be configured to look up the upstream of a forked action and records that as an additional dependency.\n\nWith these additional dependencies recorded, the Dependency Graph now contains all the metadata to determine whether the GitHub actions you depend on are vulnerable and all features should now work as expected.\n\n## How to\n\nChanging how Actions' dependencies are reported, you simply add my `jessehouwing/actions-dependency-submission` action to your workflows (and optionally add `actions/dependency-review-action` :\n\n```yaml name: Submit and validate dependencies of GitHub Actions\n\non: push: branches:\n- main\npull_request: schedule:\n- cron: '33 4 * * *'\n\npermissions: {}\n\njobs: submit-actions-dependencies: runs-on: ubuntu-latest permissions:\n# submitting dependencies requires 'contents: write'\ncontents: write\n\nsteps:\n- uses: actions/checkout@8e8c483db84b4bee98b60c0593521ed34d9990e8 # v6.0.1\n- uses: jessehouwing/actions-dependency-submission@e848a29fd84b874cce3e45ceb00619bc72dbeca3 # 1.0.2\nwith: token: ${{ secrets.GITHUB_TOKEN }}\n- uses: actions/dependency-review-action@3c4e3dcb1aa7874d2c16be7d79418e9b7efd6261 # 4.8.2\nif: github.event_name == 'pull_request' with: retry-on-snapshot-warnings: true ```\n\nYou can test whether the action is working correctly by adding a vulnerable action to your repository:\n\n```yaml name: Submit Dependencies on: workflow_dispatch:\n\njobs: submit-dependencies: if: false runs-on: ubuntu-latest permissions: {} steps:\n- uses: actions/download-artifact@eaceaf801fd36c7dee90939fad912460b18a1ffe # v4.1.2\n```\n\nThis should show as a **high** vulnerability in the Dependency graph of the repository:\n\n![](https://jessehouwing.net/content/images/2025/12/image-1.png)Dependency Graph showing `actions/download-artifact@v4.1.2` as vulnerable. And you'll also see the original report using the SHA:\n\n![](https://jessehouwing.net/content/images/2025/12/image-2.png)Dependency Graph showing `actions/download-artifact` referenced by SHA. You can find the action and additional documentation and examples here:\n\n[GitHub - jessehouwing/actions-dependency-submission: Action to automatically report versions for pinned action dependencies Action to automatically report versions for pinned action dependencies - jessehouwing/actions-dependency-submission !\\[\\](https://jessehouwing.net/content/images/icon/pinned-octocat-093da3e6fa40-3.svg)GitHubjessehouwing !\\[\\](https://jessehouwing.net/content/images/thumbnail/actions-dependency-submission)](https://github.com/jessehouwing/actions-dependency-submission?ref=jessehouwing.net)",
  "FeedUrl": "https://jessehouwing.net/rss/",
  "OutputDir": "_blogs",
  "FeedName": "Jesse Houwing's Blog",
  "Tags": [
    "GitHub",
    "GitHub Actions",
    "Security",
    "Supplychain Security"
  ],
  "ProcessedDate": "2026-01-01 15:29:29"
}
