{
  "Tags": [
    "GitHub",
    "GitHub Actions",
    "Technical Practices"
  ],
  "ProcessedDate": "2026-02-07 11:04:03",
  "OutputDir": "_blogs",
  "EnhancedContent": "As a maintainer of 3 GitHub Actions, I've always struggled a bit with the versioning of them. GitHub's documentation provides guidance, but no easy way to verify you did everything right. Based on a quick scan of the actions on the marketplace I'm not alone, even some of GitHub's own actions have some inconsistencies when it comes to it.\n\nThis is why I cobbled together v1 of my Actions Semver Checker action a couple of years ago and it has served me well. But as I threw the action together in a short amount of time way back when, it contained a few bugs, was very hard to maintain and I always dreaded making changes to it, since I had fixed my own repos, so it was hard to test whether I broke anything or accidentally introduced unwanted side effects.\n\nThis is why I had Copilot Agent use the existing v1 implementation as a blueprint to build a new version. But with a lot of improvements. I gave Copilot the order to refactor the action with the following constraints:\n\n- Make sure the old implementation and the new one can be called side-by-side so it's easy to compare the differences.\n- Extract the validation rules into separate scripts so they're easier to maintain and test.\n- Provide manual remediation options wherever possible.\n- Implement an autofix functionality which tries to execute the manual remediation steps.\n- Add unit tests for everything.\n- Add integration tests for everything.\n- Try to remain backwards compatible with v1 as much as possible when it comes to the inputs.\n- I gave it links to all the relevant GitHub docs and blogs for:\n- GitHub CLI release commands\n- Releases REST API\n- Tags REST API\n- GitHub's GraphQL API\n- Blogs discussing immutable releases\n- GitHub Actions versioning\n\nI used Claude Opus to generate a plan for this, since it's a pretty big effort. I went over the plan and made a few tweaks and then had the Copilot Coding Agent spend a good 45 minutes to do the work. And this resulted in my first vibe coded GitHub Action. And the result? It did mostly what it needed to do. It surfaced a couple of gaps in the initial plan and the request to keep both old and new code side-by-side caused some interesting interweaving between the 2 implementations.\n\nBut now that I had a test suite of 90+ tests, I felt much better changing the actual behavior. And after many round trips with the Copilot Coding Agent as well as a few hands-on sessions inside Visual Studio Code with Copilot, I am proud to release v2 of the GitHub Actions Semver Checker Action.\n\n[GitHub - jessehouwing/actions-semver-checker: This action checks the version tags in your repository to ensure correct semantic versioning behavior. This action checks the version tags in your repository to ensure correct semantic versioning behavior. - jessehouwing/actions-semver-checker !\\[\\](https://jessehouwing.net/content/images/icon/pinned-octocat-093da3e6fa40-4.svg)GitHubjessehouwing !\\[\\](https://jessehouwing.net/content/images/thumbnail/actions-semver-checker)](https://github.com/jessehouwing/actions-semver-checker/?ref=jessehouwing.net)\n## What does it do exactly?\n\nGood question, the action is meant to be installed into the repository which hosts a GitHub action, like `actions/checkout` or `jessehouwing/actions-semver-checker` . It analyzes all branches, tags and releases and validates them based on a number of rules:\n\n- There should be a vX tag or branch (configurable) which points to the latest vX.y.z tag.\n- There should be a vX.Y tag or branch (configurable) which points to the latest vX.Y.z tag.\n- There should be a vx.y.z tag\n- There should be *no* vx.y.z branch\n- **new -** There should be a release for every vx.y.z tag\n- **new -** That release should be immutable\n- **new -** The release for the highest vx.y.z should be set to \"latest\"\n- **new -** There should be *no* release for vX and vX.Y tags\n- **new -** The action should be published to the marketplace\n- **new -** The action.yml should have the correct metadata elements\n- **new -** The latest version of the action should be published to the marketplace\n- **new -** Immutable releases should be turned on\n\nAnd for almost all of these validations, I managed to build an autofix option which automatically corrects any issues found.\n\n## What's new\n\nAs you can see in the list above, v2 adds a lot of new validations and it also adds the autofix feature to automatically resolve most of the issues found. If the action is not able to fix the issue, manual remediation steps are logged to the workflows summary pages.\n\nAutofixes available:\n\n- delete/update/create branches\n- delete/update/create tags\n- convert branch to tag\n- convert tag to branch\n- delete/update/create/publish releases\n- automatically set the latest version\n- republish releases to make them immutable\n\nThere are a few other improvements worth noting:\n\n- Fully configurable which suites of rules you want to run\n- You no longer need to check out the whole repo to run the action\n- Retry logic and handling of rate limits\n- Available as module on the PowerShell Gallery\n\nThere is one unfortunate change to v1 I could not work around\n\n- You should pass the `${{ secrets.GUTHUB_TOKEN }}`\nto the `token:` input of the action\n- For some validations the token must have `contents: write`\npermissions (to read draft releases)\n- For autofix functionality the token must have `contents: write`\npermissions\n- To fix certain issues, the token needs permissions which cannot be granted to GitHub Actions, such as `workflows: write`\n. Use a GitHub App or Fine-grained Personal Access Token instead.\n\n## Recommended usage\n\nI recommend you install the action into your action repository with its default settings, this will analyze your repo and will detect all rule violations.\n\nChange the settings of the action to match your desired behavior:\n\n- `floating-versions-use`\ncan be set to `tags` or `branches` depending on how you want to manage the `vx` and `vx.y` versions.\n- `check-minor-version`\ncan be set to `none` , `warning` or `error` to validate the existence of `vx.y` versions.\n- `check-releases`\ncan be set to `none` , `warning` or `error` to validate the existence of releases for `vx.y.z` tags.\n- `check-release-immutability`\ncan be set to `none` , `warning` or `error` to validate whether releases are immutable.\n- `ignore-preview-releases`\ncan be set to `true` or `false` to exclude preview releases when checking floating versions (`vx` an `vx.y` ).\n- `ignore-versions`\ncan exclude versions from validation completely. This can be used to ignore really old versions or versions that were accidentally made immutable and can no longer be fixed.\n\n```yaml name: Check SemVer\n\non: push: branches: ['main'] tags:\n- '*'\nworkflow_dispatch:\n\npermissions: {}\n\njobs: check-semver: permissions: contents: write\n\nconcurrency: group: '${{ github.workflow }}' cancel-in-progress: true\n\nruns-on: ubuntu-latest\n\nsteps:\n- uses: jessehouwing/actions-semver-checker@v2\nwith: token: ${{ secrets.GITHUB_TOKEN }} check-release-immutability: none ```\n\n> ⚠️ be extra careful with the `check-release-immutability`\n> setting prior to turning on autofix. Most automatic fixes can be easily undone using the git commandline, but once a release is made immutable, there is no way back.\n\nOnce your existing tags have been cleaned up and you understand the implications, turn on release immutability checks:\n\n```yaml steps:\n- uses: jessehouwing/actions-semver-checker@v2\nwith: token: ${{ secrets.GITHUB_TOKEN }} check-release-immutability: error ```\n\nUse the action in read-only mode for a while, manually performing the suggested remediation steps.\n\nWhen you're confident the action does what you want it to do, consider turning on `autofix: true` .\n\n```yaml steps:\n- uses: jessehouwing/actions-semver-checker@v2\nwith: token: ${{ secrets.GITHUB_TOKEN }} autofix: true ```\n\nWith autofix turned on, the only thing you need to do to release a new version and update all tags and releases, is to push a new tag to to create a new release with the correct name: `vx.y.z` . This will trigger autofix to do the rest on your behalf.",
  "Description": "As a maintainer of 3 GitHub Actions, I've always struggled a bit with the versioning of them. GitHub's documentation provides guidance, but no easy way to verify you did everything right. Based on a quick scan of the actions on the marketplace I'm not alone, even GitHub's own actions have some.",
  "PubDate": "2026-02-07T10:34:01+00:00",
  "FeedLevelAuthor": "Scrum Bug",
  "Title": "Automatic versioning for GitHub Actions authors",
  "Link": "https://jessehouwing.net/github-actions-automatic-versioning-for-actions/",
  "FeedName": "Jesse Houwing's Blog",
  "Author": "Jesse Houwing",
  "FeedUrl": "https://jessehouwing.net/rss/"
}
